{"body": "\n\n\n\n109115 Engine & Transmission Component BuyerDescriptionCompany General InformationTOYOTA is one of the world’s largest automobile manufacturers and a leading global corporation.  Founded in 1937. Toyota now sells vehicles in 170 countries and employs over 300.000 people.Based in Brussels, Belgium, and staffed by 2.700 people and more than 60 nationalities, Toyota Motor Europe (TME) handles the wholesale marketing of Toyota and Lexus vehicles, parts & accessories, and manages Toyota’s European R&D, manufacturing and engineering operations.Team / Division DescriptionThe Purchasing team at Toyota Motor Europe is located in the heart of Europe. Our department plays a key strategic role in the development of our future products. As a Buyer you will be able to develop and manage all aspects of the commercial relationship between Toyota and its suppliers, located all over Europe. Moreover, this position will allow you to have an insight in the most recent technical innovations and will enable you to get a deep understanding of how a leading multinational operates and interacts with numerous internal and external parties.Your Responsibilities• You buy engine & transmission components for current and future models/vehicles•  You negotiate with our suppliers to achieve the best cost reduction•  You handle all commercial issues related to responsible suppliers•  You make appropriate sourcing and supplier selection recommendation and you check the market for new suppliersYour Profile• University degree (business or engineering)• A minimum of 2 years of experience as a buyer in a manufacturing / engineering department• Team player with good communication skills, flexible mind and challenge spirit• Good practical problem solving skills• Good negotiation and communication skills• Fluency in English is a must, additional European language skills are an asset You have a Toyota DNA, this means you:• wish to develop and you are ready to persevere in order to reach challenging targets • seek facts before making recommendations or decisions• have strong planning and organization skills• enjoy working in a team, respecting others• have a creative mind and passion for cars• have excellent communication skills \n\n\n", "title": "Engine & Transmission Component Buyer", "company_url": "http://www.bestjobs.ro/firme/toyota-careers-europe/2607119/1", "career_level": "Middle", "company": "Toyota Careers Europe", "locations": "\nBruxelles, Regiunea Capitalei Bruxelles, Belgia\n", "url": "http://www.bestjobs.ro/locuri-de-munca-engine-transmission-component-buyer/748502/1"}