{"body": "\n\n\n\nEricsson Overview Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals. Job Summary •\tResponsible for analyzing, designing and developing viable end-to-end technical solutions for the Managed Services business with a primary focus on GSC Romania Operational business.•\tResponsible for profitable business for Ericsson, by translating customer needs and business requirements into detailed technical solutions and proposals supporting the integration and deployment of such solutions in production. Responsibilities & Tasks •\tScope, define & design solution offerings; driving end-to-end technical solutions : connectivity , feasibility studies, applications ticketing, performance systems , etc ...•\tAnalyze customer technology, define business requirements & participate in risk analysis•\tWork with different teams on planning activities as well as delivery activities•\tDevelop technical presentations, proposals and perform customer presentations•\tSupport deployment of technical solution•\tParticipate in knowledge transfer, documentation and information sharing•\tStay abreast of on new technology/technical areas & share information about solution to enable customer competence build Qualifications & Experience Requirements: •\tUniversity degree and/or Masters with a major in Telecom, IT or equivalent (Computer Science or Electrical Engineering)•\t5 years’ experience in working with Network Operations and / or System Integration•\tGood knowledge of process management frameworks (ITIL, eTOM) with ITIL v3 Foundations certification - IT Service Manager would be a plus.•\tGood understanding of telecom and IT standards (ITU-T, ISO standards, NGOSS/ Frameworx)•\tGood understanding of the application development lifecycle•\tFamiliar with project management methodologies (prior training in PROPS-C is required)•\tFocused on continuous improvement and increase effectiveness with knowledge and prior experience in deploying TQM systems, Six Sigma and/or Lean Six•\tDeep understanding of the MS delivery business requirements and Ericsson Service Delivery Portfolio for Managed Services and Hosting•\tGood understanding of OSS/ Network Management and Business Support System solution components and technologies;•\tAdvanced technical knowledge of Telecom environment: mobile networks in general (2G, 3G, 4G) as well as different technological areas like RAN, Core networks, TX, VAS•\tDeep understanding of service providers / operators business requirements.•\tDemonstrates research and investigation skills, systematically analyzes and identifies causes and effect, anticipates obstacles and strives ahead, develops conclusions based on facts;•\tUnderstands and uses presentation techniques to structure and present an argument so that the desired result is attained.•\tGood written and spoken English; \n\n\n", "title": "System Architect", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-system-architect/747198/1"}