{"body": "\n\n\n\nWebhelp Groupe recrute pour une nouvelle filiale en Roumanie, à Iasi !\n\r\nRejoindre Webhelp c’est :\n\r\nTravailler pour le n°2 des Outsourceurs en France et N°3 en Europe. Le Groupe Webhelp est un opérateur international en Gestion de la Relation Clients qui a connu la plus forte croissance de son secteur entre 2002 et 2012.\r\nLe groupe réalise près de 725 millions d'euros de chiffre d'affaires auprès de plus de 165 clients globaux. Au quotidien, 30 000 collaborateurs sont au contact des consommateurs dans 81 sites de production répartis dans 21 pays : France, Belgique, Roumanie, Portugal, Italie, Suisse, Autriche, Allemagne, Pologne, République Tchèque, Pays Bas, Maroc, Algérie, Royaume-Uni, Afrique du Sud, Madagascar, Turquie, Inde et Suriname.\n\r\nUne entreprise certifiée « GREAT PLACE TO WORK » et « EUROPEAN BUSINESS AWARD », labélisée LRS qui place l’humain au cœur de la relation client.\r\nWebhelp est un groupe dynamique, qui évolue constamment dans le respect de ses valeurs que sont l’unité, l’exemplarité, la reconnaissance, l’engagement et le Wahou.\n\r\nWebhelp Romania c’est :\n\r\nLe 1er employeur francophone en Roumanie, avec plus de 2000 collaborateurs sur ses six sites répartis sur 4 villes : Bucarest, Ploiesti, Iasi et Galati. En 2016, Webhelp ouvre ses portes à Iasi et de nouvelles opportunités de carrière seront ouvertes.\n\r\nSi tu : \n\r\n• As un très bon niveau de français à l’oral comme à l’écrit • Aimes mettre à profit ton savoir-faire pour aider les clients dans l’utilisation des services Viens rejoindre notre groupe d’experts dans la gestion de la relation clients !\n\r\nResponsabilités :\n\r\n• Répondre aux demandes des clients en analysant leurs problématiques. \r\n• Mettre en place une solution rapide et durable à la problématique rencontrée tout en maintenant un excellent niveau de satisfaction client.\r\n• Informer les clients sur les services et produits de l’entreprise et les accompagner dans l’utilisation de leurs services via les canaux : mail, chat et appel.\n\r\nMoyens et rémunération :\n\r\nPour vous aider dans votre parcours professionnel, Webhelp Romania vous propose des formations avancées rémunérées qui vous préparent à l’atteinte des missions qui vous seront confiées.\r\nAvec des locaux très accessibles, situés en centre-ville, nous vous proposons des horaires de travail flexibles et adaptés à vos besoins.\r\nNous avons mis en place des parcours professionnels, des assessments center internes vous permettant d’enrichir votre carrière professionnelle au sein de notre entreprise. \r\n90% des promotions sont issues de l’interne.\r\nRémunération locale attractive : salaire, prime de performance mensuelle et individuelle, bénéfices.\n \n\n\n", "title": "Customer adviser in telecom with French", "company_url": "http://www.bestjobs.ro/firme/webhelp/2942498/2", "career_level": "Entry, Middle", "company": "WEBHELP", "locations": "\nIași, Județul Iași, România\n", "languages": " Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-adviser-in-telecom-with-french/230279/2"}