{"body": "\n\n\n\nCome work with the top 1% of global talent to manage the delivery of WOW Support to our customers for 25+ software products.  We offer a fast-paced environment where inventiveness and entrepreneurial drive are rewarded. We’re also one of the few IT companies offering high-paying, 100% remote, work-from-home positions. You never have to fight traffic to office again. What do we need from you?We’re looking for Customer Support Managers (CSMs) and Technical Customer Support Managers (TCSMs) to manage our Support teams.  We want bright, motivated people who are passionate about delivering outstanding customer service to manage our teams.  Each team has a CSM and a TCSM.  These managers work together to manage the overall team and the support experience we deliver to our customers. CSMs manage the Level 1 support agents who focus more on customer experience, communication and resolving lesser technical issues. TCSMs manage the Level 2 agents who focus on solving the escalated (and more technically challenging) support issues and working with our development team on software bug/ defect resolution.Compensation$2260/month What we need to see in your background:We are looking for CSM and TCSM candidates who have skills and experience in the following areas:Customer Support Skills and Experience: Customer conflict resolution; Ticket handling; Software Troubleshooting; Virtual environments, and; Issue tracking. Management Skills and Experience:Change management skills; Project management skills; Leadership skills, and; Experience leading a team of at least 5 staff. Technical Skills and Experience:CSMs and TCSMs should have a working knowledge of current Windows environments. CSMs and TCSMs should be familiar with common web browsers and basic internet protocols (e.g., HTTP, FTP, RDP). TCSMs should have a strong understanding of technical troubleshooting and issue identification/ resolution. TCSMs should be well-versed in at least one of the following: database development/ administration (SQL Server, Oracle, and/or MySQL); .NET programming; Java programming; another major programming language, and/ or network administration. TCSMs should have a strong understanding of basic networking concepts. Other Skills and Considerations:Communication Skills - All candidates for support positions must have excellent written and verbal communications skills in English, at least. Dynamic Work Environment – Our support organization is a dynamic organization where we change processes, systems and priorities often, so candidates need to be agile and flexible in order to succeed in our continuous improvement model. Working Hours: This job is only offered on a Full Time basis (40 hrs/wk).  CSMs/TCSMs work between 8 am and 6 pm Eastern Time, including breaks, Monday through Friday with occasional flexibility for earlier schedules depending on customers in Europe.  Please note that we do observe US Daylight Savings Time, so Eastern Time is UTC-4 in the summer and UTC-5 in the winter.To qualify, please provide a resume/CV demonstrating the required experience and skills.  From there, to help us find the top 1% of talent, we ask that you first complete some screening tests.  Once you receive testing, you have 7 days to complete all assessments and submit your responses. After you pass our screening tests, there will be a paid trial week where we provide training and ask you to show us your skills. At the end of your trial week, we will either extend an ongoing contract, place you in another position, or release you from the trial. Versata Support is proud to be an equal opportunity employer that provides an exceptional work environment.  All candidates will be required to undergo and pass a rigorous background check to ensure a safe and productive workplace.Are you up for the challenge? \n\n\n\n\n", "title": "Customer Support Manager - $2250/month", "company_url": "http://www.bestjobs.ro/firme/crossover/13728342/5", "career_level": "Entry, Middle", "company": "Crossover", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-support-manager-2250-month/198923/5"}