{"body": "\n\n\n\nEricsson Overview Ericsson is world’s leading provider of communications technology and services. Our offerings include services, consulting, software and infrastructure within Information and Communications Technology. Using innovation to empower people, business and society, Ericsson is working towards the Networked Society: a world connected in real time that will open up opportunities to create freedom, transform society and drive solutions to some of our planet’s greatest challenges.Ericsson is strongly committed to leveraging on its existing portfolio and competence to address customer needs beyond the traditional Telco customer with a focus on Energy, Utilities, Transport, Automotive, Shipping and Public Safety & Security.We are now looking for further industry experts and leaders to support us in growing our sales in industry verticals.In this role you will be reporting to Head of Global Safety & Security  Global practice and be part of a global team with highly skilled industry experts within the domain of Safety & Security.This position can be based in Bucharest/Romania OR Sofia/Bulgaria.Job Summary Drive or participate in customer engagements from lead generation to contract fulfillment, secure that consulting projects are fulfilled with quality, in time & within budget. Work closely with the customer to be able to propose improvements & identify new business opportunities. Responsibilities & Tasks •\tPerform business development in Public Safety and National Security•\tContinuously identify innovate profitable business opportunities•\tAnalyze customer & user offerings, market scenarios, customer go to market strategy.•\tDrive sales engagements•\tPerform up-selling & identify add-on sales opportunities•\tDeliver consulting projects, managing risks & time within consultant assignments•\tShare project learning & contribute to Thought Leadership•\tDevelop consulting practice capabilities Position Qualifications Core Competences: •\tBusiness Development Skills•\tConsultative Skills•\tNegotiation & selling skills•\tProject Management Skills Behavioral Competences: •\tEntrepreneurial & Commercial thinking•\tPersuading & Influencing•\tAnalyzing•\tRelating & Networking•\tDelivering Results & Meeting Customer Expectations•\tAdapting & Responding to Change Preferred Skills: •\tInterpersonal skills•\tConsultative Selling Skills•\tFinancial Understanding•\tCompetitor Understanding Minimum Qualifications & Experience Requirements: •\tInternational business development, consulting or presales experience in the area of Defense and Security•\tRelevant experience in the Defence and Security Industry in South East Europe countries or the Mediterranea Region•\tGood understanding of the Public Safety and National Security market in Europe•\tExperience in the design and delivery of complex systems and roll out projects•\tProven experience in projects in one or more of the following Security areas: Disaster and Emergency Management, Border / city protection, Mission Critical Communications, such as Tetra, as lead solution architect or Project manager•\tExcellent command of English is mandatory•\tFluent French would be very good to have Location: Bucharest or SofiaIf you are interested in this position, please send your CV + Cover Letter in English to nada.boulos.ext@ericsson.com or apply directly on our website. \n\n\n", "title": "Public Safety and National Security Consultant", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nSofia, Sofia-city, Bulgaria;Bucharest, Bucharest, Romania\n", "url": "http://www.bestjobs.ro/locuri-de-munca-public-safety-and-national-security-consultant/747876/1"}