{"body": "\n\n\n\n“Made by Bosch” stands for exceptional quality of a global player. We invest in the future by steering a consistently profitable course. With your commitment, you can also help protect the long-term success of the Bosch organization.\r\nAs market leader, the Automotive Electronics Division offers innovative electronic systems, photo voltaic inverters, control units, sensors and semiconductors. Be part of our new and innovative Bosch team in Cluj.\n\r\nYour responsibilities:\n\r\n•\tDaily operation and maintenance for medium and low voltage systems and equipment (e.g. power cells, transformers, medium and low voltage distribution systems, general power and lighting, data wiring,  access  control wiring, fire protection etc.)\r\n•\tPlanning and completion monitoring of  tasks related to preventive maintenance of electrical systems\r\n•\t Handle electrical systems malfunctions, parameters monitoring, cause analysis  and correction measures \r\n•\tElectrical spare parts management\r\n•\tPower supply and data connections planning and execution coordination for production machines\r\n•\tEnergy monitoring and efficiency improvement measures\r\n•\tElectrical  emergency issues  and troubleshooting coordination\r\n•\tMaintenance as well development project,  electrical external work coordination\n\r\nYour profile:\n\r\n•\tElectrical background, University bachelor degree\r\n•\t3-5 years experience in electrical systems maintenance or execution\r\n•\tExperience in medium voltage power distribution systems, operation preferable\r\n•\t3B ANRE authorization\r\n•\tFamiliar with power quality parameters and energy consumption assessment\r\n•\t Job initiative, result oriented and task responsible\r\n•\tAbility for active listening and team cooperation\r\n•\tAbility to organize and perform different tasks at the same time\r\n•\tAbility to treat customer demands quickly\r\n•\tStructured, analytic mind and organized\r\n•\tFlexible and open-minded\r\n•\tGood at both speaking and writing English\r\n•\tGood skills in MS Office\n\r\nMake it happen! \r\nApply now!\r\nwww.bosch-career.ro\r\ncluj.recrutare@ro.bosch.com \n\n\n", "title": "Electrical Engineer (Ref. FCM1/EE)", "company_url": "http://www.bestjobs.ro/firme/robert-bosch-srl/1873117/1", "career_level": "Middle, Senior", "company": "Robert Bosch SRL", "locations": "\nJucu, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-electrical-engineer-ref-fcm1-ee/752465/1"}