{"body": "\n\n\n\nJob requirements:\n\n\r\n- University degree, preferably in Economics;\r\n- At least one year experience in coordinating people in banking products or other sales area, in a similar position;\r\n- Relevant negotiation and selling skills required;\r\n- Significant communication and interpersonal relating skills are requested as well as a general professional approach, customer care and target orientation attitude; Reliable, self-confident and highly responsible person, proactive and dynamic, able to meet tight deadlines and sort conflicting priorities whenever necessary;\r\n- Good command of English, both spoken and written.\n\r\nJob description:\n\r\nThe nominee will interact directly with retail customers in order to promote and sale Alpha Bank’s products; she/ he will have to develop, monitor and train the direct team of sales agents in order to achieve the specific and allocated goals. He / she will have to prospect business development opportunities, find the proper leads, offer tailor-made solutions to the clients and establish highly professional relationships with them.\n\n\n\r\nALPHA BANK ROMANIA is part of the largest Greek financial group, Alpha Bank Group, with more than 140 years experience in banking sector. The first foreign bank to come to Romania after 1990, ALPHA BANK ROMANIA provides the whole range of products and services to the consumer market segment as well as complex banking solutions to the business and corporate customers.\n\r\nThe applicants will have the great opportunity to join an important organization whose values are: innovation, honesty, flexibility, intelligence and reliability.\n\r\nAll applications will be treated in strictest confidence. Only short-listed candidates will be contacted for an interview.\n\r\n- Thank you for your application – \n\n\n", "title": "TEAM LEADER - DIRECT SALES TEAM - RETAIL AREA", "company_url": "http://www.bestjobs.ro/firme/alpha-bank-romania/678/1", "career_level": "Middle, Senior", "company": "ALPHA BANK ROMANIA", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-team-leader-direct-sales-team-retail-area/752138/1"}