{"body": "\n\n\n\nWe are searching for a colleague for the following position: Quality Assurance Automation Engineer (Java) within IT Operations DevelopmentWe are consistently leading the hosting market in revenue and new product development. In this role, you will have the opportunity to work on the latest research and technology for our next generation high performance systems. You will gain in-depth knowledge and experience working alongside some of the best and brightest engineers in the industry.If this sounds exciting, we encourage you to apply now!You wil:    - accompany projects from conception until rollout and beyond until closure    - plan, design, develop, implement, execute and report different types of automated tests for our technologies and platforms   - be responsible for planning and conduction of all quality assurance measures for projects of the Technology & Architecture department with a focus on test automation    - contribute to quality risk assessment and the corresponding rollout recommendations for products    - review requirement specifications and technical documentation for accuracy    - provide feedback from your daily work for the deduction of measures to continuously optimize the quality of our productsAnd, most of all, you will be a part of our young and dynamic team.We appreciate:- experience with Java/Selenium or other test automation tools;- BS degree in Computer Science, Engineering or equivalent- very good communication skills and a great team player- fluency in English (both written and spoken)Please submit your resume online or at career-ro@1and1.comThank you for your application! \n\n\n", "title": "QA Automation Engineer", "company_url": "http://www.bestjobs.ro/firme/1-1-internet-development-srl/35100/1", "career_level": "Middle", "company": "1&1 Internet Development SRL", "locations": "\nCalea Floreasca 246 C, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-qa-automation-engineer/748083/1"}