{"body": "\n\n\n\nThe EP Solution Lead Manager is part of JTI’s Global IT team and will be working in cross-functional international teams, together with the customer and internal or external service providers, for delivering solutions that meet business objectives.\n\r\nMAIN RESPONSIBILITIES\r\nThe position holder will: \r\n- provide expertise in Emerging Products e-commerce PHP based SaaS applications/processes\r\n- manage technical integration with other JTI IT systems on premises and cloud based systems\r\n- manage and coordinate development operations and effective performance of the business solutions (technical support/maintenance)\r\n- be technical expert in the specific approved projects\r\n- work closely with other internal IT teams and external vendors in order to ensure incidents resolutions and applications enhancements\n\r\nREQUIREMENTS\r\n• University degree in Information Technologies (e.g. Computer Science, Software Engineering and Automation, Cybernetics or Applied Mathematics)\r\n• Minimum 3 years experience in PHP web based solutions development/configuration\r\n• Good level of PHP/MySQL programming skills\r\n• Experience in working and/or coordinating (virtual/outsourced) software development teams and/or services\r\n• Very good written and spoken English\n\r\n• Magento configuration/development, Atlassian stack (Jira, Confluence, GitHub, BitBucket) usage experience are a plus\r\n• Knowledge/experience on software development lifecycle methodologies, defining and rolling out software development standards/processes are a plus\r\n• Knowledge/experience with project management and quality assurance methodologies are a plus\n \n\n\n", "title": "Emerging Products (EP) Solution Lead Manager", "company_url": "http://www.bestjobs.ro/firme/jt-international-romania-s-r-l/36288/1", "career_level": "Middle, Senior", "company": "JT International (Romania) S.R.L.", "locations": "\nBlvd.Dimitrie Pompei 9-9A sect.2, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-emerging-products-ep-solution-lead-manager/750689/1"}