{"body": "\n\n\n\nERICSSON OVERVIEW\n\r\nEricsson is the world’s leading provider of technology and services to telecom operators. Ericsson is advancing its vision of being the “prime driver in an all-communicating world” through innovation, technology, and sustainable business solutions. We now stand on the brink of fundamental innovation opportunities across industries, public services and in private life.\n\r\nJOB PURPOSE\n\r\nTo support processes development and deployment in GSC Romania under MSTOP Global Development program for selected customers and executing FOAs.\n\r\nPRINCIPAL ACCOUNTABILITIES\n\r\n- Responsible for New MSTOP process development, according to the specific process definitions and based on the current ways of working. \r\n- Responsible for New MSTOP FOAs (First Office Application) \r\n- Responsible for New MSTOP level 4.5 creations, according to the specific process definitions and based on the current ways of working, providing the correct customization definition.\r\n- Responsible to engage all stakeholders on GSC, MSIP and regional organization to obtain the current ways of working and to document the customization n the wiki format.\r\n- Responsible to secure that all involved parties understands the necessary customizations and to obtain acceptance on the documents.\r\n- Support specific training execution together with the processes SME.\r\n- Continuously seek deployment activities improvement based on feedbacks and lessons learned.\n\r\nWORKING RELATIONSHIPS\n\r\nMS DM SME – Processes deployment support.\r\nService Delivery Units organization – Project management of deployment related activities.\r\nProcess Deployment PM – Coordination of Process deployment activities and schedule.\r\nWiki Site Manager – Upload of Level 4.5 documentation.\r\nGDF India\n\r\nRECOMMENDED MINIMUM REQUIREMENTS:\n\r\n- University degree in Electrical/Electronic Engineering, Telecommunications, Computer Science or equivalent experience in a related discipline.\r\n- Previous experience in developing or applying processes in an operator’s environment. Experience on operator’s technical organization (engineering, deployment, operations) and on managed services delivery activities.\r\n- Minimum 3 years in a similar position\r\n- ITIL Expert certification - is a plus\r\n- UML\r\n- Visio\r\n- Advanced English skills \n\n\n", "title": "Processes Specialist", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-processes-specialist/750523/1"}