{"body": "\n\n\n\nDe ce sa ni te alaturi?\r\nPentru ca tu, ca si Director Adjunct Magazin (Sales Leader), poți fi cel mai bun, în fiecare zi. In JYSK noi credem ca valorile personale stau la baza serviciilor si vanzarilor facute bine. Prin urmare, tie iti place să vinzi și întotdeauna depui eforturi pentru a îmbunătăți relatia cu clienții și serviciile oferite fiind un Bun comerciant, un Bun comunicator și un Bun coleg.Ca și Director Adjunct de Magazin vei cauta mereu solutii sa imbunatatesti vanzarile, standardul magazinului si satisfactia clientului. \r\nCe vei face in fiecare zi?•\tResponsabilitatea ta principala sunt vanzarile si trebuie sa te asiguri ca magazinul si personalul este pregatit pentru clienti. •\tOptimizezi vanzarile in magazin.•\tPlanifici personalul si participi la dezvoltarea acestuia.•\tEsti un model al valorilor noastre: ai spirit de comerciant, spirit de colegialitate si spirit corporatist.•\tParticipi la recrutarea, inductia, pregatirea si dezvoltarea echipei tale. \n\r\nCum poti face diferenta in fiecare zi?•\tEsti dispus sa participi la treaba din magazin pentru a duce lucrurile la bun sfarsit.•\tEști pasionat de optimizarea vanzarilor prin intermediul unui serviciu excelent oferit clientilor.•\tIti motivezi echipa si esti capabil sa obtii ce e mai bun de la ea.•\tTe motiveaza o zi plina cu activitati diferite si iti doresti sa fii responsabil de intreg magazinul atunci cand Directorul de Magazin lipseste.•\tTu esti un angajat important. Pentru tine, o zi buna inseamna sa depasesti asteptarile clientilor si targetele de vanzari, impreuna cu echipa ta. •\tAi lucrat in retail, preferabil cu experienta in management. \r\nEsti interesat? \r\nTi-ar placea sa faci parte dintr-o companie care se ocupa constant de pregatirea si dezvoltarea angajatilor sai, indiferent de pozitia pe care o au acestia, care iti ofera multe responsabilitati, dar si bonusuri atractive daca dai dovada de o performanta superioara?Suntem o companie care e onorata sa isi dezvolte managerii.\r\nTe rugam sa trimiti CV-ul tau.Numai candidatii selectati vor fi contactati. \n\n\n", "title": "Director Adjunct Magazin in Oradea OGORULUI", "company_url": "http://www.bestjobs.ro/firme/jysk-romania-srl/10588081/5", "career_level": "Middle, Senior", "company": "JYSK Romania SRL", "locations": "\nOgorului 171, Oradea, Județul Bihor, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-director-adjunct-magazin-in-oradea-ogorului/202403/5"}