{"body": "\n\n\n\nSAKARE cauta Consilieri de vanzari care sa se alature echipei de succes SAKARE din Londra, UK.NU PERCEPEM COMISION!Te asteptam sa faci parte din familia SAKARE daca:Ai experienta in promotii, vanzari, servicii de infrumusetare sau esti la inceput de drum si iti doresti o cariera in strainatate.Iti doresti sa castigi cat mai multi bani!Esti perseverent, cu o personalitate dinamica si bune abilitati de comunicare.Cunosti limba engleza la nivel conversational.Daca in urma interviurilor vei fi acceptat in compania noastra iti vom da numerele de telefon si adresele de mail a mai multor tineri romani care deja si-au facut o cariera de succes lucrand pentru SAKARE in Londra.Numai candidatii selectati vor fi contactati.Locatia de desfasurare a activitatii este in magazinele noastre din zona centrala a Londrei.Transportul pana in Londra este asigurat de compania SAKARE.Venitul minim garantat pentru primele 6 luni este de 800 lire sterline sau comision din vanzari intre 15-30%, una dintre cele 2 in functie de cea care este mai mare.Dupa cele 6 luni veti fi platit din comisionul reprezentand intre 15% -30% in functie de vanzarile dvs. din fiecare zi.Plata pentru serviciile prestate de dvs se face la doua saptamani in contul dvs bancar deschis in UK .Cazare: Apartamentele sunt confortabile si includ TV, cablu, calculatoare si acces la internet in cele mai multe apartamente, precum si toate echipamentele electrice necesare. 2 persoane in camera. Ratele de inchiriere sunt de 12 £ pe zi iar utilitatile sunt incluse si deduse direct din salariu.Programul de lucru: 10-12 ore pe zi. Veti beneficia de o zi libera pe saptamanaBeneficiati de o perioada de training.Produsele comercializate de companie fac parte din gama produselor pentru corp, fata , unghii si se adreseaza intregii familii.  Interviu Online:1.  De ce va doriti sa lucrati in Londra?2.  Cand sunteti disponibil/ a pentru plecare in cazul in care sunteti acceptat/a sa lucrati in compania noastra? \n\n\n", "title": "Consilieri vanzari Londra UK", "company_url": "http://www.bestjobs.ro/firme/soap-co/13899070/5", "career_level": "Entry, Middle", "company": "SOAP&CO", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-consilieri-vanzari-londra-uk/209289/5"}