{"body": "\n\n\n\nThe Application Owner supports the IT Application Lifecycle by ensuring that ongoing enhancements and maintenance is completed in accordance with the requirements of the ‘paying customer’ and other stakeholders.Areas of Specialty The Application Owner is accountable for the Application Lifecycle Management of one or more applications/services of an IT unit and the related Run The Bank (RTB) / TCA costs. Ensures that the application(s) are enhanced and maintained in accordance to the requirements of the ‘paying customer’ and other stakeholders as included in the application strategy and SLA’s. With this, clarifies the scope and timing of all activities and deliverables and the value they will generate. The Application Owner identifies and manages the risks and issues associated with the application(s) and escalates appropriately.In Change The Bank (CTB) projects, The Application Owner is empowered to ensure that the changes to the application(s) are fully aligned / support the application strategy. The main focus is to guarantee the system stability and to ensure a smooth / successful transition to production/ steady-state environment. Cost accountability contains the management and tracking of costs in line with investment governance and maintains the agreed outcomes and service-levels within budget.Responsibilities / Tasks• Accountable for the ongoing enhancement and maintenance of a application including management of scope.• Conducts strategic planning for the application.• Identifies and manages technical projects necessary to ensure required and established service levels are maintained.• Manages strategic capacity, consumption and performance management (Forecast and management based on business plans).• Ensures policy-compliance for dbRAMM, SOX, ASG, ISP, Audit, etc. (incl. the technical ITPM tasks).• Manages software licenses, security certificates and contracts with service providers.• Ensures availability of all necessary application/service knowledge and documentation.• Ensures system stability through enhancement/maintenance periods.• Accountable for the 'Run the Bank' ('RTB') /TCA costs.• Ensures in ;Change the Bank' ('CTB') projects that the changes to the application(s) are fully aligned/support the application strategy across the full SDLC with support on:participating in cost estimates; functional design; solution architecture together with the Solution Architect; technical design.• Ensures a smooth/successful transition to the production (steady-state) environment.• May be responsible for the delivery of small enhancements.• Provides L3 application support as required.BEHAVIOURSThere are a number of common behavioural expectations that all experts should demonstrate over and above their technical/specialist contribution. These behaviours are also important for reinforcing our Deutsche Bank Values and Beliefs: 1. Acts as role model for individuals aspiring to follow an expert career path by passionately promoting the merits of expert roles and the contribution of their Profession. 2. Challenges the ‘status quo’ and influences key stakeholders to ensure industry best-practice is adhered to within their area of expertise. 3. Mentors individuals across the Bank who wish to follow an expert career path through sharing their experience, expertise and insight. 4. Acts as training ‘faculty’ on key internal technical/specialist development programmes (NB Annual number of hours/days to be agreed at start of year with Manager in consultation with the Profession Owner). 5. Designs innovative, sustainable solutions which are congruent with the strategic direction of the Bank. Challenges colleagues to do the same, pushing the boundaries of what is possible to deliver potential for higher levels of organisational performance. 6. Builds, captures and manages the transfers of knowledge across the Professional community. 7. Provides Profession Owners with input that shapes the curriculum.8. Defines and implements best practices, solutions and standards related to their area of expertise.9. Demonstrates thought leadership through seeking out opportunities to shape the agenda with Regulators, Government Departments and Professional bodies. 10. Cultivates and maintains effective working relationships with stakeholders and clients by articulating the contribution, commercial impact and benefits of expert roles.Experience / Exposure• Excellent communication and influencing skills.• Open minded.• Ability to work in fast paced environment.• Passion about sharing knowledge and best practice.• Ability to work in virtual teams and in matrixed organisations.• Proven project management skills.• Fluent English (written/verbal). \n\n\n", "title": "Application Owner", "company_url": "http://www.bestjobs.ro/firme/db-global-technology-s-r-l/13695597/5", "career_level": "Middle, Senior", "company": "DB Global Technology S.R.L", "locations": "\nBulevardul Dimitrie Pompeiu nr. 6A, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-application-owner/198334/5"}