{"body": "\n\n\n\nWe are looking for a QA Analyst who wish to be a part of developing of our international team. Corporater AS is a Norwegian software company which is the world’s leading provider of Enterprise Performance Management solutions. The company is growing rapidly, therefore we are looking for more well-qualified staff. We have 100 employees - 25 at the company’s head office in Stavanger, Norway. Over the last fifteen years we have delivered solutions to more than 300 customers in the public and private sectors. Corporater has subsidiaries in Romania, Brazil, Sweden, UAE, USA and India. \n\r\nOur team in Bucharest is looking forward to welcome \n\r\nQA Analyst\n\r\nResponsibilities:\n\r\n- Analyze requirements and design test plans and scenarios for Corporater solutions (Enterprise Performance Management Suite, the mobile application, Surveyor). This way you will be able to identify key aspects of the quality of our solutions like stability, performance, reliability, impact of change/regression etc\r\n- Resolve issues by working closely with application software development, product management and other departments within the organization\r\n- Find, manage and track quality issues in English, using JIRA as the defect tracking tool\n\r\nMain requirements:\n\r\n- Testing and technical skills - experience with defect tracking tools (ideally JIRA) and the ability to report, manage and retest bugs independently. Previous experience of testing business management solutions is desired.\r\n- Good English communication skills (in writing and verbally) - be able to discuss and understand the issues or new functionalities with Developers/Product manager/Business analysts/Consultants.\r\n- Capability of integration in an international/multi-cultural environment \n\r\nWe offer:\n\r\n- A good work environment as a part of a multi-national and multi-cultural environment\r\n- Competitive (motivating) terms corresponding your experience\r\n- Strong and active technical environment with good potential for growth and be exposed to new technologies \n\n\n", "title": "QA Analyst", "company_url": "http://www.bestjobs.ro/firme/corporate-performance-management-software-srl/13566052/1", "career_level": "Middle", "company": "Corporate Performance Management Software SRL", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-qa-analyst/751021/1"}