{"body": "\n\n\n\nSociété Générale European Business Services délivre de la valeur ajoutée pour leGroupe Société Générale au niveau des services de finance, comptabilité,ressources humaines et IT pour toutes les entités de l'Europe.\r\nSAFE est encharge du management du risque opérationnel dans le cadre du groupe Société Générale, étant aussi en charge du cadre de la surveillance permanente.\r\nSAFE c’est une Direction responsable du domaine anti-fraude et de tous les sujets relatifs à la sécurité informatique. Parmi ses missions on peut mentionner celle qui concerne la configuration et le management des accès aux outils informatiques utilisés dans le cadre de GBIS – la banque d’investissement du groupe SociétéGénérale.\r\n Votre rôle :\r\nLe périmètre fonctionnel couvre le management des risques de la Sécurité Informatique.\r\nVotre mission principale va consister en :\r\n1)     Participation à la campagne de re-certification des accès informatiques et techniques des utilisateurs en :\r\n-         Préparant la campagne et les vérifications préliminaires ;-         Gérant la campagne de suivi en maintenant la communication journalière avec les utilisateurs ;-         Investiguant les soucis remontés par les utilisateurs ;-         Suivant la mise en place des décisions en production (en s’assurant que les accès sans pertinence sont supprimés de l’environnement de production) ;-         Participant à la clôture de la campagne.\r\n 2)     Participation à l’activité de reporting en :\r\n-         Générant et en préparant des rapports dédiés sur les deux activités principales décrites ci-dessus (reporting hebdomadaire et mensuel) ;-         Préparant des rapports en collaboration avec l’équipe de Paris SAFE/ITS/IAM.\r\n Profile requis :\r\n Profile technique :\r\n-Etudes supérieures : Université, ASE, Polytechnique ;-Profile technique et aisance dans la manipulation des données techniques ;-Français au niveau avancé (parlé et écrit) ;-Connaissances des notions de la sécurité informatique.-Connaissances des sujets IAM (Identity and Access Management) ;- Bonne maîtrise de Microsoft Office (Outlook/Excel/Access) ;-Notions de sensibilité et de vulnérabilité IT (Linux, Windows, DB) ;-Bonnes compétences de reporting avec Excel ;-Notions de VBA pour Excel (macros et reporting).\r\n  Profile personnel :\r\n  -Attitude proactive et réactive ;-Esprit d’équipe ;- Rigueur et capacité de maintenir la confidentialité des données manipulées ;- Bonne capacité relationnelle et de communication ;-Personne autonome ;- Bonne capacité d’analyse et de synthèse.\r\n  Notre offre :\r\n -Conditions salariales motivantes ;-Contrat à durée indéterminée ;- Plan de carrière (professionnel et financier) ;-Formations spécifiques ;-Assurance médicale ;-Tickets restaurant ;-Environnement de travail professionnel et agréable ;-L’opportunité de rejoindre une équipe multiculturelle. \n\n\n", "title": "Certification Campaign Officer avec Français", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-certification-campaign-officer-avec-fran-ais/752042/1"}