{"body": "\n\n\n\nEricsson Overview\n\n\r\nEricsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.\n\n\n\r\nWe are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.\n\r\nJob Summary\n\n\n\r\nThrough efficient management of people under his/her organization, the Team Leader shall strengthen Ericsson GSSO's competitive position by maximizing service portfolio, proactively managing business risks & contributing to the creation of value for the Customer\n\n\n\r\nThe Team Leader is accountable for evaluating, qualifying & selecting team members and ensuring they are capable and motivated to deliver the services of the GSSO.\n\n\n\r\nThe Team Leader is responsible for all individual performance management aspects, staffing, development needs, customer satisfaction and quality and accuracy of deliverables.\n\r\nThe Team Leader reports to the Head of Analytics & eSourcing and supports GSSO regular operations, non-standard projects and development initiatives.\n\r\nThe Team Leader role could be a professional experience in the career path towards a people management role.\n\r\n1.1                      People-related Responsibilities\r\n•Supports integration of new team members at organizational level (understanding of role and responsibilities, of Ericsson and GSSO culture etc.) and provides assistance for them in the long-run in collaboration with the Coordinator role.\r\n•Maintains a high level of readiness within the team in regards to skills and competencies through active initiation of training plans, knowledge sharing and refresher sessions and feedback to  team members\r\n•Recruits and ensures that staffing needs are estimated, included in forecasts, approved and then selection process is executed seamlessly\r\n•Supports team members in building competence development plans and career goals\r\n•Provides feedback to team members and facilitates communication within the team\r\n•Coaches team members for their current job and for their development plans\r\n•Drives performance through SMART objectives in the team members IPMs\n\r\n1.2                      Process-related Responsibilities\r\n•Oversees work and load balance and supports the Coordinators in these efforts\r\n•Plays and active role in various governance forums, presentations and analysis and presents them to the Sourcing Units\r\n•Supports process maintenance with the Business Partner and Coordinators: work instructions creation and updates, process documentation management etc.\r\n•Drives best practices across the Ericsson Sourcing Community through day-to-day work and  also by contributing to newsletters and events\r\n•Drives and executes the GSSO strategy and liaises with other GSSO team to ensure this strategy gets implemented timely\r\n•Takes ownership as 2nd level of escalation and insures issues are addressed for mutually beneficial outcome\r\n•Represents GSSO and respective Team in various forums\r\n•Contributes to GSSO growth and development by engaging in cross-functional projects\n\r\n1.3                      Performance-related Responsibilities\r\n•Controls and takes accountability for the performance of the team in the areas of: customer satisfaction, response/execution time, perception on service and other indicators included in the GSSO Balance Scorecard\r\n•Initiates corrective and preventive measures from the identified malfunctions in the team members’ performance\r\n•Acts as 3rd tier in Audit and Quality Assurance Processes and takes action to improve these over time\n\n\n\r\n2                          Main Interfaces\n\r\n2.1                      GSSO\r\n•Team members\r\n•Coordinator\r\n•Business Partner\r\n•Heads of Sourcing Units\r\n•GSSO Teams\r\n•GSSO Management\n\r\n2.2                      Ericsson Sourcing\r\n•All Ericsson Sourcing Units members\r\n•Non-Sourcing Units\n\r\n2.3                      Supplier Organizations (mainly for eSourcing)\r\n•Sales & Account Managers\n\r\n3                          Competence profile\n\r\n3.1                      People skills\r\n•Skilled in staffing, recruitment, motivating, team management and leadership\r\n•Strong communication and presentation skills\r\n•Strong customer orientation and ability to work under pressure\r\n•Proficient in facilitating and presenting in public\n\r\n3.2                      Process skills\r\n•Excellent knowledge in Sourcing area and common industry practices\n\r\n3.3                      Performance skills\r\n•Strong analytical, synthetic and documenting skills\r\n•Good understanding of performance management at team and individual level\n\r\n4                          Education & Language\r\n•Bachelor Degree within Finance / Economics / Mathematics / Computer Science / Computer Engineering or alternate\r\n•Fluency in written and spoken English required is essential\r\n•Other language skills are advantageous\n\r\n5                          Interpersonal skills     \r\n•Leadership\r\n•Personal example for communication, ethics and proactive attitude\r\n•Customer service is essential\r\n•Flexible and responsive to changing work patterns and demands\r\n•A thorough and methodical approach to work\r\n•Well-developed interpersonal communication and people orientation\r\n•Willing to share knowledge, experiences and skills to create a learning culture\r\n•Excellent ambassador of GSSO and Ericsson culture and values\r\n•Networking skill\r\n•Persuasion and influencing\r\n•Coaching and facilitation \n\n\n\n\n\n\t\t\t    $(document).ready(function() { \n\t\t\t    var allVideos = $('.job-video-container object, .job-video-container embed, .job-video-container iframe'); \n\t\t\t    var oldWidth = allVideos.width();\n\t\t\t    var oldHeight =  allVideos.height();\n\t\t\t    var aspectRatioOS = oldHeight/oldWidth; \n\t\t\t    allVideos.removeAttr('height').removeAttr('width');\n\t\t\t    function resizeVideoOSJS(){\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%;');\n\t\t\t\tvar widthInit = allVideos.width();\n\t\t\t\tvar heightInit = widthInit * aspectRatioOS;\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%; min-height: 220px; height: '+ heightInit +'px;');\n\t\t\t\t//.attr('width',  widthInit).attr('height', allVideos.height())    \n\t\t\t    }\n\t\t\t    resizeVideoOSJS();\n\t\t\t\t    window.onresize = resizeVideoOSJS; \n\t\t\t    });\n\t\t\t\n", "title": "Market Intelligence Team Leader", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-market-intelligence-team-leader/750524/1"}