{"body": "\n\n\n\nWhat we do?\n\r\nWith the largest number of employees in the Bucharest office, the HR Operations function is looking for new bright contributors to innovate and expand our HR support. The HR Operations team is responsible for delivering HR services into Europe and provide the first point of HR contact for all staff.  We are looking for a junior HR specialist to join the team and become a key part in our journey of creating a high performing culture and great place to work. More than 120 buy-side customers rely on our solutions, including some of the world’s top asset managers, hedge funds and pension funds.\n\r\n What will you do?\n\r\nThe Senior HR Operations Partner will join the HR Operations team in Bucharest and will provide project, day to day and administrative support for the employees based in Romania:\n\r\nDelivering ongoing HR projects and employee engagement activities\r\nProviding support for a series of key processes such as leave of absence, benefits administration, payroll input, perfomance management\r\nEnsuring continuous and timely support and communications to our employees\r\nUpdating and maintenance of employee files and records with management over all HR related documents\r\nManaging new joiners and leavers’ processes, including timely reporting to local authorities, documentations, onboarding, induction presentations, exit interviews\r\nActing as an HR Systems specialist, performing all employee related changes, maintaining an accurate data trail and running required headcount and ad hoc reports\n\r\nWhat we expect from you?\n\r\nBachelor degree in the field of Human Resources/Economics/Psychology\r\n3 year of related experience\r\nVery good knowledge of English language\r\nStrong Costumer focus\r\nAbility to work under pressure at very fast pace\n\r\n What we offer you? (Benefits)\n\r\nGreat package of trainings at the beginning of your job\r\nAttractive salary with social package\r\nFull time job in our office located in Bucharest\r\nInternational career oportunities\n\r\nWho we are?\r\n93 of the world's 100 largest banks uses Misys product. 30 years of experience. Delivered 51 products during last 2 years. Closed over 1000 deals and gained over 60 new customers. 5000 staff in 50 countries work together in atmosphere of collaboration and accountability.\n\r\nJoin our location in Bucharest.\n \n\n\n", "title": "Senior HR Operations Partner", "company_url": "http://www.bestjobs.ro/firme/misys-banking-systems/1754/1", "career_level": "Senior", "company": "Misys Banking Systems", "locations": "\nSema parc Splaiul Independentei 319, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-hr-operations-partner/751150/1"}