{"body": "\n\n\n\nYou will be part of a chosen few who will have the opportunity to work on some of the coolest projects on the market. We offer you the perfect work environment in which you will be valued for your true potential.  If you would like to grow in a stable company, you’ve found the right place.\n\r\nMandatory requirements:\n\r\n•  you must know the basics of front-end web technologies (HTML, CSS, JavaScript)\r\n•  work experience with at least one of the following css frameworks:  bootstrap, foundation, purecss, skeleton\r\n• basic understanding of less/sass preprocessing (grunt, gulp, compass)\r\n• you must know how to build responsive design\r\n• basic knowledge of Photoshop and converting PSD to HTML.\n\r\nIf you miss some of the requirements above, don’t worry. Take your time to study really hard and get back to us. We are always looking.\n\r\nWhat things would take your name out of the crowd:\n\r\n• SVG graphic animations\r\n• C3js\n\r\nDon’t worry, we don’t require all of the above. If you start working with us, this is one of the many career paths you can take.\n\r\nYou should know that …\n\r\nWe are part of the elite. There are a few places around the world where you would meet the technologies that we are using. Our work environment is custom tailored for your needs, and our colleagues are hand picked from the best of the best. Working with us will most probably change your life for the better. Still interested to apply?\n\r\nA sneak preview of some of our benefits:\n\r\n• Interesting and challenging projects\r\n• State of the art technologies\r\n• Private medical insurance\r\n• Monthly Team Building activities\r\n• Yearly Team Building activities\r\n• Possibility to travel abroad\r\n• Working for one of the online industry leaders\r\n• An open, not corporate, environment to share and promote your ideas\r\n• Time to contribute to the open source community, and to learn new things\r\n• Opportunity to attend trainings, conferences, congresses, etc.\r\n• Infinite Fruits, Coffee and Tea\r\n• A whole lot of good times.\n\r\nThis is how we think your career path should look like:\r\nSee you soon! \n\n\n\n\n", "title": "Front-end Developer", "company_url": "http://www.bestjobs.ro/firme/pionix-marketing-solutions-srl/13477364/5", "career_level": "Middle", "company": "Pionix Marketing Solutions SRL", "locations": "\nDelea Veche 24, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-front-end-developer/212470/5"}