{"body": "\n\n\n\nPozitie localizata in Centrala Bancii, cu o directa subordonare la Directorul Directiei IMM, ce NU PRESUPUNE COORDONAREA UNEI ECHIPE, ci atragerea de noi clienti dintr-o intreaga regiune; Postul presupune un nivel de seniorat ridicat si o experienta relevanta in creditarea persoanelor juridice.Responsabilitati:Identifica oportunitatile de pe piata in scopul atragerii de noi clienti in cadrul segmentului vizat (finantari de peste 400.000 EUR pentru persoane juridice cu cifra de afaceri pana la 5 Mil. Eur) si din zona geografica alocata ;Gestioneaza clientii IMM alocati (clienti ce fac parte din top 20 expuneri IMM din zona geografica alocata);Participa la cresterea vanzarilor de produse si servicii si initiaza vanzari incrucisate ale produselor bancii pentru clientii din cadrul segmentului vizat sau pentru clientii aflati in portofoliu;Identifica nevoile clientilor si ofera consiliera financiara, propune solutia optima pentru nevoile identificate in urma analizei financiare si calitative a clientului, in conformitate cu specificul activitatii acestuia si cu respectarea normelor si procedurilor interne in vigoare;Negociaza si structureaza ofertele pentru clienti si preia de la acestia  cererea de credit impreuna cu documentele necesare pentru analiza completa (financiara si non-financiara), intocmeste referatul si propunerea de credit;Pre-agreaza structura tranzactiilor cu Directia Aprobare CrediteInainteaza dosarul spre aprobare catre factorii competenti, asigurand comunicarea permanenta cu departamentele interne din cadrul Bancii in vederea indeplinirii nevoii clientilor; daca e cazul, sustine dosarul spre aprobare in cadrul forurilor  competente din cadrul BanciiPrezinta situatia actualizata a clientului si a finantarilor acordate acestuia in cadrul Comitetului de MonitorizareSupravegheaza procesul de monitorizare si implementare a creditelor acordate/in portofoliuParticipa in proiectele si activitatile departamentului repartizate de superiorul direct.Cerinte:Studii superioare/ Master in domeniul economic si/sau juridic;Experienta anterioara de cel putin 5 ani in domeniul financiar-bancar, in aria vanzarilor IMM si/sau Corporate;Cunostinte bune de analiza financiara;Bun cunoscator al legislatiei bancare;Cunostinte avansate MS Office;Limba engleza –mediu - avansat (vorbit, scris, citit);Competente specifice interpersonale, abilitati de vanzare si negociere avansate;Integritatea, Curajul, Excelenta, Responsabilitatea individuala si Grija fata de ceilalti insumeaza valorile noastre si sunt mandatorii;Capabil sa lucreze sub presiune;Foarte bun coechipier.  Interviu Online:1.  Ati lucrat dosare de credit in Limba engleza?2.  Care sunt cunostintele si expertiza dvs. in privinta analizei financiare?3.  Ca si segment de clienti, cu ce cifra de afaceri ati lucrat pana acum?4.  Care este experienta dvs. totala in domeniul creditarii persoanelor juridice?5.  De ce ati fi interesat de o schimbare in momentul de fata?6.  De ce OTP? \n\n\n", "title": "AREA SALES MANAGER - DIRECTIA IMM", "company_url": "http://www.bestjobs.ro/firme/otp-bank-romania-sa/2209442/1", "career_level": "Middle, Senior", "company": "OTP Bank Romania SA", "locations": "\nBd. Eroilor nr. 3A, Brașov, Județul Brașov, România;Piaţa Sfântu Gheorghe, Timișoara, Județul Timiș, România;Piaţa Unirii, Cluj-Napoca, Județul Cluj, România;Str. Buzesti nr. 66-68, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-area-sales-manager-directia-imm/749022/1"}