{"body": "\n\n\n\nEricsson Overview: Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.Job Summary:The Business Partner is a development and performance driving role designed to support the team services and the team members in their day-to-day work.He or she is responsible for driving projects/programs and team initiatives targeting: process improvement and control, service portfolio expansion, competence development. He or she is accountable to communicate their progress both to the internal and the external community.The Business Partner in GSSO (Romania) reports to the Head of Analytics & eSourcing and supports GSSO regular operations, non-standard projects and development initiatives.Business Partner role could be a professional experience in the career path towards a people management role or other Sourcing and non-Sourcing roles (Category Manager, Strategic Sourcing manager, Project Manager etc.).Key Responsibilities:People-related ResponsibilitiesMaintains a high level of readiness within the team in regards to process and system knowledge through being responsible for organizing training and refresher sessions and feedback to  management (Team Leader or Head) on training needs identified within the teams;Supports team members in clarifying and designing complex projects and events and liaise with customers on non-standard set-ups;Provides feedback to cluster members and facilitates communication within the team.Process-related Responsibilities Monitors quality and adherence to process indicators and controls the processes that are designed to measure these; Controls the team templates and work instructions and instruments and ensures they are up-to-date; Plays a driver role in process maintenance: work instructions creation and updates, process documentation management etc.; Drives best practices across the Ericsson Sourcing Community through day-to-day work and  also by contributing to newsletters and events; Drives and executes the GSSO strategy and liaises with other GSSO team to ensure this strategy gets implemented timely; Represents GSSO and respective Team in various forums; Contributes to GSSO growth and development by engaging in cross-functional projects. Performance-related Responsibilities Controls and reposts the internal performance of the team in the areas of: customer satisfaction, response/execution time, perception on service and other indicators included in the GSSO Balance Scorecard;Ensures that internal data in the team reports is accurate (such as Work-in-Progress trackers, QC files etc.);Initiates corrective and preventive measures from the identified malfunctions in the process or way of working;Acts as 2nd tier in Audit and Quality Assurance Processes and reports out top defects and overall scores and findings & opportunities for improvement.Main Interfaces:GSSOCluster team members and Coordinators; Team Lead/Head; GSSO Teams; GSSO Management. Ericsson SourcingAll Ericsson Sourcing Units members; Non-Sourcing Units.Supplier Organizations (mainly for eSourcing) Sales & Account Managers. Competence profile:People skills Skilled in coordinating teams and projects; Strong communication and presentation skills; Strong customer orientation and ability to work under pressure; Proficient in facilitating and delivering training and knowledge sharing. Process skills Strong knowledge in used tools (min 1.5 hands-on experience in respective area (reporting, market intelligence, spend, eSourcing etc.); Excellent knowledge in Sourcing area and common industry practices; Business Process Management Skills.Performance skillsStrong analytical and reporting skills, synthetic and documenting skills; Strong level knowledge of MS Office Pack; Proven track record of outstanding performance (behavior and business objectives). Education & Language: Bachelor Degree within Finance / Economics / Mathematics / Computer Science / Computer Engineering or alternate; Fluency in written and spoken English required is essential; Other language skills are advantageous as per regions mapped under his/her cluster for eSourcing. Interpersonal skills:Pro-activity towards customer service is essential; Flexible and responsive to changing work patterns and demands; A thorough and methodical approach to work; Well-developed interpersonal communication and people orientation; Willing to share knowledge, experiences and skills to create a learning culture; Excellent ambassador of GSSO and Ericsson culture and values; Good leadership & networking skill; Persuasion and influencing. \n\n\n", "title": "Data Analytics Business Partner", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-data-analytics-business-partner/749047/1"}