{"body": "\n\n\n\nCandidatul ideal\n\r\nRequirements:\r\n• Minimum 3 years’ experience in international sales or Customer Service, logistics and/or transportation department;\r\n• Fluent in French/Italian/German and English;\r\n• Good mastering of Ms Office tools (Outlook, Word, Excel, Power Point).\n\r\nDescrierea jobului\n\r\nSUMMARY OF THE ROLE\r\nTo improve delivery performance to Emerson customers in Europe.\r\nResponsibilities:\r\n• Upon reception of Customers orders, identify the relevant products, clarify the prices from the system and the Customer Database and book the orders in the ERP system;\r\n• Check the lead-times provided by the Plants, potentially get a shorter lead-time from the Plants if lead time is identified as too long, confirm the lead time on the order;\r\n• Follow-up of customer orders from order entry until delivery and invoicing of the goods including organization of transports worldwide;\r\n• Support the Sales Office for all questions and direct them to appropriate contacts in other departments if needed;\r\n• Daily contact with customers, by phone and email .\r\n• Develop a specific area of expertise;\r\n• Organize and implement scanning of all orders and relevant documentation;\r\n• Contacts with production units and marketing, quality, application engineering and logistics departments;\r\n• Allocate to relevant Sales Offices all requests coming on the Company’s eCommerce internet site;\r\n• Various administration tasks related to customer files.\n\r\nIn order to complete your application, please follow the link provided below. You will be redirected to the EMERSON Career’s Page where you can fill-in your profile and upload your CV. The application process takes between 3-5 minutes to complete.\r\nSteps:\r\n-\tClick on the link (if the link does not work, you go to www.emerson.com and select the “careers” tab )\r\n-\tInput the search criteria \r\n-\tChoose the desired position and click Apply Now\r\n-\tComplete the registration process\r\n-\tAttach your CV and Letter of Intent\n\r\nThank you for your interest in Emerson!\n\r\nhttps://us2.i-grasp.com/fe/tpl_emerson01.asp?newms=jj&id=65896&aid=16190\n\r\nDescrierea companiei\n\r\nEmerson is a global leader in bringing technology and engineering together to provide innovative solutions for customers in industrial, commercial, and consumer markets around the world. Founded in 1890 in St. Louis, Missouri (USA), Emerson delivers solutions through five business segments: Process Management, Industrial Automation, Network Power, Climate Technologies, and Commercial & Residential Solutions. With sales of $24.7B and more than 130,000 employees in over 150 countries, we have a customer-focused, results-driven culture where employee performance is recognized and rewarded.\n\r\nVisit us at: www.emerson.com\n \n\n\n", "title": "CUSTOMER COMMUNICATOR WITH EN&DE/IT/FR", "company_url": "http://www.bestjobs.ro/firme/emerson-romania/2915814/2", "career_level": "Entry", "company": "EMERSON ROMANIA", "locations": "\nStrada Emerson, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza, Germana, Italiana", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-communicator-with-en-de-it-fr/230832/2"}