{"body": "\n\n\n\nPentru postul de Business Analyst căutăm o persoană creativă şi versatilă care este în căutare de noi provocări. O persoană care găseşte soluţii şi care poate vedea calea de mijloc între două direcţii în opoziţie. O persoană care vorbeşte atât limba clientului cât şi pe cea a tehnicilor.\r\nÎi oferim ocazia să lucreze într-un mediu în care iniţiativa este susţinută şi încurajată şi învăţarea este un proces firesc. Proiectele pe care va lucra sunt diversificate şi prezintă particularităţi specifice industriilor de telecom, medical, transport, comerţ online şi bancar.\n\r\nResponsabilităţi:\n\r\nAnalizează cerinţele de la clienţii interni şi externi;\r\nÎnţelege şi traduce cerinţele de business în specificaţii funcţionale;\r\nExtrage cerinţele pe baza documentaţiei de proiect (caiet de sarcini, ofertă tehnică, cadru legislativ) şi a întâlnirilor cu clientul;\r\nRedactează şi validează specificaţiile tehnice;\r\nAnalizează impactului negativ provocat de schimbările propuse şi găseşte soluţii pentru minimizarea acestuia;\r\nOfertă soluţii pentru optimizarea proiectului sau a procesului şi le argumentează;\r\nAsigură calitatea livrabilelor şi tratează atât cerinţe funcţionale cât şi pe cele de securitate, performanţă, scalabilitate, etc;\r\nEste puntea de legătură între client, project manager, programatori şi testeri pentru a asigura înţelegerea corectă a cerinţelor;\r\nParticipă la estimarea activităţilor din proiect;\r\nUrmăreşte proiectul pe parcursul implementării şi se implică împreună cu programatorii în rezolvarea problemelor apărute în timpul dezvoltărilor;\r\nRevizuieşte şi optimizează constant cerinţele tehnice;\r\nParticipă la licitaţii şi la ofertare prin întocmirea ofertei tehnice şi contribuie la evaluarea financiară;\r\nVerifică dezvoltarea produselor software în parametrii de calitate ceruţi de client şi în conformitate cu standardele companiei;\r\nSupervizează testarea, scrierea UAT-urilor şi participă la acceptanţa proiectului;\r\nPregăteşte şi prezentă progresul proiectului;\r\nAsigură continuitatea proiectului (suport şi CR-uri);\r\nRealizează documentaţiile necesare proiectului: meeting reports, status report, manuale de utilizare, etc.\n\r\nCerinţe:\n\r\nExperienţă în funcţia de Analist IT;\r\nCreativitate şi iniţiativă;\r\nAtenţie la detalii;\r\nFamiliarizat cu tehnologiile de dezvoltare software;\r\nCapacitate de sinteză;\r\nAbilitate în analiza datelor şi diagnostic (folosind SQL, Excel sau alte instrumente de analiză a datelor);\r\nAbilitate în rezolvarea rapidă a problemelor;\r\nGândire analitică şi logică;\r\nAbilitaţi de comunicare scrisă şi verbală; \n\n\n", "title": "Business Analyst", "company_url": "http://www.bestjobs.ro/firme/radcom-srl/4883/1", "career_level": "Middle", "company": "RADCOM SRL", "locations": "\nStr.George Constantinescu nr.2C MULTIGALAXY II sect 2, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-business-analyst/750911/1"}