{"body": "\n\n\n\nAbout Connectis\r\nConnectis is a fast growing company that develops software for online identification, authentication and authorization of users at very high security levels. We work in an exciting and fast-growing field, which often hits the news headlines. We want to improve the world by making online identification available for everyone and ensuring that people’s privacy is protected in the best way possible. Connectis is a flat and agile organization. Everyone participates and has a ‘hands on’ mentality. We are an honest and ambitious team of experts that together create a positive working atmosphere. Connectis is located within walking distance of Rotterdam Central Station.\n\r\nWorking at Connectis means\r\n • Team spirit\r\n • Flexible approach to (free) time and leave\r\n • Personal contribution to mission critical software used by millions of people\r\n • Ample opportunity to learn new skills.\n\r\nThe job\r\nSecure programming is key to keeping our company healthy. Therefore, we are looking for genuine developers; craftsmen that share our drive. We have a genuine learning environment and you will practice with us and learn how to become an expert hacker and penetration tester. You will learn how to create architectures that are inherently secure and code that reads like poetry. Doing so, you will become an expert on secure programming.\n\r\nYou will contribute to our own software as-a-service and cloud applications with which we reach millions of end-users. Our code is mission critical for many of our high-profile customers.\n\r\nDaily Work\r\n • penetration test the Connectis software;\r\n • analyze the security properties of our architectures;\r\n • share secure programming knowledge with colleagues;\r\n • take part in daily stand-ups;\r\n • develop features in our platform;\r\n • extend automated testing framework with more security tests;\r\n • discuss safety features with the product owner;\r\n • review and provide feedback on colleagues’ work.\n\r\nWe are looking for someone\r\n • with university thinking level;\r\n • with an education or dissertation in exact sciences, ideally computer science or similar;\r\n • who is very creative;\r\n • who is a great software enthusiast;\r\n • who wants to become an expert in secure programming;\r\n • who likes to share knowledge with his colleagues.\n\r\nDesired Experience\r\n • Java expert;\r\n • hacking experience;\r\n • knowledge about internet security;\r\n • knowledge about Hibernate, PostgreSQL;\r\n • Tomcat, Google Guice, RESTful Web Services;\r\n • knowledge of authorization protocols such as SAML, XACML, OAuth, SCIM;\r\n • knowledge of tools like Maven, Ansible, Mercurial, Selenium;\r\n • experience with Scrum;\r\n • experience with Linux.\n\r\nInterested?\r\nPlease apply via the 'Apply' button.\n\r\nAgency calls not appreciated \n\n\n", "title": "Software Developers", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nRotterdam, Olanda de Sud, Olanda\n", "url": "http://www.bestjobs.ro/locuri-de-munca-software-developers/752255/1"}