{"body": "\n\n\n\nSkyConsult is looking for a SAP SD Consultant with hands on experience in 2nd Level Support for Sales and Distribution related issues escalated by the 1st Level Support team of our client.\n\r\nBlueprint of typical tasks:\n\r\nHe/she will:\r\n>  assist the customer in adopting the best solutions to adapt SAP environment to actual business requirements;\r\n> perform the analysis, configuration and implementation of the minor changes or change requests approved by the customer.\r\n> make use of consulting skills, business processes knowledge and SAP solution expertise to provide efficient support and integrate SAP technology into the client’s complex business environment.\n\r\nRequired Job skill set:\r\n>  support, design, configuration and testing of core SAP Sales and Distribution modules;\r\n>  experience and knowledge of key integration points of Sales and Distribution, Logistics modules with other SAP modules:\r\n>  successful implementation of SAP, including providing functional expertise, guidance, presentation, training and support activities on SAP products;  \r\n> inventiveness, ability to find fast and smart solutions in existing SAP environment to incidents or customer’s requirements;\r\n> customer management experience and concern;\r\n>  excellent communication skills;\r\n> business knowledge and process design skills;\r\n> Bachelor's Degree\r\n> minimum 5 years of SAP SD / Logistics Execution configuration/support experience\r\n> fluency in written and spoken English;\r\n> knowledge of SAP IS-Oil & Gas functionalities - nice to have;\r\n> SAP Idoc and interfaces experience - nice to have. \n\n\n", "title": "SAP SD Consultant", "company_url": "http://www.bestjobs.ro/firme/skyconsult-group/13398341/1", "career_level": "Senior", "company": "SkyConsult Group", "locations": "\nStr Tipografilor 11-15, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-sap-sd-consultant/751164/1"}