{"body": "\n\n\n\nStudio 20 este unul dintre cele mai apreciate si respectate studiouri la nivel mondial. Calitatea muncii noastre a fost rasplatita cu mai multe premii internationale, dintre care amintim cele mai recente:\n\r\nBest Live Cam Studio (YNOT Awards, Praga, septembrie 2015)Best Emerging Studio (AW Awards, Mamaia, iunie 2015)Studio of The Year (GFY Awards, Las Vegas, ianuarie 2015 si din nou in ianuarie 2016)\r\nActivitatea noastra a fost prezentata de presa de business din Romania, cu cifre reale, ca un exemplu de profesionalism si experienta in acest domeniu. Modele faimoase precum Devious Angel, Emma Wild, Raquelle Diva, Sasha Red sau Zeya Brunette au primit de asemnea premii internationale la Barcelona, Praga si Las Vegas, dovedind ca stim si putem sa crestem modele de succes, care castiga peste 10.000$ lunar.\n\r\nDincolo de premii, suntem o echipa extrem de simpatica si atenta, un loc de munca placut, de care te vei atasa. Lucram 100% legal si avem peste 15 ani de experienta in Romania (am inceput in anul 2001). Cele mai mari situri din lume ne mentioneaza oficial ca parteneri preferati si sunt alaturi de modelele care lucreaza la noi pentru a le ajuta sa reuseasca.\n\r\nAcum pregatim o echipa noua pentru viitorul studio din Timisoara. Daca esti o persoana vesela, pozitiva, empatica, daca stii sa comunici si sa motivezi pe cei din jur, sa-i ajuti sa ofere ce este mai bun in el si daca pui succesul lor deasupra orgoliului tau, atunci vino alaturi de noi.\n\r\nCandidatul ideal este o ea pentru jobul de Trainer / Coach si un el pentru jobul de Admin / Suport, are intre 25 si 45 de ani, vorbeste si scrie fluent limba engleaza si vrea sa invete, sa avanseze, sa aiba o cariera, fiind evident constient(a) ca pentru asta efortul si implicarea trebuie sa fie pe masura.\n\r\nExperienta in live cam / video chat, ca model, hostess, suport, admin, trainer, manager, fotograf, operator si asa mai departe poate fi un avantaj, dar nu este obligatorie.\n\r\nInterviurile se vor tine in perioada 15-17 decembrie in Timisoara, iar jobul va incepe efectiv la inceputul lunii ianuarie cu o luna de training platit in sediul central din Bucuresti, deschiderea studioului din Timisoara avand apoi loc pe 1 februarie 2016.\n\r\nPoti aplica si daca te intereseaza alte joburi disponibile in studiourile 20 din Timisoara, Bucuresti sau Cluj (Cluj-Napoca): asistent / asistenta, maketing, social media, call center, operator, traducator, PR, HR, recrutare, financiar, model, hostess, vanzari, sales, servicii.  Interviu Online:1.  Pentru ce job ai decis sa aplici?2.  Ce te atrage la Studio 20?3.  Ai mai lucrat vreodata in domeniul nostru de activitate (pe orice post)? \n\n\n", "title": "TRAINER,  ADMIN & MODEL SUPORT", "company_url": "http://www.bestjobs.ro/firme/studio-20/11771232/1", "career_level": "Middle", "company": "Studio 20", "locations": "\nCalea Victoriei nr. 155, București, Municipiul București, România;Intrarea Doinei 19-21, Timișoara, Județul Timiș, România;LOUIS PASTEUR 24, Cluj-Napoca, Județul Cluj, România;Strada Atelierului nr. 20, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-trainer-admin-model-suport/752025/1"}