{"body": "\n\n\n\nEricsson Overview Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world. We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals. Job SummaryMarket intelligence is a combination of research and consultancy, helping businesses to make decisions and set priorities. The Market Intelligence Analyst will analyze, interpret and synthesize learnings from all research sources, drawing conclusions that are actionable, impactful, and accessible for customers and/or stakeholders.  Successful candidates will be responsible for collecting, analyzing and summarizing data from various sources: internet research, economic databases, market reports from diverse research companies, customer and competitor research, industry events etc. to meet time-sensitive delivery goals. The position will involve doing detailed competitive intelligence analysis.Responsibilities & TasksContinuously monitor and analyze key industry and market trends as well as the wider external environment Raise awareness of trends and their potential impact on our companies business, and provide recommendationsGather information about competitors / and or suppliersGather information about industries and provide industry analysesPerform financial analysesServe as the liaison to the customers and work with them to develop and refine research objectivesCollaborate with internal teams to ensure customer’s objective are met Position QualificationsCore Competences: Financial evaluation skills (background: financial newspapers, brokerage companies) - Good level of knowledge & understanding of financials ratios Strong written and oral communication skills are essential, as presenting findings and supporting conclusions is an important part of the job Advanced Excel and PowerPoint skills Knowledge of strategic analysis frameworks (Porter’s Five Forces, Kraljic, SWOT)  Strong command of macroeconomic and specific industry indicators  Behavioral CompetencesAccuracy and attention to detail  Ability to work effectively in teams as well as independently, within tight deadlines  Be able to interact with the customer (e-mails, phone calls) independently and use his/her skills to guide newcomers  Be able to handle a request end-to-end (from receiving the request to performing the pre-analysis and then independently) Propensity to creative and innovative thinkingMinimum Qualifications & Experience Requirements:At least 1 year of relevant experience A first academic degree or equivalent qualification  \n\n\n", "title": "Market Intelligence Analyst", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Entry, Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-market-intelligence-analyst/748893/1"}