{"body": "\n\n\n\nRed Mountain Management, your home away from home.Your career starts today, step into the financial market supported by a world leading company. Take a leap forward, gather new experience and evolve both professionally and personally.Red Mountain Management has a partnership with a revolutionary company in the binary options industry, due to its recognized experts in the trading assistance department and also due to the competitive financial products made available. Our partner achieves an outstanding performance with and an impressive expansion with the best team of experts and the best financial products.Ideal candidateYou can be one of us only if  YOU ARE:- targeting high results in order to increase income;- willing to learn new skills and tasks;- able to act as part of a team and on your own;- driven, confident and determinate;- ready to succeed and build a career;- interested in or have knowledge of the financial sector and capital markets;- fluent in English both spoken and written;            - courageous enough to achieve and overcome expectations.Job descriptionYou will be in charge of:- Maintaining and developing successful business cooperation with the international prospects in order to build and maintain their interest and satisfaction in the company’s products.- Providing all the necessary information and assistance in a professional and accurate manner for growing the share of the products and services based on the company strategy.- Attracting the potential client’s attention and turn that interest into sales.- Making efforts to identify and anticipate the client needs and beyond current service relationship.- Manage the relationship with the client through CRM and all available communication channels.- Enlarging client portfolio size.Benefits• attractive financial package independent of any target;• commissions aside from fixed salary;• full time legal work contract;• monthly bonuses;• professional training sessions and ongoing coaching;• real opportunities of promotion within the company;• free of slow corporate procedures & regulations;• young, professional, fast-paced and friendly working environment.Bonus·        Private medical insurance·        Central location·        Teen and highly motivated teamIf you enjoy being challenged over and over again, but also to have fun, Red Mountain Management(RMM for friends) will be the best place for you to work. We invest heavily in the development of our people, and RMM gives you plenty of opportunities for individual initiative and responsibility.Send us your resume and let’s get to know each other! \n\n\n", "title": "Sales Representative with English", "company_url": "http://www.bestjobs.ro/firme/red-mountain-management/13597751/5", "career_level": "Middle", "company": "RED MOUNTAIN MANAGEMENT", "locations": "\nAcademiei 28-30, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-sales-representative-with-english/201811/5"}