{"body": "\n\n\n\nThis is a contractor position, for a non-determined period, located in Bucharest.Responsibilities:  To assist and to ensure operational support for the direct manager;  \tTo coordinate the arrangements of meetings, to manage agenda, and to coordinate travel and accommodation arrangements; \tTo participate in preparing materials and documents, upon request; \tTo plan, to organize and to prioritize work on a daily basis in order to meet deadlines; \tTo prepare routine documents as requested by the direct manager; \tTo process financial documents by submitting them into the financial systems of the company; \tTo manage specific system processes related to GIP Inflammation projects; \tContinuous and efficient communication with the selected agencies in order to ensure the internal and external logistics based on the defined needs; \tTo keep direct contact with Sales Force Team in order to implement the projects on scope; \tEnsure intra and inter – departmental healthy and constructive relationships in order to facilitate team work; \tKeep continuous communication with Projects owners and colleagues involved based on the specific projects needs, as discussed with Country Brand Lead Inflammation for each event; \tTo proactively prepare and retain all documents requested by MAPP and Country annex; \tTo present a quarterly reports of document status and events organized within Inflammation Franchise; \tTo complete audit requests, if the caseSkills, Knowledge, Qualifications & Experience:1 year previous experience in a similar role \tUniversity degree \tAdvanced English level \tAbility to work under pressure (e.g. cope with multi-tasks) whilst maintaining quality \tComputer literacy – Microsoft Office (Word, Excel, Power Point) \tVery good ability to plan, organize, prioritize \tAbility to communicate effectively verbally and in writing \tSystematic thinking and ability to work according the instructions  If you are interested in this position, please send your resume to HRRomania2@pfizer.com \n\n\n", "title": "Marketing Assistant", "company_url": "http://www.bestjobs.ro/firme/pfizer-romania-srl/1912605/1", "career_level": "Entry", "company": "PFIZER ROMANIA SRL", "locations": "\nSos. Bucuresti-Ploiesti nr. 172-176 Cl. B Etaj 5, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-marketing-assistant/749318/1"}