{"body": "\n\n\n\n09132 Hybrid gasoline engine calibration Graduate Engineer\n\r\nDescription\n\r\nCompany General Information\n\r\nTOYOTA is one of the world’s largest automobile manufacturers and a leading global corporation.  \r\nFounded in 1937. Toyota now sells vehicles in 170 countries and employs over 300.000 people.\n\r\nBased in Brussels, Belgium, and staffed by 2.700 people and more than 60 nationalities, \r\nToyota Motor Europe (TME) handles the wholesale marketing of Toyota and Lexus vehicles, parts & accessories, and manages Toyota’s European R&D, manufacturing and engineering operations.\n\n\n\r\nTeam / Division Description\n\r\nTME R&D centre is responsible for planning, development and production support of vehicles aimed at - and locally produced for - the European market. The HV team is part of the Powertrain Engineering group and is responsible for matching THS (Toyota Hybrid System) calibration with market requirements.\n\r\nOn a project base, we calibrate emissions, On-Board Diagnosis (OBD) items and other new functions of the vehicle and validate our setup in various driving conditions while ensuring the best F/C, N/V and driveability. Our team operates with full responsibility for ensuring the performance and quality of the whole THS calibration. We provide the calibrated THS software and proof of software quality by issuing design review reports and tolerance investigations.\n\r\nOn a vehicle planning base, we work in closed cooperation with simulation department to elaborate new virtual tools to accelerate our development for mass production and pre-evaluate future THS.  We are also strongly linked to factories and support them for vehicle equipped with THS line-off. \r\nFurthermore, we create and use various simulation tools and perform various vehicle tests (vehicle roller test cell, test track driving, real road driving, etc…) as well as software tools for data processing, visualization, analysis and automated optimisation.\n\n\n\r\nYour Responsibilities\n\r\nYou will contribute to TOYOTA Hybrid System improvement for European market\r\nYou will challenge new business area for future TOYOTA gasoline hybrid development\r\nYou will develop gasoline engine calibration linked to THS for EU market\r\nYou will develop virtually future THS for EU market with vehicle and powertrain simulation departments.\n\r\nYour main tasks: \n\r\n• Gasoline engine calibration (emissions, fuel consumption, OBD, evaporation) linked to THS\r\n• Data analysis of development problems, tolerance investigations and calibration confirmations\r\n• Planning of vehicle testing, chassis dyno testing – with technician team -,report making and issuing\r\n• Managing/changing/updating/compiling software for THS calibration project and issuing official software\r\n• Actively support future gasoline-HV concept development with ideas, statistical investigation, \r\n• benchmarking activities and making calibration for concept testing on prototype vehicles.\n\n \n\n\n", "title": "Hybrid gas engine calibration Graduate Engineer", "company_url": "http://www.bestjobs.ro/firme/toyota-careers-europe/2607119/1", "career_level": "Entry", "company": "Toyota Careers Europe", "locations": "\nBruxelles, Regiunea Capitalei Bruxelles, Belgia\n", "url": "http://www.bestjobs.ro/locuri-de-munca-hybrid-gas-engine-calibration-graduate-engineer/751569/1"}