{"body": "\n\n\n\nHORNBACH se află în topul magazinelor de materiale de construcţii și grădinărit cu o cifră de afaceri de peste 3 miliarde euro/an, cu o reţea de peste 150 magazine și aproximativ 16.000 angajaţi; momentan în 9 ţări europene.\n\r\nLUCRĂTOR COMERCIAL (ref: 522303)\n\r\nResponsabilități• acordarea de consultanță clienților în funcție de achizițiile pe care aceștia doresc să le facă în magazin;\r\n• promovarea produselor din magazin;\r\n• realizarea de comenzi în sistem şi etichetarea preţurilor;\r\n• aranjarea produselor pe raft.\n\r\nCASIER  (ref: 523003)\n\r\nResponsabilități\r\n• realizează operaţiuni de casă: încasează sumele achitate de clienţi; operează pe banda de casă denumirea produselor, cantitatea şi suma încasată;\r\n• întocmeşte dispoziţii de plată (facturi către clienţi);\r\n• întocmeşte monetarul la sfârşitul fiecărei zile;\n\r\nCerinţe\r\n• competență profesională;\r\n• minim 6 luni experiență în domeniu;\r\n• studii medii;\r\n• cunoștinte operare PC (Ms Office);\r\n• persoană sociabilă, serioasă, responsabilă, cu spirit de echipă.\n\r\nOferta (bonusuri, beneficii)\n\r\nÎţi oferim:\r\n- formare profesională în cadrul companiei,\r\n- oportunități reale de promovare în cadrul companiei;\r\n- salariu atractiv și un sistem de premiere în funcție de implicare și performanțe individuale;\r\n- posibilitatea de a lucra alături de o echipă dinamică și motivată;\r\n- un loc de muncă sigur într-un ambient modern.\n\r\nAșteptăm CV-ul tău până în data de 07.03.2016 la următoarea adresă:\r\nStr. Hornbach nr. 17-21 Domnești, jud. Ilfov sau la\r\ne-mail: hr_ro@hornbach.com;\r\nfax: 021/206.15.32\r\nIMPORTANT: Vor fi luate în considerare doar aplicaţiile sub forma expediere prin poştă, e-mail sau fax la datele menţionate mai sus!\n\r\nDACĂ DORIŢI SĂ APLICAŢI PENTRU UNUL DINTRE MAGAZINELE HORNBACH, VĂ RUGĂM SĂ NE TRIMITEŢI CV-UL ÎN UNA DINTRE MODALITĂŢILE MENŢIONATE MAI SUS, SPECIFICÂND LOCAŢIA MAGAZINULUI PENTRU CARE OPTAŢI! \n\n\n", "title": "Lucrator comercial / Casier", "company_url": "http://www.bestjobs.ro/firme/hornbach-romania/3114604/2", "career_level": "Middle", "company": "HORNBACH ROMANIA", "locations": "\nCalea aradului nr. 56, Timișoara, Județul Timiș, România;Calea surii mari nr. 37, Sibiu, Județul Sibiu, România;Hornbach, București, Municipiul București, România;Str bucegi, Brașov, Județul Brașov, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-lucrator-comercial-casier/230969/2"}