{"body": "\n\n\n\nOPISNAVX is looking for an exceptional data scientist to synthesize and leverage our massive data set, to enhance the information we produce and create superior products.\n\r\nThis is a unique opportunity to join a multidisciplinary team of creative and passionate individuals, and create products and services that will be used by the Connected Car industry.\n\r\nWe are focused on high-impact projects utilizing big data analytics and machine learning to improve our Fuel Prices, Parking Information and Electric Vehicle products database.\n\r\nWe are a lean and flat team, working in quick iterations, using the techniques and algorithms best suited for solving the challenging problems of having very high quality and predictable data.\n\n\r\nMAIN TASKS\n\r\n    * Understand the business concepts underlying our massive data set\r\n    * Translate business problems into a mathematical/statistics problems\r\n    * Create and develop new algorithms and tools to model and analyze the data and build filtering and predictive models\r\n    * Identify the most critical data, and provide strategic guidance to the rest of the company\n\n\r\nPROFILE\n\r\n    * Ph.D. or Master’s Degree in operations research, applied statistics, data mining, machine learning, or a related quantitative discipline. \r\n    * Deep understanding of statistical and predictive modeling concepts, machine-learning approaches, clustering and classification techniques, and recommendation and optimization algorithms.\r\n    * A first experience in the field of complex analytical problems using quantitative approaches with statistics, mathematics and software skills.\r\n    * Accomplished in the use of statistical analysis environments such as R, MATLAB, SPSS or SAS. \r\nComfortable with relational databases, Hadoop-based data mining frameworks, Spark or Cassandra.\r\n    * Familiar with SQL and Python. \n\n\n", "title": "DATA SCIENTIST", "company_url": "http://www.bestjobs.ro/firme/opisnavx/10503882/5", "career_level": "Entry, Middle", "company": "OPISNAVX", "url": "http://www.bestjobs.ro/locuri-de-munca-data-scientist/182066/5"}