{"body": "\n\n\n\nWho we are:\n\r\nyoungculture is part of NSM Engineering, a Swiss software engineering group of companies, which provides near-shore services for aviation, banking, telecommunications, eCommerce, and many other sectors. Its headquarters are in Zurich and it has its own near-shore development centers in Serbia (Belgrade, Nis) and Romania (Iasi).\n\r\nWith the approach to deliver high quality software solutions for our international customers we are looking for motivated new colleagues, to join our growing Iasi software engineering team in the following position:\n\r\nJAVA DEVELOPER - eCommerce (Regular & Senior)\n\r\nYou will be part of our agile team engaged in the development of a top enterprise e-commerce platform. You will contribute with your expertise in creating high-quality code on customizations and solutions with use of Java Enterprise, Spring framework and Web Services.\n\r\nWho we are looking for:\n\r\nThe ideal candidate hired into this position should have the following key skills /experience:\r\n•\tBachelor or higher degree in computer science (or equivalent)\r\n•\t2-5+ years of professional experience in software development using Java. Previous work in e-commerce projects, agile methodologies and distributed development teams would be considered as assets\r\n•\tVery good understanding of OOP principles, design patterns and practices\r\n•\tExperience using Spring framework (Core, MVC, Integration, Security), REST Web Services, and ORM technologies (JPA/Hibernate) \r\n•\tExperience in web development (JSP, JavaScript/JQuery, Ajax, HTML5, CSS)\r\n•\tAbility to interpret and communicate information to the client\r\n•\tOpen and friendly personality, as well as drive, initiative, problem-solving mindset,  excellent interpersonal and team-working skills\r\n•\tGood verbal and written communication skills in English\r\n•\tKnowledge of German will be considered as an asset\r\n•\tAvailability for abroad business trips.\n\r\nWhat we offer:\r\n•\tChallenging projects in a highly professional, but also relaxed, collaborative and supportive environment\r\n•\tWorking in small and excellent skilled teams\r\n•\tOpportunity for long term professional growth within our development center\r\n•\tSalaries and conditions which correspond to the high demands\r\n•\tModern office space in the city center\r\n•\tTravel opportunities to EU countries.\n\r\nWorking location:\r\nIasi, Romania\n\r\nPlease send your resume to jobs.romania@youngculture.com. \r\nWhile we appreciate everyone’s interest in youngculture’s openings, notice that only selected candidates will be contacted.\r\nYour application will be treated strictly confidential. \n\n\n", "title": "Java Developer - eCommerce (Regular & Senior)", "company_url": "http://www.bestjobs.ro/firme/youngculture/13491628/5", "career_level": "Middle, Senior", "company": "youngculture", "locations": "\nPalas, Iași, Județul Iași, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer-ecommerce-regular-senior/209323/5"}