{"body": "\n\n\n\nDescrierea firmei:\r\nBAUMIT ROMANIA este o societate comerciala cu capital austriac, parte a grupului Schmid Holding Industrie, unul dintre cei mai mari producatori europeni de materiale de constructii.\n\r\nFondata in anul 1995, societatea comerciala BAUMIT ROMANIA s-a impus in scurt timp, ca leader al pietii nationale in domeniul productiei si comercializarii unei game largi de sisteme si materiale de constructie: sisteme termoizolante, mortare, tencuieli si sape gata preparate, finisaje pentru exterior si interior, sisteme pentru asanarea, restaurarea si renovarea cladirilor vechi, sisteme de hidroizolatie si de lipire a placajelor ceramice sau din piatra naturala, pardoseli industriale, etc.\n\n\r\nDescrierea postului:\r\n- Realizarea integrala a planului de vanzari valoric si sortimental.\r\n- Recuperarea debitelor si urmarirea incadrarii stricte in limitele de creditare contractuale.\r\n- Instruirea personalului tehnic sau comercial al partenerilor privind aplicarea corecta a sistemelor si materialelor furnizate sau propuse a se pune in opera; urmarirea respectarii  tehnologiei de aplicare in vederea prevenirii tuturor tipurilor de reclamatii ulterioare.\r\n- Participarea nemijlocita la organizarea si desfasurarea activitatilor de promovare si reclama organizate la nivel central sau local (targuri, expozitii, seminarii, demonstratii, instructaje etc).\r\n- Managementul partenerilor de afaceri si achizitionarea de clienti noi, cu respectarea stricta a normelor interne privind activitatea comerciala.\n\r\nCerinte:\r\n- studii superioare de specialitate;\r\n- experienţă de minim 3 ani într-un post similar din vânzări;\r\n- capacitate foarte bună de comunicare şi relaţionare cu clienţii, atenţie distributivă, simţ pentru detaliul semnificativ, capacitate rapidă de decizie;\r\n- personalitate energică, gândire pozitivă, amabilitate şi eficienţă;\r\n- cunoştinţe operare PC (Windows, Microsoft Word şi Excel, Internet);\r\n- permis de conducere categoria B.\n\r\nOferta:\r\n- pachet salarial atractiv;\r\n- maşina de serviciu;\r\n- telefon mobil;\r\n- programe de formare continuă interne şi externe; \n\n\n", "title": "Reprezentant Vanzari", "company_url": "http://www.bestjobs.ro/firme/baumit-romania-com-srl/4362632/2", "career_level": "Middle", "company": "BAUMIT ROMANIA COM SRL", "locations": "\nSuceava, Județul Suceava, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reprezentant-vanzari/231118/2"}