{"body": "\n\n\n\nJob Summary\r\nThe AP Travel and Expense Analyst is responsible for performing accounting and administrative tasks related to efficient and timely processing of all Travel and Expense reports. In connection with this role, the analyst will also process credit card applications, system maintenance, and customer support of the T&E Credit Card program.  This position resolves business critical issues, provides internal and external customer support, implements process improvement initiatives, and proactively manages day to day issues related to employee reimbursements.\r\nResponsibilities: \r\nReview all expense reports for accuracy and completeness through the SAP ERP system\r\nPerform random audit of expense reports  in accordance with Cameron policies and procedures\r\nPull and copy expense reports for all company internal/external audits on an as needed basis\r\nProcess all application requests and issue credit cards for T&E card program in accordance with Cameron policies and procedures\r\nCancel cards when directed to by AP Accountant in accordance with company policy\r\nAssist customers with invoice and monthly statement requests, or fraud/chargeback inquiries\r\nRespond to Helpdesk inquiries regarding all T&E policies and processes , and educate internal users on the use of the online training and information as needed\r\nResponsible for monitoring all exception reports and reporting exceptions to AP management team in a timely manner\r\nMaintain accurate and current documentation and files\n\r\nREQUIRED QUALIFICATIONS\r\n1-2+ years of finance and accounting experience in a multinational company/shared service center with emphasis on processing travel and expense reports\r\n1+ years of SAP or other ERP system application\r\nFamiliar with accounting standard concepts, practices, and procedures\r\nProficient working with Microsoft Office suite, including Word, Excel, and Outlook.\r\nAbility to handle high-volume of data in a face paced environment\r\nAdaptable to learning new software applications\r\nStrong written, oral communication and interpersonal skills\r\nLanguage requirements: Fluent in English (comprehension, written and speech).  Other languages a plus.\r\nA disciplined self-starter with an eye for detail and accuracy\r\nStrong attention to detail and ability to multi-task, work independently, and prioritize in a fast-paced, high volume work environment\r\nOrganizational and time management skills\r\nProfessional and has a service-oriented approach  \n\n\n", "title": "Accounts Payable Travel & Expense Analyst", "company_url": "http://www.bestjobs.ro/firme/s-c-cameron-romania-s-r-l/2275072/1", "career_level": "Middle", "company": "S.C. CAMERON ROMANIA S.R.L", "locations": "\nVasile Milea Blvd 4E Sector 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-accounts-payable-travel-expense-analyst/752242/1"}