{"body": "\n\n\n\nSenior Systems EngineeriRewind is looking for a senior systems engineer with extensive Linux experience.At iRewind, we are building a platform designed to let millions of people enjoy and share their personal videos. Our product relies on a scalable Java solution spanning multiple layers going from the automated generation of personalized videos to content delivery. We are using a complex stack bringing together many state-of-the art components from distributed databases to computer vision libraries.  Our new teammate should play a leading role in the development of our content delivery platform. We are looking  for someone with existing experience in developing large scale Java applications, who is passionate about continuous improvement. You should be comfortable working in a very dynamic environment, requiring constant learning of new tools and rapid delivery of new features. RequirementsExperience with configuration/administration of the following: Web servers (nginx/apache), HAProxy, Jboss, Tomcat, Nagios, Jenkins, SaltStack, SOLR, Cassandra, Kafka Experience with database configuration/administration Proficiency in Python Extensive experience (min 5 years) with Linux systems performance tuning, logging aggregation Experience working with Continuous Integration (in particular Jenkins) concepts and tools;  Experience with large scale, high-traffic enterprise projects  ResponsibilitiesMaintain a complex server infrastructure, including performing system scans, vulnerability management activities Providing network administrative support for development, deployment, and problem identification and remediation of the network environment Developing and implementing migration plans and coordinating redesign efforts with the system engineering team Identifying and correcting hardware and software issues  About iRewindWe are a Swiss tech start-up founded in December 2013. We began commercial operations in February 2015 in the sports market, with expansion plans to Leisure and Travel segments such as amusement parks, castles, resorts, museums, cruises, etc.Our technology matches camera meta-data with user positioning information to identify and make you the star of your personalized video memory. We disrupt the memories market by eliminating the need to carry a camera.Accolades received:1st place winner Swiss ICT “Newcomer“ (2014) 1st place winner Grand Prix Geneva International Inventions Salon (2014) “Top 17 Disruptors“ at START Global Web Summit (Oct 2014) “Top 8 Recommended“ promising Swiss start-ups ( Bilan, Feb 2015) 1st place winner “Creative Integration of Technology“ (Axis Communication, 2015)  \n\n\n", "title": "Senior Systems Engineer", "company_url": "http://www.bestjobs.ro/firme/i-rewind-srl/13370165/5", "career_level": "Senior", "company": "I-Rewind SRL", "locations": "\nStrada Eugen Lovinescu nr. 29, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-systems-engineer/205679/5"}