{"body": "\n\n\n\nScopul Postului: Coordoneaza si solutioneaza restabilirea serviciilor  pentru a asigura conformitatea cu standardele de calitate ale ORO si a proceselor de comunicare interna si extern. Analizeaza impactul incidentelor sau al lucrarilor programate pentru a stabili prioritatile operationale sau riscul asociat.Responsabilitati•Coordoneaza operational implementarea noilor servicii sau planurilor de imbunatire a calitatii serviciilor;•Analizeaza si evalueaza activitatile programate ce au impact semnificativ asupra serviciului, alaturi de coordonatorul de operatiuni;•Analizeaza si solutioneaza reclamatiilor venite de la clienti;•Coordoneaza, analizeaza, evalueaza si solutioneaza rezolvarea tuturor incidentelormajore sau critice ce afecteaza disponibilitatea si calitatea serviciilor TV;•Gestioneaza actiunile referitoare la incidente si rezolvarea cazurilor critice;•Identifica problemele ce afecteaza critic sau prin recurenta serviciile fixe. Pregateste si propune actiuni pentru rezolvarea lor;•Utilizeaza si adapteaza instrumentele si procedurile specifice postului•Propune si urmareste implementarea de noi metode de monitorizare a serviciilor•Prezinta informatiile tehnice catre echipele suport clienti si marketing intr-un mod user friendlyCunostinte profesionaleCunostinte solide in:•DTH, DVB, MPEG, OTT, retele de comunicatii;•protocoale de semnalizare si transmisiuni de date;•Cunostinte de baza MySQL•Cunostinte tehnologie video digitala: DVB-C, DVB-S/S2, IPTV•cunostinte tehnice si experienta in networking, retele TCP/IP•MS Office•Limba engleza, avansatCunostinte de baza: •Baze de date Mysql•Operare si administrare servereEducatie si experienta (nivel minim necesar)•Studii universitare in telecomunicatii;•3-5 ani experienta in operarea retelelor de Telecomunicatii – DTH, DVB-C/S/S2, transport date IP;•Experienta in operarea si administrarea serverelor \tCompetente specifice: •Autonomie•Capacitatea de diagnoza si propunere de solutii•Orientare catre client si servicii•Gandire analitica•Asigura coaching / monitorizare•Abilitatea de a rezuma•Initiativa si pro-activitate•Abilitatea de a prioritiza•Abilitati de comunicare•Orientare spre rezultate•Cautarea informatiilor•Munca de echipa•Abilitati de leaderIti multumim ca ai aplicat la Orange! \n\n\n", "title": "TV Services Operations Expert", "company_url": "http://www.bestjobs.ro/firme/orange-romania-sa/885505/1", "career_level": "Entry, Middle", "company": "Orange Romania SA", "locations": "\nBulevardul Lascar Catargiu Nr.51-53 sector 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-tv-services-operations-expert/750128/1"}