{"body": "\n\n\n\n     Reporting to the Recruitment Manager, the Senior Recruitment Consultant will work as part of a motivated and dynamic recruitment team, providing a vital link between our clients and candidates.      We appreciate the “can do” attitude, combined with an analytical mind, good organization skills and strong commercial awareness.  We need for our team someone enthusiast about their job, with creative thinking skills  who can also work independent.      Roles & Responsibilities:be an active consultant for our clients throughout the selection process, from Job Description development to offer negotiation; headhunting - identifying and approaching suitable candidates who may already be in work; using candidate databases to match the right person to the client's vacancy;preparing CVs and correspondence to forward to clients regarding of suitable applicants;organising interviews for candidates as requested by the client;negotiating pay and salary rates and finalising arrangements between client and candidates;offering advice to both clients and candidates on pay rates, training and career progression.  Our benefits package include: competitive salary, bonuses for meeting KPI's and revenue targets, private medical insurance and a very friendly and warm team.     Humangest Group SRL, founded in 2007 and part of the italian group SGB Humangest Holding, is a human resources company that provides a wide range of services, such as: personnel leasing, permanent placement, personnel administration, payroll, training, professional counselling/outplacement, human resources consultancy and overseas personnel assignment. The Group has 42 branches in Italy and 1 in Romania. The values we trust are customer focus, flexibility and passion for our work. They contributed to our success both in Romania and in Italy.  \n\n\n", "title": "Senior Recruitment Consultant", "company_url": "http://www.bestjobs.ro/firme/humangest-group/4326309/2", "career_level": "Middle, Senior", "company": "Humangest Group", "locations": "\nStrada Herastrau, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-recruitment-consultant/230523/2"}