{"body": "\n\n\n\n\r\nJob purpose and key deliverables\n\r\nUnder the direction of the Dealing Room Manager, to support the activities of the London based Treasury Service Centre (“TSC”) as follows:\n\r\n1.\tLiquidity management: Reconciliation of opening balances, adjustment for daily clearing items, verification of daily Batcash submissions, execution of daily cash management FX swaps and investment of surplus cash balances in line with policy.\n\r\n2.\tTaO: To support and complete integration testing cycles and user acceptance testing for all future deployment groups. To assist local market SAP users as required and to represent TSC in system related meetings and projects.\n\r\n3.\tAgency Dealing: To support and execute transactions where applicable for existing and new agency markets, and to assist in future on boarding projects.\n\r\n4.\tShort term funding: Planning, preparation and execution of short term funding to include commercial paper market data collection, database maintenance, ad hoc reporting, deal input and validation.\n\r\n5.\tIntercompany funding: Pricing of inter company funding transactions in line with mandates, evidence and communication of arms length pricing to end markets, execution of corresponding loan/deposit hedges, preparation and coordination of internal discount notes.\n\r\n6.\tEnd Market FX: To assist in the execution of End Market operational fx and hedge requirements.\n\r\n7.\tAd hoc reporting as required.\n\r\n8.\tTo work with the Dealing Room Manager, and the London based dealers on other ad-hoc projects.\n\r\nEssential requirements\n\r\n1.\tThe Job Holder will need to be highly adaptable to change and able to synergise relevant concepts in financial markets and financial risks to produce relevant innovations for the TSC as well as for the BAT Group.\r\n2.\tThe Job holder must have excellent communication skills both verbal and in writing and must be proactive in maintaining and developing working relationships with various end market organisations and external counterparties. Knowledge of multiple and relevant languages will be useful given the jurisdictions that the TSC operates in.\r\n3.\tThe job holder must have relevant Treasury experience from a back office or accounting background.\r\n4.\tThe Job Holder must have excellent computer skills in respect of using all the Microsoft office suite (in particular Excel), Lotus Notes, Bloomberg, FXall and SAP\n \n\n\n", "title": "Treasury Dealer / Analyst", "company_url": "http://www.bestjobs.ro/firme/british-american-shared-services-europe/5601682/5", "career_level": "Middle, Senior", "company": "British American Shared Services Europe", "locations": "\nSEMA PARK Etaj 1 Splaiul Independentei 319 Sector 6, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-treasury-dealer-analyst/208616/5"}