{"body": "\n\n\n\nOrganizarea recrutarii si selectiei personalului productiv \r\nIntocmirea si gestionarea documentelor de evidenta a personalului\r\nInregistrarea contractelor individuale de munca in Revisal \r\nIntocmirea si operarea la zi a modificarilor intervenite in situatia salariatilor.\r\nIntocmirea dosarelor pentru personalul nou angajat (tot ciclul)\r\nIntocmirea diferitelor adeverinte solicitate de angajati.\r\nArhivarea dosarelor de personal.\r\nIntocmirea dosarelor de pensionare  (pregatire documente, verificat evidente in arhiva societatii, intocmire decizii de pensionare, adeverinte de vechime, sporuri, grupa de munca, salarii lunare – tot ciclul) \r\nReconstituire carti de munca pierdute (la cerere)\r\nIntocmirea deciziilor, notelor de lichidare, transfer, preaviz etc.\r\nOferirea informatiilor privind problemele de personal,\r\nEvidenta concediilor de odihna, evidenta concediilor medicale, \r\nAdministrarea bazei de date de evidenta a personalului utilizand computerul\r\nConfigurează rapoarte de analiza salariala (pontaj, ore normale, ore suplimentare).\r\nMenţine relaţia cu instituţiile specifice - Institutul National de Statistica, Inspectoratul Teritorial de Munca, precum şi Casa Nationala de Asigurări Sociale de Sănătate\n\r\nCerinte:\r\nLimba engleza – conversational (scris si vorbit)\r\nExperienţă min. 2 ani (de preferat intr-o companie cu peste 400 angajati)\r\nFoarte bune abilităţi de calculator (Word, Excel, SAP - avantaj)\r\nFoarte bună cunoaştere a legislaţiei muncii româneşti\r\nAtestate, certificari: Calificare Inspector Resurse Umane \n\r\nCANDIDATUL IDEAL:\r\nPersoana dinamica, energica, proactiva;\r\nSpirit intreprinzator;\r\nAbilitati foarte dezvoltate de comunicare;\r\nPersoana volubila, deschisa, pozitiva;\r\nAbilitati dezvoltate de relationare;\r\nO foarte buna capacitate de adaptare, acomodare, integrare;\r\nAbilitati de intelegere si transmitere a informatiilor;\r\nPragmatica in abordare;\r\nOrientata spre rezultate;\r\nAbilitati de organizare si planificare\n\r\nOferta (bonusuri, beneficii): \r\nSe ofera un pachet salarial atractiv, tichete masa, bonusuri cu ocazia sarbatorilor de Paste si Craciun precum si oportunitatea dezvoltarii unei cariere intr-un grup industrial multinational.\n \n\n\n", "title": "Generalist Resurse Umane Junior", "company_url": "http://www.bestjobs.ro/firme/icme-ecab-sa/36925/1", "career_level": "Entry, Middle", "company": "ICME ECAB SA", "locations": "\nDrumul Intre Tarlale 42 Sector 3 Bucuresti, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-generalist-resurse-umane-junior/750438/1"}