{"body": "\n\n\n\nYou will be involved in activities like:•\tDevelop new features for finance, trading and HR•\tApplicative development in short cycles taking in account Client’s priorities•\tTests, integration and delivery to the client•\tTrain the client•\tSupport on applications in Production environment•\tPoint out issues with the existing codes on different projects, followed by active involvement in order to clean it up;•\tMaintain a close relationship with the French team and ensure that the final result responds to its needs;•\tHave good relationship with the clients•\tWrite technical specifications for an effective implementation;•\tActing as an adviser and mentor for other less experienced team members, if necessary.Your technical profile:•\tMaster’s degree•\tExcellent understanding of VBA, SQL, ACCESS, EXCEL•\tUnderstand SQL objects (tables, procedures, indexes) •\tC# would be a good plus•\tApplicants should have experience working on important volume of data. •\tTechnical Environment : - EXCEL marcos with VBA - ACCESS with VBA and SQL - C#  - SQL Server database (Microsoft)We will also value:•\tA responsible attitude and ambition in achieving your mission;•\tA good combination of rigor, creativity and communication skills;• Good command of English, both written and spoken with the ability to participate in English-only meetings.• French advanced (written and spoken) - mandatory.•\tEnthusiasm, self-confidence, innovative problem-solving skills.•\tClient orientedBenefits•\tCompetitive remuneration and benefits package, based on qualifications and experience;•\tPossibilities of promotion and development of a career plan;•\tA modern working environment: open, informal, fun and start-up atmosphere;•\tMeal tickets;•\tPrivate health insurance;•\tYearly bonus per company policy;•\tPermanent employment contract.About us ITEC is the IT department of the Investment Bank of Societe Generale, a.k.a. GBIS for Global Banking and Investor Solutions. With 18,000 employees working in 53 countries, GBIS focuses on the needs of Corporates, financial institutions, public sector, family offices or High Net Worth Individuals. It regroups Corporate & Investment Banking, Private Banking, Asset Management and Investor Services.GBIS is a major growth engine for the Group, (see more on https://www.sgcib.com ).What are the key characteristics of ITEC?•\tWe are BIG! ITEC is 7000 people strong worldwide.  •\tWe are global: GBIS is represented in more than 50 countries, but ITEC is concentrated in the major financial places of the planet: Paris, New-York, London, Hong Kong. But in parallel, ITEC has developed a network of operation Hubs like Bangalore, Montreal, and now Bucharest, in order to be more resilient, and more cost effective.•\tWe are complex: the type of business we support is very complex and dynamic. Financial products and solutions embed advanced mathematics and finance concepts, but they also need to be out on the market as fast as possible to beat the competition: Time to Market is key!•\tWe are growing: the investment banking is a very IT intensive business. And as we embark into the “Digital Transformation” journey to create the “Bank of the Future”, IT is becoming more and more a critical/core business partner for the bankers. ITEC represents one third of the overall GBIS staff.ITEC Bucharest operates with Parisian colleagues just like if we were one floor up (or down) in the same tower in Paris, La Defense. We want to be able to create that proximity in the relationship, and the trust and confidence in the connections. Our initial target will be to grow up to a few hundred people in the coming years. This will only be possible if we demonstrate our ability to deliver high quality work. \n\n\n", "title": "VBA and SQL Developer with French", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Engleza, Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-vba-and-sql-developer-with-french/749208/1"}