{"body": "\n\n\n\nThe Company:\r\nMisys is at the forefront of the financial software industry, providing the broadest portfolio of banking, treasury, trading and risk solutions available on the market. With 1,800 customers in 120 countries our team of domain experts and partners has an unparalleled ability to address industry requirements at both a global and local level.\n\r\nThe team \n\r\nMisys Professional Services (PS) team enables the product implementation and maintenance using the best delivery methodologies and business process workflows across the Product Portfolio. The group is formed of Technical and Business experts who engage early in a project lifecycle to translate the product design into technical and business specifications and assure an on-time/ on-budget delivery. \n\r\nTheir early stage involvement in pre-sales activities shape opportunities and ensure consistency of how products are sold and delivered.  The Global Professional Services Team is involved in launching, overseeing, and delivering the company’s major projects. \n\r\nMSDC is a global team in Professional Services department responsible for developing and delivering the offsite tasks to the clients. The team works closely with the regional Professional Services team and clients for the successful delivery of the projects and tasks.\n\r\nThe Role:\n\r\nAs a Junior Fusion Invest/Fusion Capital Summit technical consultant you will participate to development of new Sophis functionalities based on the product toolkit. The functionalities are based on business requirements that come from the client. Integrated in a team under responsibility of a Team Leader, coached by senior consultant, you will work closely with Quality Assurance Team and Professional Services teams across our different centers around the world. Onsite assignements at client site are also possible based on Sophis knowledge.\n\r\nResponsibilities:\n\r\nAs a member of the MSDC team your responsibilities will include but are not limited to:\n\r\n- Develop toolkit extensions based on Fusion Invest product STK or Fusion Capital Summit using C++\r\n- Implement new features as specified in Functional Specification Documents provided by clients\r\n- Respect high level coding and design standards\r\n- Investigate technical and functional defects and propose adequate solutions\n\r\nSkills, Knowledge & Experience\n\r\n- A master degree in computer science or equivalent work experience\r\n- Strong C/C++ skills (including OO and STL)\r\n- Good spoken and written English\r\n- Good Unix or Windows skills would be a plus\r\n- Knowlegde for one the following would be a plus: SQL / Java / QT/ UML skills / Design Patterns \r\n- Minimum experience on a similar position (0-1 year) would be a plus\n\n\r\nThe role reports into the MSDC Team Lead \n\n\n", "title": "Junior C++ Consultant", "company_url": "http://www.bestjobs.ro/firme/misys-banking-systems/1754/1", "career_level": "Entry", "company": "Misys Banking Systems", "locations": "\nSema parc Splaiul Independentei 319, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-junior-c-consultant/751330/1"}