{"body": "\n\n\n\nAs the Front Office RAN Technician You will be responsible for monitoring and first level troubleshooting of all events from the network. Below you will find the list of main responsibilities:\r\n- Network surveillance, 1st level restoration and preventative maintenance\r\n- Monitors, performs troubleshooting, fault acknowledgement and fault analysis\r\n- Work with the application for trouble ticket management\r\n- Maintains the service delivery level within the agreed SLAs\r\n- Follow-up on incidents, registered but not solved, escalated to next level support\r\n- Interprets / understands technical information and prepares technical documentation\r\n- Working independently and within team to keep the competence and skills up to date\r\n- Solves standard problems based on the existing procedures\r\n- Work with the application for trouble ticket management\r\n- Controls and manages complex technical situations/projects in a calm and professional manner (required to provide technical input in technical conference bridges)\r\n- Work in an international environment, with customers and suppliers\r\n- Use effectively telecom knowledge to manage faults and customer demands.\r\nAs the Front Office Technician you will interact with other technicians, customer technical staff and other groups within Service Delivery organization (other Front Office teams, Incident Manager, Back Office, Problem Management, Change Manager, COM, MSIP).Working hours: work on shifts 24x7\r\nIf you have:\r\n- Bachelor’s Degree in Computer Science, Electric/Telecom Engineering, Information Technology or related fields or relevant equivalent experience (2 - 3 years)\r\n- Understanding of 2G-3G-4G telecom networks, network elements, telecom services, MySQL and Linux\r\n- Good knowledge of Microsoft Office suite\r\n- Certifications: Any Certification related to Telecom shall be an added advantage\r\n- Advanced English\r\nYou are ideal candidate. Apply!\r\nAdditionaly if you have: \r\n- Strong communication skills\r\n- Aptitude for quickly learning technical and procedural topics\r\n- Strong analytical and organizational skills\r\n- Self-starter and pro-active\r\n- Strong performance focus\r\n- Self-motivated and works well under pressure\r\n- Excellent team-working skills, stress resistant\r\n- Work independently, keep own competence and skills up to date\r\nIt doubles your chance to be hired!\r\nPlease apply via website or sent me Your CV directly: dorota.gryniuk@ericsson.com with a short note 'Front Office RAN Technician'.\n\n \n\n\n", "title": "Front Office RAN Techician", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Entry, Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-front-office-ran-techician/751046/1"}