{"body": "\n\n\n\nEsti in cautarea unui job part-time, care sa iti ofere posibilitatea de a merge la cursuri? Ai deja un job part-time si doresti sa-ti completezi veniturile? Atunci, job-ul nostru este ceea ce cauti !DIVA HAIR COSMETICS recruteaza Gestionar depozit, program part-time (de luni pana vineri, de la 09.00-15.00).\r\nDescrierea activitatii:\t\t\t\t\t\t\t- organizarea comenzilor din platforma interna de lucru, in functie de prioritatea in livrare;- pregatirea si ambalarea produselor, in vederea livrarii comenzilor catre client;- mentinerea legaturii cu firmele de curierat;- intocmirea documentelor necesare trimiterii coletelor, conform procedurii fiecarei firme de curierat cu care se colaboreaza;- verificarea periodica a expeditiilor;- introducerea comenzilor in platforma interna de lucru;- arhivarea si indosarierea comenzilor, precum si a altor documente;- pregatirea comenzilor de etichete pentru produse;- actualizarea in permanenta a stocului de produse din spatiul de depozitare al firmei si transmiterea cantitatilor existente catre seful direct;- aranjarea si mentinerea repartizarii produselor in spatiul de depozitare alocat, in functie de anumite criterii specifice stabilite de catre seful ierarhic superior.* Activitatea se va desfasura de luni pana vineri, in intervalul 09.00-15.00.\r\nCerinte:\r\n       -   studii medii finalizate ;       - usurinta in comunicare, capacitate de asimilare a informatiilor, adaptabilitate, atentie sporita la detalii, rapiditate in efectuarea sarcinilor;      -    cunostinte operare PC (Windows, Microsoft Word si Excel, Internet);      -    abilitatea de a lucra eficient in conditii de presiune si termene limita.\r\nBeneficii:• salariu atractiv in raport cu volumul de munca;• desfasurarea activitatii in cadrul unei echipe tinere, muncitoare, alaturi de care poti creste profesional.\r\nAsteptam cu mare interes CV-ul tau la adresa de mail: hr@divainteractive.ro !\r\n Mai multe informatii despre Diva Hair Cosmetics puteti afla accesand site-ul nostru: http://www.divahaircosmetics.ro/\n \n\n\n", "title": "Gestionar depozit part-time si full-time!", "company_url": "http://www.bestjobs.ro/firme/diva-interactive/4869537/5", "career_level": "Entry", "company": "Diva Interactive", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-gestionar-depozit-part-time-si-full-time/199979/5"}