{"body": "\n\n\n\nCandidatul ideal:\r\nNu este necesara experiența de muncă în depozit sau autorizatie de a lucra pe echipamentele tehnice din depozit – se va oferi formare completa la locul de munca.\r\nAvem nevoie de cunoasterea limbii engleze la nivel mediu conversational, care este verificat în mod individual pentru fiecare candidat.\n\r\nDin dorința de a vă informa în timpul procesului de recrutare despre detaliile cu privire la ofertele curente va stam la dispozitie de la distanță (on-line sau prin telefon).\n\r\nSunați astăzi la unul din consultanții noștri +40 316 301 619!\n\r\nDescrierea jobului\n\r\nClientii nostri sunt unele dintre cele mai prestigioase companii din sectorul de logistica si distributie in Marea Britanie.\r\nPozitiile disponibile sunt in centre de distributie situate in diferite zone ale tarii.\r\nTRANSLINE GROUP NU PERCEPE NICI UN COMISION SAU TAXA DE ORICE FEL CANDIDATILOR\r\nResponsabilitati:\r\n* Localizarea / Identificarea si transportul produselor de la locatia lor din depozit spre zonele de asamblare a comenzilor (picking)\r\n* Impachetarea comenzilor (packing)\r\n* Primirea / expedierea de bunuri (Goods In/Out - Despatch)\n\r\nBeneficii :\r\nCoordonator de origine romana în Marea Britanie\r\nSemnarea contractului de munca conform normelor britanice,\r\nSprijin managerial permanent pe toata perioada contractuala, \r\nAsistență în completarea formalităților necesare pentru a lucra în Anglia\r\nSalariul variaza de la £ 6.91 la £ 8,92 pe oră, în funcție de locația clientului nostru\n\r\nDescrierea companiei\n\r\nTransline Group o agentie de recrutare britanica specializata in furnizarea de forta de munca, fondată în 1989, în Marea Britanie. Avem birouri în Canada, Thailanda, Polonia, Romania și în special în Anglia, unde suntem prezenti in mai mult de 80 de locații, oferind locuri de muncă pentru peste 15 mii de angajați! Clientii nostri sunt unele dintre cele mai prestigioase companii in sectorul de logistica si distributie, IT, vânzări și lanțuri mari de supermarketuri in Marea Britanie.\n\r\nCandidații interesați ii rugăm să trimita CV-ul pe adresa de email romania@transline.co.uk sau sa aplice la acest post \n\n\n", "title": "Lucrator in centru de distributie", "company_url": "http://www.bestjobs.ro/firme/transline-recruitment-group-s-r-l/14246539/5", "career_level": "Entry", "company": "TRANSLINE RECRUITMENT GROUP S.R.L.", "locations": "\nBrașov, Județul Brașov, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-lucrator-in-centru-de-distributie/211134/5"}