{"body": "\n\n\n\nCompany Summary:\r\nSince 1911, we have been part of society’s progress on five continents … and we’re not done! Our teams bring together some of the most skilled professionals anywhere. People like you, who have the desire to stretch their talents. By joining SNC-Lavalin, you’re seizing the chance to grow with a leader in engineering and construction offering challenges that never cease to inspire. Take this opportunity to go further.\n\r\nSNC Lavalin, a leader in engineering and construction, is actively recruiting the best and the brightest for our shared services centre in Romania. This is your chance to showcase your skills by joining one of our world-class projects teams.\n\r\nGlobal Information Technologies (GIT)\r\nContributes to SNC Lavalin's operational excellence by offering, complete, cost effective and efficient technological solutions for our business units and partners.\n\r\nGlobal Financial Shared Services Centre (GFSSC)\r\nOptimizes and standardizes finance processes and systems to streamline transaction based activities into one centralized location.\n\r\nJob Description:\r\nAs a Financial Systems Analyst, you will be providing support (Level 2) to end users, which comprises trouble shooting problems, resolving system issues and responding to general inquiries.\r\nYou will also participate in designing, testing and documenting new developments in the financial system applications, as well as, assist with month-end and routine maintenance tasks in the system.\r\nThe financial systems analyst will operate through a contact center help-desk as part of a newly created global shared services center.\n\r\nResponsibilities:\r\n- Answer financial support calls (level 2) received from L1 and ensure resolution in a timely manner\r\n- Perform root cause analysis and identify solutions for the problem\r\n- Document test plans for new developments or data fixes in the application\r\n- Prepare training documents to inform end-users of the new functionalities implemented\r\n- Identify areas for improvement in either business processes or the system\r\n- Manage Service Requests with Oracle to resolve issues identified in the application\r\n- Perform certain routine responsibilities such as system configurations, integrity checks and closing modules for month-end\r\n- Contribute to developing a Team-Based culture\n\r\nRequirements:\r\n- Proficiency in English (French is an advantage)\r\n- Bachelor of commerce with major in business technology management or accounting\r\n- Knowledge of the Microsoft Office Suite\r\n- Knowledge of Oracle e-Business Suite would be an asset\r\n- Knowledge of PL/SQL would be an asset\r\n- Excellent oral and written communications skills\r\n- Ability to multi-task in a fast-paced, demanding environment \r\n- Strong analytical skills\r\n- Efficient time management\r\n- Self-motivated, independent and ability to execute with minimum supervision\r\n- Team player\n\r\nAdditional Information:\r\n- Schedule: 11:00 - 20:00 (Monday to Friday)\r\n- Commencement date – as soon as possible\r\n- Only candidates selected for an interview will be contacted\r\n- We are an equal opportunity employer\r\n- The masculine gender is used only to simplify the wording \n\n\n", "title": "Financial Systems Analyst (eBS Knowledge)", "company_url": "http://www.bestjobs.ro/firme/snc-lavalin-romania/12574356/1", "career_level": "Middle", "company": "SNC Lavalin Romania", "locations": "\nDimitrie Pompeiu 5-7, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-financial-systems-analyst-ebs-knowledge/751512/1"}