{"body": "\n\n\n\nDescrierea postului:Compania noastra este interesata de atragerea unui specialist export cu experienta in marketing si vanzari internationale de bunuri industriale in vederea intaririi echipei existente. Responsabilitati: prospectarea pietelor si intocmirea studiilor de piata, contactarea potentialilor clienti,intocmirea/transmiterea ofertelor noastre, primirea si prelucrarea cererilor de oferta, negocierea/incheierea contractelor, centralizarea datelor si lansarea in fabricatie a loturilor de produse, gestionarea stocurilor, intocmirea documentelor aferente exporturilor.Cerinte:1. Licentiat in inginerie (de preferat electrotehnica sau un domeniu inrudit)2. Experienta minima 2 ani in activitati de export produse industriale.3. Limba Germana, fluent (scris, citit, vorbit) si solide cunostinte de operare PC (MS Office, Internet, reprezinta un avantaj cunostintele de operare SAP sau alt ERP ). 4. Buna cunoastere a regulilor comerciale internationale (conditii de livrare, instrumente de plata si garantare a platii, formalitati vamale, etc.) si a modalitatilor si formelor de contractare (din punct de vedere juridic). 5. Capacitate de lucru in echipa si abilitate in intelegerea prioritatilor si interdependentei acestora cu celelalte activitati din cadrul companiei.6. Cunoasterea pietelor Uniunii Europene si/sau a pietelor rasaritene constituie un avantaj.7. Cunoasterea limbii germane constituie un avantaj.Oferta (bonusuri, beneficii): Salariu atractiv si oportunitatea dezvoltarii unei cariere intr-un grup industrial international.Descrierea firmei:ICME ECAB SA are peste 50 de ani de experienta remarcabila in domeniul industiei producatoare de cabluri, atat la nivel national cat si international. Din 1999 pachetul majoritar de actiuni este detinut de HELLENIC CABLES SA, o importanta firma producatoare de cabluri din Grecia, membra a Grupului Industrial VIOHALCO. Compania ofera o gama larga de produse de inalta calitate sub marca inregistrata CABLEL.ICME ECAB SA este localizata in Bucuresti, facilitatile de aici incluzand un complex industrial si un depozit in suprafata de 70.000 metri patrati, situate pe un teren de 268.000 metri patrati. Compania detine de asemenea trei depozite. Un depozit la Cluj, unul la Bacau si unul la Timisoara, iar in conformitate cu planurile de marketing in viitorul apropiat vor fi infiintate si alte puncte de vanzare in orasele principale din tara.Afacerea noastra poate fi rezumata astfel: “Oricine are nevoie de energie electrica, telecomunicatii, transport pe calea ferata si pe apa, are nevoie de cablurile pe care noi le producem si le comercializam“  Interviu Online:1.  Vorbiti limba germana? \n\n\n", "title": "Specialist Export (back office - cu Limba Germana)", "company_url": "http://www.bestjobs.ro/firme/icme-ecab-sa/36925/1", "career_level": "Entry, Middle", "company": "ICME ECAB SA", "locations": "\nDrumul Intre Tarlale 42 Sector 3 Bucuresti, București, Municipiul București, România\n", "languages": " Germana", "url": "http://www.bestjobs.ro/locuri-de-munca-specialist-export-back-office-cu-limba-germana/749812/1"}