{"body": "\n\n\n\nEricsson Overview Ericsson is world’s leading provider of communications technology and services. Our offerings include services, consulting, software and infrastructure within Information and Communications Technology. Using innovation to empower people, business and society, Ericsson is working towards the Networked Society: a world connected in real time that will open up opportunities to create freedom, transform society and drive solutions to some of our planet’s greatest challenges. We are truly a global company, operating across borders in over 180 countries, offering a diverse, performance-driven culture and an innovative and engaging environment. As an Ericsson employee, you will have freedom to think big and the support to turn ideas into achievements. Continuous learning and growth opportunities allow you to acquire the knowledge and skills necessary to progress and reach your career goals. We invite you to join our team. The Front office RAN Technician (Front Office Team Member) is the MSIP appointed responsible for monitoring and first level troubleshooting of all events from the network. The Front office RAN Technician will monitor all the Radio Access alarms and performs the first level troubleshooting within scope of contract and secure that all the alarms are properly handled whilst ensuring customer satisfaction. FO engineer interacts with other technicians, customer technical staff and other groups within Service Delivery organization (other Front Office teams, Incident Manager, Back Office, Problem Management, Change Manager, COM, MSIP).Main activities & Responsibilities •\tNetwork surveillance: 1st level of support and preventative maintenance•\tMonitoring, troubleshooting, fault acknowledgement and analysis•\tTrouble ticket management•\tMaintains the service delivery level within the agreed SLAs•\tFollow-up on incidents, and interact with next level of support.•\tInterprets / understands technical information and prepares technical documentation•\tSolve standard problems based on the existing procedures•\tWork with the application for trouble ticket management•\tControls and manages complex technical situations/projects under pressure calm and professionally •\tWork in an international environment, with customers and suppliers•\tUse effectively telecom knowledge to manage faults and customer demandsRequired competences •\tBachelor’s Degree in Computer Science, Electric/Telecom Engineering, Information Technology or related fields or relevant equivalent experience•\tKnowledge in Telecom Networks, network elements and telecom services•\tPreviews work experience in CORE Circuit Switch/Packet Switch and/or VAS/BSS is a plus•\t1 year experience in a Telecom Environment or relevant field •\tGood knowledge of IT•\tCertifications: Any Certification related to Telecom shall be an added advantageRequired skills •\tFluent in English : conversation and writing•\tSpanish or Italian Skill as a plus•\tStrong communication skills•\tCapacity to learning quickly technical and procedural topics•\tStrong analytical and organizational skills•\tPro-active and team worker•\tStrong performance focus•\tSelf-motivated and well under pressure.•\tExcellent team-working skills and stress resistant•\tWork independently  keeping own competence and skills up to dateWorking hours Work on shifts 24x7. \n\n\n", "title": "Front Office Technician with Spanish or Italian", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Entry, Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza, Spaniola, Italiana", "url": "http://www.bestjobs.ro/locuri-de-munca-front-office-technician-with-spanish-or-italian/750215/1"}