{"body": "\n\n\n\nCandidatul ideal\n\r\nTo perform this job successfully, an individual must be able to perform each basic responsibility satisfactorily and meet education and experience requirements.\r\nEducation and Experience:\r\n- Five to ten years of finance or business management experience required.\r\n- Broad working experience with information systems; understands basic concepts of systems implementation required.\r\n- Knowledge of electronic data interchange technologies (EDI, XML), and Oracle eBusiness applications preferred.\r\n- Supply chain; logistics; or transportation industry experience preferred.\r\n- Fluent English is required. Ability to speak Spanish, French, or German is preferred.\r\n- Proven project management abilities required.\r\n- Ability to multi-task and work in multi-disciplinary teams required.\r\n- Excellent written, verbal, and presentation communication skills required.\n\r\nDescrierea jobului\n\n\n\r\nResponsible for the expansion and execution of freight audit and payment program in Europe, including the development and revision of existing processes, management of third party provider, and integration with the supply chain optimization program and various global and regional mode teams.\r\nBasic Responsibilities and Objectives Include:\r\n• Project leadership including the development of project plans for new or changes to existing audit payment processes.\r\n• Expansion of the audit payment program to include all European business units. Including incorporating changes required to meet regional requirements\r\n• Development and reporting of the necessary budget including monthly updates and annual setting of the budget.\r\n• Works closely with business unit and corporate leadership to identify requirements and develop strategies for the development, implementation, and monitoring of compliance for freight bill audit and payment processes.\r\n• Ensure compliance with internal accounting requirements including industry and legal requirements and standards.\r\n• Reporting and measurement of effectiveness of the audit and payment processes\r\n• Management of the freight audit program’s central funding agent in Cluj, ensuring timely payments to 3rd party provider as directed by Emerson, and proper allocation and receipt of all expenses for business units as part of the monthly freight expense reconciliation activities.\r\n• Management of the internal and external third party(s) to meet the described objectives.\r\n• Reporting to senior management of performance and escalation of critical issues.\n\r\nDescrierea companiei\n\r\nEmerson is a global leader in bringing technology and engineering together to provide innovative solutions for customers in industrial, commercial, and consumer markets around the world. Founded in 1890 in St. Louis, Missouri (USA), Emerson delivers solutions through five business segments: Process Management, Industrial Automation, Network Power, Climate Technologies, and Commercial & Residential Solutions. With sales of $24.7B and more than 130,000 employees in over 150 countries, we have a customer-focused, results-driven culture where employee performance is recognized and rewarded.\n\r\nVisit us at: www.emerson.com\n\n\n \n\n\n", "title": "AUDIT PAY PROJECT LEAD", "company_url": "http://www.bestjobs.ro/firme/emerson-romania/2915814/2", "career_level": "Middle, Senior", "company": "EMERSON ROMANIA", "locations": "\nStrada Emerson, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-audit-pay-project-lead/230833/2"}