{"body": "\n\n\n\nIndustria telecom este intr-o continua schimbare. \n\r\nClientii business isi doresc solutiile cele mai potrivite, care sa ii ajute sa isi extinda afacerea, sa optimize costurile si care sa le asigure securitatea afacerii oricand si oriunde.\n\r\nVodafone, cel mai important brand din piata B2B, cu cea mai extinsa arie de acoperire si cu o retea calitativa, isi propune sa vina in intampinarea clientilor cu cele mai avansate produse si servicii, alaturi de cea mai buna echipa de vanzatori.\n\r\nA lucra pentru Vodafone inseamna : pasiune, implicare, dorinta de a te dezvolta permanent si de a fi parte activa din business-ul clientului.\n\r\nDe ce Vodafone?\n\r\nTe vei dezvolta permanent prin programe de training personalizate.\r\nO echipa de suport care iti este alaturi oricand\r\nUn pachet financiar motivant\r\nProgram flexibil\n\r\nCe vei face in rolul de Account Manager Vodafone?\n\r\nTe vei ocupa de achizitia noilor clienti prin semnarea de parteneriate pe termen lung cu clienti business.\r\nTe vei implica in dezvoltarea conturilor Mari si Medii cu caracter dual din baza Vodafone.\r\nVei vinde solutii de afaceri potrivite conditiilor de piata si obiectivelor companiei prin abordare de vanzare consultativa  si proactiva \r\nVei creste profitabilitatea clientilor prin angajamente pe termen lung in cadrul segmentului deservit\r\nVei identifica oportunitati de business prin invatarea si intelegerea nevoilor de comunicatii si de afaceri ale clientilor\r\nTe asiguri de dezvoltarea celor mai bune solutii pentru clienti prin coordonarea eficienta a resurselor interne\n\r\nProfil ideal:\n\r\nOrientat catre  nevoile clientului : intelege ceea ce determina satisfactia clientului, arata flexibilitate in adaptarea planurilor de actiune cerintelor pietei\r\nRecunoaste valoarea potentiala a diferitelor perspective si construieste bazat pe ele; anticipeaza obstacole si gandeste in perspectiva asupra posibililor pasi urmatori\r\nComunica asertiv: are abilitatea de a recunoaste factorii de decizie si influenta; construieste relatii eficiente, inauntrul si in afara companiei\n\r\nSpecificatii personale:\n\r\nDiploma universitara\r\nDezvoltare profesionala: Cursuri  de pregatire , preferabil de vanzari\r\nPermis de conducere: categoria B\r\nLimba engleza- nivel avansat\n\n\r\nExperienta profesionala: \n\r\nMin 2 ani experienta in achizitie de conturi in vanzari directe (Telecom, FMCG, de preferat IT&C) sau 1-2 ani experienta in vanzari directe clienti persoane juridice\n\r\nAlte Informatii:\n\r\nJobul este locat in Bucuresti\r\nSe calatoreste des in zonele limitrofe\n\r\nTe invitam sa faci parte din echipa de vanzari Vodafone!\n \n\n\n", "title": "Account Manager,  Achizitie conturi Corporate", "company_url": "http://www.bestjobs.ro/firme/vodafone-romania/2935259/2", "career_level": "Middle", "company": "Vodafone Romania", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-account-manager-achizitie-conturi-corporate/230719/2"}