{"body": "\n\n\n\nSofting is a successful, independent provider of hardware and software for industrial automation and automotive electronics. SoftingRom has been founded early in 2005 as an R&D center of Softing AG Munich, with offices both in Cluj-Napoca and Miercurea-Ciuc. \r\nWe’re having now a new open Scrum Master position in Cluj-Napoca. Softing Industrial Automation employs Agile and Scrum as key paradigms for successfully deliver customer satisfaction in project/product development.This is strongly emphasized in the strategic goal to become an Agile organization and reflected in its internally defined processes.\r\nScrum Master is an important role in these processes, therefore we believe it can be optimally performed by full-time dedicated professionals with constant care to encourage, facilitate, learn&share, protect, reflect and reward.\r\nMain responsibilities\r\nStrongly serving and supporting the Product Owner and Development Team\r\nProviding all support to the team using a servant leadership style and leading by exampleGuiding and coaching the Scrum Team and organization on how to use/improve Agile/Scrum practices and valuesGuiding and coaching both the Scrum Team on how to get the most out of self-organizationFollowing the internally documented or approving Agile based software development processesRemoving impediments or guiding the team to remove impediments by finding the right pathsBuilding a trusted and safe environment where problems are raised and solved proactively without fear of blameHelping in getting the work done without coercion, assigning or dictating the work Facilitating discussion, decision making and conflict resolutionAssisting with internal and external communication, improving transparency and information flowSupporting and educating the Product Owner, especially with respect to refining and managing the product backlog.\r\nRequired skills/Experience\r\nScrum Master certification (ideal)\r\nAt least one year experience playing the Scrum Master role for a development teamGood skills and knowledge of servant leadership, facilitation, situational awareness, conflict resolution, continuous improvement, empowerment, increasing processes transparency \r\nKnowledge and/or experience with Agile techniques: UserStories, Continuous Integration, Continuous Testing, Burndown, Velocity, Retrospective formats etc.\r\nHandling meetingsExcellent communication and mentoring skillsEnglish language (both reading and writing) \r\nWould be a plus \r\nTechnical background in software developmentExperience with a variety of contexts: being in multiple scrum teams, different team sizes, different organizations and cultures, distributed teams etc.A tracked record of continued and recent education in Scrum, including training, self-study, conferences etc.Knowledge of other approaches discussed in the Agile space: XP, Kanban, Feature Driven Development etc.\r\n What you could benefit of\r\nAttractive salary, medical services, fidelity bonus, lunch ticketsHighly qualified teamComprehensive technical trainings on our expertise areaPositive and informal working environmentChallenging projects for well-known customers in the industryThe opportunity to actively contribute at the design and success of our solutions \r\nIf this sounds interesting for you, please send your CV (in English/Romanian language) at jobs_ro@softing.com and let's talk more about this role, about the projects and about our great team.\n \n\n\n", "title": "Scrum Master", "company_url": "http://www.bestjobs.ro/firme/softingrom/1119941/1", "career_level": "Middle, Senior", "company": "SOFTINGROM", "locations": "\nBuftea 1, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-scrum-master/752394/1"}