{"body": "\n\n\n\nWe are looking for a PHP/JavaScript Code MagicianOverviewYou will be part of a chosen few that will have the opportunity to work on some of the biggest projects in the market. Also, we’ve built over the years a work environment that provides our employees the X factor for coming to work. Do you have what it takes?What things are mandatory to knowPHP OOP – You will need to be able to write clean and maintainable code. You should know what classes, interfaces, abstractions, inheritance, polymorphism are. If you don’t have any experience with OOP programming, maybe you should reconsider applying for this.JavaScript OOP – Wait, what ??? JavaScript and OOP in the same sentence ? Well…yes. Most of our projects take JavaScript to the next level and you must be able to handle that.MySQL – No point of knowing a programming language without knowing how to persist data, right?$PASSWORD = [83,79,76,73,68]; // hmmm…. maybe there’s more to thisIf you miss some of the requirements above, don’t worry. Take your time to study really hard and get back to us. We are always looking.What things would take your name out of the crowdExperience with a PHP MVC framework – Preferably Laravel or SymfonyExperience with a Javascript framework – of your choiceExperience with a CSS framework – of your choiceExperience with Big Data – as in BIG, REALLY BIGGithub / Bitbucket Profile – We respect your time for giving back to the community. TDD You should know that …We are part of the elite. There are a few places around the world where you would meet the technologies that we are using. Our work environment is custom tailored for your needs, and our colleagues are hand picked from the best of the best. Working with us will most probably change your life for the better. Still interested to apply?A sneak preview of some of our benefits•\tInteresting and challenging projects;•\tState of the art technologies•\tPrivate medical insurance•\tMonthly Team Building activities•\tYearly Team Building activities•\tPossibility to travel abroad•\tWorking for one of the online industry leaders•\tAn open, not corporate, environment to share and promote your ideas•\tOpportunity to attend trainings, conferences, congresses, etc.•\tInfinite Fruits Coffee and Tee•\tA whole lot of good times.We hope to see you soon! \n\n\n", "title": "PHP/JavaScript Code Magician", "company_url": "http://www.bestjobs.ro/firme/pionix-marketing-solutions-srl/13477364/5", "career_level": "Middle, Senior", "company": "Pionix Marketing Solutions SRL", "locations": "\nDelea Veche 24, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-php-javascript-code-magician/201388/5"}