{"body": "\n\n\n\nDe ce sa ni te alaturi?JYSK este o companie foarte puternica pe piata din Europa, avand stabilitate financiara, si care aprecieaza si recompenseaza efortul si rezultatele obtinute in vanzari. Clientii nostri aprecieaza serviciile competente oferite, cat si ofertele excelente. Ca si asistent de vanzari, tu esti persoana potrivita pentru a i le oferi clientului.Ce vei face in fiecare zi?• Tu esti legatura noastra cu clientii si ii intampini mereu cu zambetul pe fata• Saluti intotdeauna si arati interes fata de nevoile clientilor•Scanezi corect si rapid produsele clientilor•Incasezi banii pe aceste produse asigurandu-te intotdeauna ca ai lucrat corect.• Promovezi produsele noastre, avand grija ca acestea sa fie intotdeauna disponibile, cu preturile corect afisate, crescand astfel vanzarile si satisfactia clientilor• Esti un membru important al unei echipe mereu in miscare, si te implici intr-o multitudine de activitati, de la primire marfa pana la curatenie si aranjarea produselorCum poti face diferenta in fiecare zi?• Oferi servicii de calitate clientilor nostri • Esti intotdeauna disponibil pentru clienti si ii intampini cu o atitudine profesionala• Nu te sperie mai multi clienti care au nevoie de ajutorul tau. Dimpotriva, gasesti ca un astfel de mediu dinamic te motiveaza.• Iti place sa vinzi si sa tratezi fiecare client in mod individual. Incerci sa le oferi servicii competente oferindu-le un pachet de produse adaptat nevoilor fiecaruia.• Iti place sa vinzi alaturi de colegii tai. O zi buna inseamna pentru tine sa stii ca ai avut clienti satisfacuti, cifre excelente de vanzari si ca te-ai simtit bine la locul de munca.Esti interesat? Atunci te rugam sa trimiti CV-ul tau.Experienta NU e necesara.Numai candidatii selectati vor fi contactati. \n\n\n", "title": "Asistent Vanzari JYSK in Bucuresti Militari", "company_url": "http://www.bestjobs.ro/firme/jysk-romania-srl/10588081/5", "career_level": "Entry, Middle", "company": "JYSK Romania SRL", "locations": "\nBd iuliu maniu nr 560, București, Municipiul București, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-asistent-vanzari-jysk-in-bucuresti-militari/201358/5"}