{"body": "\n\n\n\nNew project for insurance Industry! Software developers wanted – all levels of experience!For this new project we are creating a team of developers for the implementation of Guidewire Insurance Suite - a set of applications that support insurance operations: underwriting, policy administration, billing, and claims management.Based on your experience and motivation, you will have the chance to learn new technologies, programming languages, lead a team and obtain certifications.Guidewire software is built using a similar language to java, called ‘Gosu’, that is easy to learn, retains all the strengths of Java but has strictly fewer weaknesses.Why learn Gosu? Why is it used for Guidewire?- statically typed,- dynamically compilable, - metaprogramming capabilities,- fairly simple syntax - easy learning-curve What we need from you: - Willingness to learn a new programming language- Fluent English and German - IT-oriented education/University degree- Availability to travel in Europe (mainly Switzerland) occasionally- Software development experience- Knowledge in state-of-the-art programming platform (Java SE preferred. Alternatively .NET/C# or Objective-C)- UI-Design with Widgets (arbitrary framework)- XML - Software development processes (Agile preferred)- Version control systems (e.g. Git, SVN, CVS)- SQL and Relational databases (e.g. DB2, Oracle DB, SQLServer or MySQL)- IDEs (e.g. Eclipse, IntelliJ IDEA or NetBeans)Other skills or competencies preferred: - Insurance expertise- Java Enterprise Edition JavaEE- Messaging and RPC (WebServices, message queues)- Transaction handling- HTML 5 & AJAX frameworksYour Role:Support Guidewire implementations (entire Guidewire Insurance Suite; including policy, claims and contact management as well as billing systems).Enhance the data model, dialogues, process flows, business rules and logic, database queries as well as interfaces to internal and external systems. About our team:Part Mentor, part architect, part developer, part subject matter expert in the insurance industry, our small team of consultants on each project help our customers adapt to change and embrace new ways of innovating their business operations. Titles are not as important to us as the quality of the people we work with and the opportunity to be productive. We strive to constantly improve our development process, and collaborate to create and maintain the greatest enterprise software suite in the Property and Casualty Insurance industry.What we are looking for in our new colleagues:• Curiosity based on genuine love of technology and solving tough technical problems• Accountability based on an earnest desire to do what is expected without prompting• Kindness and respect for your fellow teammates. We truly do want to build teams that like to work together so we do hire team players who are motivated to be courteous and productiveYou will be helping make our customer’s lives easier and their businesses more efficient as they adopt the Guidewire solution, as each customer has their own configuration and integration needs.Our customers are insurance companies, and insurance software is surprisingly complex, difficult to get right, and actually a lot of fun to work on. Demand for the Guidewire software is on the rise, and we are growing to meet the needs of the market. \n\n\n", "title": "Software Developer (JAVA / C#) with German", "company_url": "http://www.bestjobs.ro/firme/bearingpoint-srl/3412395/2", "career_level": "Entry, Middle", "company": "BEARINGPOINT SRL", "locations": "\nStr. Constantin Brâncuși Nr. 7, Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-software-developer-java-c-with-german/230122/2"}