{"body": "\n\n\n\nStudio 20 este unul dintre cele mai apreciate si respectate studiouri la nivel mondial. Calitatea muncii noastre a fost rasplatita cu mai multe premii internationale dintre care amintim cele mai recente:\r\n- Best Live Cam Studio (YNOT Awards, Praga, septembrie 2015)\r\n- Best Emerging Studio (AW Awards, Mamaia, iunie 2015)\r\n- Studio of The Year 2015 si 2016 (GFY Awards, Las Vegas, ianuarie 2015 si din nou in ianuarie 2016). \r\nActivitatea noastra a fost prezentata de presa de business din Romania, cu cifre reale, ca un exemplu de profesionalism si experienta in acest domeniu. Modele faimoase precum Devious Angel, Emma Wild, Raquelle Diva, Sasha Red sau Zeya Brunette au primit de asemnea premii internationale la Barcelona, Praga si Las Vegas, dovedind ca stim si putem sa crestem modele de succes, care castiga peste 10.000$ lunar.\r\nDincolo de premii, suntem o echipa extrem de simpatica si atenta, un loc de munca placut, de care te vei atasa. Lucram 100% legal si avem peste 15 ani de experienta in Romania (am inceput in anul 2001). Cele mai mari situri din lume ne mentioneaza oficial ca parteneri preferati si sunt alaturi de modelele care lucreaza la noi pentru a le ajuta sa reuseasca.\r\nLucram intr-o atmosfera serioasa dar relaxata, oferim ajutor cu machiajul, haine, training, cursuri gratuite de limba engleza, tot ce iti trebuie pentru a face cat mai multi bani. Programul de lucru este flexibil, excelent pentru studente, dar si pentru absolvente. Oferim training si suport pentru primele 2-3 luni si chiat mai mult, salariu, bonusuri si avansuri cand ai nevoie, conditii excelente de lucru, tehnice si estetice. Suntem o firma serioasa, care punem accent pe seriozitate si profesionalism, avand rezultate excelente pentru colegele care isi doresc un job serios, sunt ambitioase si vor sa reuseasca. \r\nActivitatea de live cam model, model online sau hostess online consta in discutii prin chat text, audio si video, in limba engleza, cu persoane majoritar de sex masculin din Statele Unite ale Americii. Studio 20 este 100% feminin, pentru a asigura un mediu de lucru relaxat si constructiv. \r\nIn acest moment avem deschise in Bucuresti 2 studiouri, primul langa Gara de Nord si al doilea in Piata Victoriei, cel mai mare studio din Romania ca suprafata ocupata, dotat cu echipamente de ultima generatie, camere cu design variat, spatii de relaxare si make-up, dupa cum puteti vedea aici http://www.studio-20.ro/locatii/studio-videochat-bucuresti-victoriei.html si in Cluj-Napoca primul studio profesional din zona: http://www.studio-20.ro/locatii/studio-cluj-napoca.html\r\nPe 15 februarie vom lansa si studioul din Timisoara.\n\r\nCerinte pentru angajare: Seriozitate, varsta 18-35 de ani, limba engleza scris si vorbit de la mediu in sus, placerea de a comunica cu oamenii si mai ales ambitie. \r\nOferta (bonusuri, beneficii):\r\n- Venitul mediu este de 2.500$ lunar, dar poti castiga si de 3-4 ori mai mult, depinde numai de ambitia ta, spre deosebire de alte studiouri noi nu promitem, noi te invitam sa stai de vorba cu modelele care deja castiga acesti bani alaturi de noi,\n\r\n- Contract legal, toate platile sunt pe acte (nu lucram absolut deloc la negru sau la gri);\r\n- Mediu de lucru placut, bazat pe RESPECT si AJUTOR reciproc;\r\n- Ajutor la cazare in Bucuresti sau Cluj pentru modelele care se muta din alte orase;\r\n- Corectitudine si sinceritate, atat de rare in mediul de afaceri din Romania si totusi atat de importante pentru o colaborare pe termen lung.\r\nIntra pe pe www.studio-20.ro pentru mai multe informatii sau vino in vizita sa ne cunoastem, fie ca vrei un job de hostess / model / operator / PR  sau un job in echipa de suport: asistenta, call center, traducator, secretara, manager, trainer, suport, vanzari, HR, call-center, operator pc, traducator engleza, assistent manager, social media, marketing, online marketing, copywriter, etc.  Interviu Online:1.  Intre ce ore doriti sa fiti contactata pentru stabilirea unui interviu?2.  De ce ati ales Studio 20? \n\n\n", "title": "HOSTESS MODEL PR ONLINE Bucuresti,  Cluj - 2.500$", "company_url": "http://www.bestjobs.ro/firme/studio-20/11771232/1", "career_level": "Entry", "company": "Studio 20", "locations": "\nCalea Victoriei nr. 155, București, Municipiul București, România;Intrarea Doinei 19-21, Timișoara, Județul Timiș, România;LOUIS PASTEUR 24, Cluj-Napoca, Județul Cluj, România;Strada Atelierului nr. 20, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-hostess-model-pr-online-bucuresti-cluj-2-500/751093/1"}