{"body": "\n\n\n\nJob Summary\n\r\nThis Job Role is responsible for the coordination, management and execution of proactive and reactive maintenance activities that require a higher level of support that the one offered by the 1st Level Operations. This shall ensure that the services provided to customers are continuously available and performing to Service Level Agreement (SLA) performance levels.\n\n\r\nRESPONSIBILITIES\n\r\n    Manage Incidents 24x7 and ensure minimal disruption to the service and fast service restoration\r\n    Act as a center focal point for all departments during incidents and coordinate between them to get the fast results\r\n    Ensure an Action plan / Back Up Plan is created and focused on the restoration within SLA\r\n    Ensure timely communication / information flow towards internal & external stakeholders\r\n    Ensure that all required resources (resources, accounts, equipment) are available and up to date.\r\n    Setting up of Technical & Management Bridge to facilitate communication during incidents.\r\n    Manage and coordinate the escalated requests from MSIP OA, COM and internal stakeholders.\r\n    Deliver accurate post incident reports within the agreed OLAs.\r\n    Contribute to and maintain the existing repositories (Eridoc, EriColl), with up to date technical documents, network diagrams, team structures, important OPI/procedures that show process adherence.\r\n    Attend the required trainings and courses (technical and soft skills) to increase the current competence level.\r\n    Promote Problem Management activities in 1st and 2nd level Assurance. Provide input and support the Problem Manager during initial investigations for root cause analysis.\r\n    Ensure all ongoing activities are published in the Hand Over tool or any other dedicated tools that have this functionality. Provide accurate input for the Shift Reports.\r\n    Implement and follow Ericsson compliant Business Continuity procedures and special events contingency plans.\r\n    Attend to operational or governance meetings with COM, SL, PM, MSIP OA and the TCs from the other teams.\n\n\r\nCOMPETENCE PROFILE\n\r\n    Minimum of 2 years’ experience from Telecom or IT Industry. Previous IM experience in similar positions it’s a plus.\r\n    The candidate should have knowledge of ITIL, eTOM or other industry practices related to Service Management and Lifecycle.\r\n    The candidate should have knowledge of the WLA (Working Level Agreement) to be used for the specific customers.\r\n    The candidate should show strong sense of urgency and take responsibility and be able to work under pressure.\r\n    The candidate should have strong skills in leadership and communication\r\n    The candidate should have knowledge of Ericsson: BSS, Service Layer, Core, Access – Service views and other vendors equipment where applicable\r\n    The candidate should have high level Network Topology skills (GSM, WCDMA, LTE, IT, etc).\r\n    The candidate should have knowledge of Infrastructure and customer tools connected to delivery.\r\n    Availability to travel abroad.\n\r\nEDUCATION\n\r\n    Bachelor of Science degree in Telecommunications, Computer Information Systems or equivalent with minimum of 2 years of work experience. \n\r\nLANGUAGE\n\r\n    Fluent in written and spoken French and English\n\r\nINTERPERSONAL SKILLS\n\r\n    Result oriented\r\n    Good skills in interpersonal communication\r\n    Developed skills in knowledge sharing by actively contributing knowledge\r\n    True customer mindset\r\n    Strong analytical and organizational skills\r\n    Ability to learn quickly\r\n    Ability to work under strong pressure related to scale of business impact\r\n    Flexible and responsive to changing work patterns and demands\n \n\n\n", "title": "Incident Manager with French", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nBucharest, Bucharest, Romania\n", "url": "http://www.bestjobs.ro/locuri-de-munca-incident-manager-with-french/752234/1"}