{"body": "\n\n\n\nSalary range: 2500 – 4000 euro net monthly salary (depending on experience) \n\r\nJob Description\n\r\nWe are working with a number of successful multinational and start-up companies based in Ireland in the travel industry, technology, financial services, payments, security and big data analytics areas. They are looking to hire multiple Java Software Engineers at various levels for innovative projects.\n\r\nThese are excellent opportunities for Java Software Engineers interested in relocating to Dublin. Not convinced if Dublin is the right place for you? They say it’s “the Silicon Valley of Europe” – the opportunities in technology are amazing here with great career progression plans inside the companies.\n\r\nWhat is the ideal experience you need for this role?\n\r\n-\tStrong Java Development skills;\r\n-\tBachelor’s degree in Computer Science, Informatics or similar subjects;  \r\n-\tAt least 2 years experience with J2EE, JEE, etc.\r\n-\tFluency in English is mandatory;\r\n-\tKnowledge of Spring, Hibernate is an advantage, but not mandatory;\r\n-\tKnowledge of data structures and algorithms would be a plus;\r\n-\tKnowledge of SOAP and REST web services is an advantage, but not mandatory;\r\n-\tKnowledge of big data technologies( Cassandra, Hadoop, NoSQL, AKKA, Spark, etc.) is a plus;\r\n-\tGood communication skills;\r\n-\tPassionate and with a strong interest in technology.\n\r\nIf you want more details I want to hear from you so contact Irina Moisescu confidentially on +353 86 1302 215  or email your CV to Irina.Moisescu@e-frontiers.ie\n \n\n\n", "title": "Senior Java Software Engineers – Ireland", "company_url": "http://www.bestjobs.ro/firme/e-frontiers-ltd/14272806/5", "career_level": "Middle, Senior", "company": "e-Frontiers Ltd", "locations": "\nBudapesta, Budapesta, Ungaria;Varşovia, Voievodatul Mazovia, Polonia;Brașov, Județul Brașov, România;București, Municipiul București, România;Cluj-Napoca, Județul Cluj, România;Constanța, Județul Constanța, România;Dublin, Dublin, Irlanda;Galați, Județul Galați, România;Iași, Județul Iași, România;Sibiu, Județul Sibiu, România;Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-java-software-engineers-ireland/209412/5"}