{"body": "\n\n\n\nSmartx Net Apps provides Internet development services to a group of customers that run some of the largest, most successful websites in the world. One of our main projects consists in maintaining and developing a website visited daily by 5-6'000'000 unique users (among top 300 in the world traffic-wise).Our challenges consist in maintaining high uptime availability, deliver in a fast-paced environment key features for product growth while at the same time keeping an engineering culture based on code-reviews, unit-tests and high hiring standards.\r\nWhat we're looking for:In order to become our colleague, you should be a real team player, flexible and highly responsible.You will have international exposure, so you should be comfortable in English (spoken and written).Problem solving skills and attention to detail are highly appreciated as well.Required knowledge and experience:> Experience supporting Linux Systems (at least 6 years);> University degree in computer science;> Red Hat System Administration II exam RHCSA certification;> Strong experience with CentOS, RHEL or Debian;> Strong experience with Virtualization environments;>Good experience with high availability and failover clustering from different perspectives (OS, application, hardware);> Experience troubleshooting application servers (at least one from Tomcat, Jboss or Glassfish);> Experience supporting JAVA based environments;> Experience debugging network problems;> MySQL database experience would be a plus;> Good experience writing scripts in Bash, PERL, PYTHON or PHP;> Familiar with capacity planning;> Experience with system performance monitoring and tuning;> Familiar with service transition and service operation (preferable).\r\nWhat you should do:> Consult on new system requirements and be part in architectural design phase;> Research and recommend technologies and tools for systems administration tasks;> Guide less experienced members of the team;> Work closely with development and testing teams to ensure the smooth launch of new code updates or additions;> Install and document new systems and application servers;> Operate, update, maintain and monitor environments on a daily basis;> Define, improve, document standard operational procedures where needed;> Troubleshoot environments and correct issues;> Perform periodic reporting of performance and tuning actions for assigned systems;> Write automation and monitoring scripts.\r\nWe compensate your achievements and commitment with:> Very competitive salary;> Private medical plan - Business Plan at MedLife Clinic;> Meal vouchers and well-stocked micro-kitchen in the office;> Performance reviews and compensation based on your results, performance based bonus structure;> Trainings and career development programs – in the country and abroad;> Company events.\r\nWe value our staff by investing in their health and good employment practices. We offer a creative workplace and a flat organization, focused on teamwork, product quality, dynamic and fun atmosphere. We have a very nice and comfortable downtown office, with a break area, outside space, fruits and different daily snacks. Flexible working hours are to support work-life balance.If this sounds appealing, join our team by submitting your CV in English to hr@smart-x.netThank you!\n \n\n\n", "title": "Lead System Engineer", "company_url": "http://www.bestjobs.ro/firme/smartx-net-apps/13186552/1", "career_level": "Senior", "company": "SMARTX NET APPS", "locations": "\nStr. Maria Rosetti nr. 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-lead-system-engineer/748901/1"}