{"body": "\n\n\n\nIn 2005 JYSK entered the Bulgarian market and in 2007 in the Romanian market with a lot of great offers. Now, in 2016, JYSK decided to become one of the market leaders in Romania and Bulgaria in home related products.\n\r\nJYSK is known for being down to earth. We work together efficiently and well to give our customers the best experience possible. Through employee development and training we ensure that our employees are the best within retailing.\n\r\nTo secure the success we want to set the best team and here is your big chance!\n\r\nFor our headquarters in Bucharest we need a Sales and Marketing Assistant - Bulgarian native Speaker to work with various tasks within retailing, sales and marketing for the Bulgarian Operations.\n\r\nYour main tasks will be:\n\r\n-      Support for the Marketing department in Denmark;\r\n-      Creating and updating the system database for Bulgaria (translation of articles description, term database, etc.);\r\n-      Participate in creating the campaign paper for Bulgaria;\r\n-      Participate in the creation of signs/banners, opening campaign papers and translation of the marketing material for the stores in Bulgaria;\r\n-      Translations in and from English language of various articles, campaign messages etc;\r\n-      Participate in the creation of newsletters/web materials;\r\n-      Ensure that JYSK concepts are implemented and followed (e.g. sales strategy, graphic guidelines, use of savings messages) in all campaign activities in Bulgaria;\n\r\nYou can expect:\r\nTo be a part of supporting and contributing to the process of preparing commercial leaflets;\r\nA job characterized by variant tasks but also routine work;\r\nPersonal development and a varied working environment in an international organisation;\r\nSome travelling activity, but the job is located in Bucharest.\n\r\n We expect you to:\n\r\nBe fluent in English and a native Bulgarian; written as well as spoken;\r\nBe service minded with an eye for the details;\r\nBe flexible and able to keep deadlines;\r\nTo have completed higher education.\n\r\nYour background is not important as long as you are a team player who wants to be a part of the JYSK success.\r\nYou will be given a thorough introduction so that you will be able to find your way quickly.\r\nExperience with SAP is an advantage but not a requirement.\n\r\nInterested?\r\nJust send your CV and application letter until 7th of March. \n\n\n", "title": "Sales & Marketing Assistant - native Bulgarian", "company_url": "http://www.bestjobs.ro/firme/jysk-romania-srl/10588081/5", "career_level": "Entry, Middle", "company": "JYSK Romania SRL", "locations": "\nBulevardul Iuliu Maniu Nr. 560A, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-sales-marketing-assistant-native-bulgarian/211059/5"}