{"body": "\n\n\n\nJob description\n\r\nThe Telecom Invoice Analyst has to make sure that all the customer invoices are properly imported in the Asentinel application and that the templates of the invoices are updated when needed.\n\r\nThe person who qualifies for this job:\r\n-Operates Asentinel software for balancing/correcting/scanning/importing EDI (Electronic Data Interchange) or paper invoices that failed the automated import process.\r\n-Develops invoice Templates and add new Vendors\r\n-Solves application issues opened by customers, operating a ticketing application\r\n-Communicate with US mother company/clients in English.\n\n\r\n-Job location: Asentinel Office, Bucharest, Romania.(Crangasi, Podul Ciurel)\r\n-Full Time position-8h/Part time-6h\n\r\nRequirements:\r\n-High school graduated (profile informatics or economics is an advantage);\r\n-Student or graduated technical profile is a plus;\r\n-Proficient in English;\r\n-General computer operation skills: Windows, Internet etc. \r\n-Proficiency in programs, such as: Excel, Word, Outlook\r\n-SQL, XML and other programming knowledge are a plus.\r\n-Telecom experience would be highly appreciated;\r\n-Reliable and punctual;\r\n-The candidate must keep confidentiality about the information they are working with;\r\n-The candidate must send their CV or resumes written in English, pointing out their skills and knowledge.Do not use Asentinel site to send your CV, this being used only for recruitment in US!!\n\n\r\nAdvantages and benefits:\r\n- Permanent Labor Contract, motivating salary based on skills and performance ( yearly evaluation)\r\n- Good opportunity to develop a career within a stable multinational environment\r\n- American standard, non-stressful working conditions, excellent green environment, free parking space\r\n- American management and company culture\r\n- Medical Insurance, Meal tickets\r\n- Monthly Parties, Halloween Party, Christmas Party and other recreational activities\n \n\n\n", "title": "Telecom Invoice Analyst", "company_url": "http://www.bestjobs.ro/firme/asentinel-international-srl/2845216/2", "career_level": "Entry", "company": "Asentinel International SRL", "locations": "\nStrada Aleea Lacul Morii Nr.3 Sector 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-telecom-invoice-analyst/231128/2"}