{"body": "\n\n\n\nAre you a passionate seller? Do you like being in touch with the technology and learn from the best? Do you want to take the selling process to the next level? Here's your answer:The Orange SOHO&SME Sales Team is looking for a new colleague to fill in the position of Business Sales Representative located in Satu Mare, Bistrita and Alba Iulia!Satu Mare, Bistrita : hunting position. You will be responsible for SOHO&SME new contracts acquisition in the allocated region.Alba Iulia: farming position. Your main activity is to maintain business relationships with Orange clients in the post-sales activity. Job purposeReaching and exceeding sales objectives proposed for SOHO&SME segments. Maintaining business relationships with Orange clients in the post-sale activity.Responsibilities:- promotes and sells Orange services and products dedicated to SOHO&SME segments by identifying the needs of clients and advising them- secures the existing customer base through proactive & reactive retention activities- signs contracts for subscription services and activating on-line services sold- empowered to sign commercial contracts, Orange contract subscription service (voice service and data service), additional papers / attachments / special offers to the Orange subscription service- provides support regarding the use of services and products sold and deals with post-sale relationship maintenance (maintains and retains business customers)- participates in training for new employees of the SOHO&SME department and offers support to Dealers Business Sales Representative at direct superior's special request- actively participates in sales growth resultsCandidate profileExperience and education:- University graduated- at least 2 years’ experience in Direct Sales or Retail (telecom preferably)- proven record in market prospecting and closing commercial deals in time vs target- clean driving license - minimum 1 year experienceWork-based competencies:- advanced sales skills- new prospects & acquisition- good handling of handsets- fluency in English- MS Office- B-to-B sales techniques- selling in a Business environmentBehavioral competencies:- customer focus- drive for results- problem solving- commercial awareness- business-oriented activityType of contract: 1 year determined period with prolongation possibilities, leased contract.Thank you for applying to Orange! \n\n\n", "title": "Business Sales Representative", "company_url": "http://www.bestjobs.ro/firme/orange-romania-sa/885505/1", "career_level": "Middle, Senior", "company": "Orange Romania SA", "locations": "\nAlba Iulia, Județul Alba, România;Satu Mare, Județul Satu Mare, România;Bistrița, Județul Bistrița-Năsăud, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-business-sales-representative/749360/1"}