{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a longterm basis, offering at the same time a wide variety of features such asexpertise, challenging development opportunities in an international environmentand the joy of a strong spirit.\r\nResponsibilities:\r\n•\tDevelop and implement a structured way of working/ communication plan to support smooth transition and adoption of to-be operating model, to ensure changes are effectively communicated to all business stakeholders and impacted employees.•\tCompleting a detailed stakeholder analysis to identify people impacted by and/or able to influence local country business change; manage relationship with Project Sponsor and Steering Group•\tManage/ Engaging with business analysts to complete the change impact analysis related to the changing processes and ways of working•\tResponsible for the coordination of wider transition teams involving all respective project resources, i.e. Core Team, Work stream and SSC leaders, internal technical resource, transition team members and local stakeholders.•\tDeliver all Service Transition Projects and Programs in line with SG methodology (driving internal and external project teams and operational teams to achieve planning, execution, monitoring and control of project plans). •\tEnsure proper project scope, financial measures, project planning, communication, resources, results and overall project quality•\tEnsure transitions milestones are timely reached. Effectively manage the stakeholders. Monitor the transition, ensuring issues are resolved in a timely manner and appropriate corrective actions are implemented. •\tAdhere to relevant escalation processes to escalate resource issues, delayed project phases, missed deadlines and other planning issues. Ensuring that effective and efficient controls around the risks of introducing organizational  changes are in place•\tSupport Customer’s in all communication activities including ad hoc interventions•\tProviding change management and stakeholder management support to peers in the Deployment team•\tProviding guidance to country teams on how to drive faster adoption and greater utilisation of the changes delivering greatest business benefits•\tReview the outcomes of the Transition Projects to determine any corrective actions that could be taken to improve future delivery in terms of efficiency, effectiveness and internal customer satisfaction•\tDrive identification and prioritization of service improvement activities and the recommendation and implementation of solutions. Support governance meetings for process management according to lean methodology. Drive ROI for improvement activities including built of business cases for significant initiatives. Coach/lead virtual teams as necessary to deliver assigned service improvement activities.•\tEnsure “best practices“ are shared and utilized. Provide input to stakeholders by an ongoing service improvement plan, measurement framework and Key Performance Indicators (KPIs).Knowledge & Skills Required:•\tCapable Influencer - pragmatic approach - stakeholders management;•\tGood communicator - both technically as well as with executive management;•\tConfident and capable of challenging functional managers around service, and drive resolution of issues, in a diplomatically manner•\tFluent in French written and spoken •\tHighly organized and ability to manage concurrent deadlines and multiple priorities•\tSelf-starter, motivated, change agent, Ability to collaborate in a global matrix managed organization•\tCreative thinker, gets the right balance between following the best practice and driving forward•\tAnalytical mind, capability to go get the skills required to get the job done if they are lacking in the existing org•\tAbility to view complex/conflicting data, identify problems and propose solutions/alternatives. •\tAbility to create productive business environment for employees, by providing opportunities to demonstrate/develop their skill sets.•\tEffectively utilize performance management to optimize associate contribution.•\tStrong ethical behaviorEducation:•\tBachelor’s Degree in Finance, or related field•\tExperience and capability to manage EMEA wide projects autonomously•\tTraining and certification in Six Sigma, or similar quality management experienceRelevant Experience:•\t5 – 7 years experience in project management or continuous improvement•\tExperience of project delivery in all aspects of the Transition Lifecycle Management for the introduction of outsourcing or managed support services (PTP, Reporting,  Accounts Payable, Accounting)•\tFinance Domain Knowledge •\tLocated in Bucharest and travelling whenever is necessary to France (Paris and other regions of France)\n\r\nPlease note that only the selected candidates will be contacted for an interview and all the CVs will be kept in our database for future suitable professional opportunities.\n\r\nSociété Générale European BusinessServices is a player in the shared service center market and delivers highadded value services in various fields of activity for worldwide entities ofthe Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20countries mostly across Europe for all major business lines of the Société Générale Group.The Finance Shared Service Center of SociétéGénérale European Business Services, launched in 2011, now counts more than 250staff delivering services for more than 300 client entities.The team’s activity consists indelivering two important kinds of processes: accounting – namely Groupreporting in IFRS, statutory and regulatory reporting on top of the permanentsupervision activities and related set of control; and Account Payable and Travel& Expenses, with teams specialize in optimizing all procure to pay activities. \n\n\n", "title": "Team Leader Transitions & CI", "company_url": "", "career_level": "Senior, Executive", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-team-leader-transitions-ci/749714/1"}