{"body": "\n\n\n\nWe have an opening position of PCH Customer Service Officer, as contractor, reporting to PCH BU Manager RABB Region, for a non-determined period, located in Bucharest.Please find below the main responsibilities of the above-mentioned position.Responsibilities:   \tReceives, edits, and enters orders for Pfizer products into the system, validating information and checking back with customers where necessary in order to process such orders in an effective and speedy manner. \tMaintains relationships with logistic service provider. \tMaintains an accurate filing system for orders, including the collation of orders, copies invoices, to ensure the effective running of the order system.  \tReceives, investigates and keeps records of incoming customer queries / complaints, and takes the initiative in working towards prompt settlement or resolution of such queries / complaints, with the aim of achieving and enhancing customer satisfaction. \tMaintains relationships with distributors regarding expiring products, damaged products, etc. \tMaintains contact with customers to ensure that scheduled orders are received on time. \tCompletes the invoicing cycle based on the proof of delivery documents: delivery note and signed invoices.Skills, Knowledge, Qualifications & Experience: \tUniversity degree  \tProven experience to handle customer complaints \tKnowledge in SUN System is considered a plus \tExperience in commercial operations would be considered an advantage \tExperience in dealing with wholesalers \tProven ability to track project implementation \tProven ability to identify, analyze and collate information \tGood knowledge of MS Office – Excel \tGood communication skills \tTeam player \tEnglish proficiency \tExperience in centralizing and generating different reportsIf you are interesed in this position, please send your resume to HRRomania2@pfizer.com \n\n\n", "title": "Customer Service Officer", "company_url": "http://www.bestjobs.ro/firme/pfizer-romania-srl/1912605/1", "career_level": "Entry", "company": "PFIZER ROMANIA SRL", "locations": "\nSos. Bucuresti-Ploiesti nr. 172-176 Cl. B Etaj 5, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-service-officer/749917/1"}