{"body": "\n\n\n\nAbout Axway                                                                          \r\n Axway (NYSE Euronext: AXW.PA), a market leader in governing the flow of data, is a global software company with more than 11,000 public- and private-sector customers in 100 countries. For more than a decade, Axway has empowered leading organizations around the world with proven solutions that help manage business-critical interactions through the exchange of data flowing across the enterprise, among B2B communities, cloud and mobile devices. Our award-winning solutions span business-to-business integration, managed file transfer, API and identity management, and email security– offered on premise and in the Cloud with professional and managed services.Axway is registered in France with headquarters in the United States and offices in 18 countries.www.axway.com\r\nAbout Axway 5 Suite\r\nAxway 5 Suite offers control and optimization of the flow of data through integration, visibility, policy, security and reliability to govern business-to-business interactions, communities, systems and data types — within and beyond the enterprise edge.\n\n\r\nKey Responsibilities\n\r\nWork with little or no supervision to provide advanced complex troubleshooting assistance, problem replication / duplication, and diagnostic support\r\nProvide advanced technical support for both the application and environment including operating system, database, and network\r\nLead accounts through multiple issue resolution including customer meetings, status reports, and updates\r\nRespond to phone, email, and web ticket customer issues within target service levels.\r\nAct as a gateway between the customer and the next level of resources; ensuring issues have met minimal requirements for escalation\r\nMaintain current working knowledge of Axway products and technology\r\nDocument all customer contacts and activities in CRM\n\n\n\n\r\nKey Competencies\n\r\nResponse and resolution times\r\nExcellent verbal and written communication skills in French and English\r\nExcellent customer service skills\r\nEffective problem-solving skills\r\nAbility to work effectively in a dynamic, virtual environment\r\nSelf-starting and self-motivated with a high level of initiative\r\nHigh level of ownership and accountability\n\r\nQualifications\n\r\nA desire to learn network connectivity and communication protocols.\r\nB2B experience preferred.\r\nKnowledge of client-server architecture.\r\nExperience in Oracle and SQL.\r\nBackground in Windows and UNIX troubleshooting is beneficial.\r\nPrevious Advanced Technical Support experience in a multinational environment is highly appreciated.\n\r\nWhat We Offer\n\r\nA very friendly and professional working environment.\r\nThe opportunity to work in a new project, learn new technologies and plan for a long term career path.\r\nExposure to German speaking customers from the Automotive industry but also to a wide area of English speaking global customers.\r\nA young and enthusiastic team part of a global organization.\r\nA unique company culture with a constant focus in building strong teams.\r\nExcellent salary package, sport benefits, private health insurance, lunch vouchers and many others.\n\n\n \n\n\n", "title": "Software Technical Support Engineer (with French)", "company_url": "http://www.bestjobs.ro/firme/axway-romania/35153/1", "career_level": "Middle, Senior", "company": "Axway Romania", "locations": "\nCalea Serban Voda nr.133, București, Municipiul București, România\n", "languages": " Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-technical-support-engineer-with-french/751871/1"}