{"body": "\n\n\n\nDuties/Responsibilities : AXWAY is looking to expand the Engineering team in our Bucharest Office with a C Developer. He/she will be part of a software R&D team, delivering high quality software for our more than 11000 worldwide customers.As a C Multiplatform Developer you will be working at the core of B2Bi, in the transformation and routing engine. You will be responsible for:-\tDeveloping and writing the required code for new features on the existing engine-\tCollaborating with other colleagues to ensure that the feature meets the stakeholder needs-\tDocument code throughout the development process-\tConduct training for the new colleagues-\tMaintain the product build running on all supported os (AIX, LINUX, HP, SUN, WIN)-\tWriting code without security vulnerabilities-\tInvestigate performance bottlenecks, crashes, fix defects-\tPre-testing your code in conjunction with tester colleagues-\tParticipate in estimations and backlog definition sessions-\tWork in an agile environment and follow team ceremoniesProject description:B2bi is enabling communications for different partners, entities and applications by electronic messages exchange.B2Bi is handling:-\tthe transport of messages using communication protocols (FTP, HTTP, AS2, AS4, JMS, MQ, EMAIL, …)  -\tthe routing and transformation using message exchange standards (EDIFACT, X12, SWIFT, HL7, standards based on XML, …). Skills/Qualifications:• Knowledge of C (UNIX and Windows):•\tData structures and algorithms•\tMulti-threading and multi-process applications•\tIPC mechanisms•\tSocket programming•\tCommunication protocols•\tClient - Server applications• Troubleshooting and debugging skills:•\tTraces and logs•\tDebugging running processes•\tAnalyzing core dumpsThe following additional skills will be an advantage: •        Bash scripting•        C++•        Knowledge of software security, cryptography algorithms•        Knowledge of one Database software and SQL•        University degree in Computer Science/Informatics/Engineering or equivalent Experience in software development \n\n\n", "title": "C Multiplatform Developer", "company_url": "http://www.bestjobs.ro/firme/axway-romania/35153/1", "career_level": "Middle, Senior", "company": "Axway Romania", "locations": "\nCentral Business Park Calea Serban Voda nr. 133, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-c-multiplatform-developer/748277/1"}