{"body": "\n\n\n\nSCOP:  \r\nCoordoneaza activitatea de back-office pentru instalarea si intretinerea serviciilor TV, furnizeaza support administrativ general presupunand colectarea, rezumarea si analizarea de informatii si pregatirea de statistici, rapoarte si prezentari.\n\r\nRESPONSABILITĂŢI PRINCIPALE:\r\nColaboreaza cu detinatorul de buget investitii si operational si cu departamentul achizitii relevant pentru previzionarea necesarului de echipamente DTH, functie de stocurile disponibile si istoricul instalarilor;\r\nCoordoneaza activitatea de distributie a echipamentelor DTH, catre depozitele regionale si firmele terte DTH;\r\nVerifica rapoartele de stocuri trimise catre terti pentru echipamentele DTH;\r\nActualizeaza informatiile utilizand aplicatii diverse – Charisma, Oracle, TOA (aplicatie de tip Work Force Management);\r\nUrmareste si analizeaza cheltuielile pentru plata situatiilor de lucrari pentru terti si supervizeaza receeptiile; \r\nParticipa la elaborarea specificatiilor tehnice in vederea achizitionarii de noi echipamente DTH;\r\nOfera suport/participa pentru/la inventarierea pe teren a stocurilor de echipamente DTH, existente la firmele terte;\r\nCoordoneaza activitatea de punere in functiune/scoatere din functiune mijloace fixe si obiecte de inventar DTH;\r\nFurnizeaza rapoarte de stocuri, rapoarte de receptii;\n\n\r\nCERINTELE POSTULUI\n\r\nStudii: \r\nStudii superioare (in domeniul tehnic- telecomunicatii, electronica, automatica si calculatoare si retele de calculatoare reprezinta un avantaj).\r\nStudiile economice complementare reprezinta un avantaj;\n\r\nExperienţa în muncă: \r\n5 ani de experienta in activitati cu caracter tehnic in domeniul telecomunicatiilor, ideal in arii ce presupun instalari si deranjamente prin terti;\r\nExperienta in managementul contractelor reprezinta un avantaj;\n\r\nCunoştinţe, Aptitudini & Abilităţi: \n\r\nCunoasterea aplicatiilor de tip Oracle, Charisma Retail, Service Order, WFM;\r\nCunostinte de Managemenul proiectelor reprezinta un avantaj;\r\nCunostinte avansate in operarea MS Office (Word, Excel, Power Point, Visio);\r\nCapacitate analitica;\r\nOrientare catre client, initiativa, integritate, lucru in echipa;\r\nAbilitati de comunicare;\r\nAtitudine proactiva, initiativa, automotivat, flexibil si adaptabil;\r\nCapacitaatea de a invata rapid;\r\nRezistenta la stres, abilitatea de a lucra cu termene limita/ multi-task.\n \n\n\n", "title": "Specialist de proiect", "company_url": "http://www.bestjobs.ro/firme/telekom-romania-communications-s-a/2564064/1", "career_level": "Middle", "company": "Telekom Romania Communications S.A.", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-specialist-de-proiect/751004/1"}