{"body": "\n\n\n\nThe MissionData is a game-changer. It’s all around us. Implementing a uniform approach as to how we manage data throughout the bank allows us to enhance the customer experience, lower IT operational costs, and swiftly and correctly report to external regulators. Data management can help our customers and our organization unlock new potential and realize our shared vision of becoming a next generation digital bank. Your Day-to-DayContributing to strategy and lifecycle management of Data Lake implementations:\tImplementing non-functional requirements \tETL Framework (Scripts, Interfaces, Monitoring, Documentation, Coding Standards, etc.)\tTooling & Infrastructure (scripts and instalation of IBM InfoSphere, Hadoop, hardware & software requirements)\tArchitectural Documentation (Blueprint, principles, component mapping)\tMetadata Catalog Integration, efficiency of end-to-end operational processes by identifying and mitigating  risks\tCollaborating closely with an international team made of Group Architects, Subject Matter Experts and Infrastructure Specialists\tSafeguard usage of Agile - Scrum principles in day-to-day work of the team\tBeing up to date with the latest industry standards and trends in the area of big ditaDaily management of a highly talent Big Data experts team located in Bucharest. Providing continuos coaching and mentoring by clarifying job responsibilities, setting performance expectations through the establishment of goals and job competencies, identifying skill gaps, creating development plans and evaluating performance.Ocassional travelling to Amsterdam, Netherlands, might be requiredWhat you bring to the teamKnowledge of database design, ETL and data analysis on large amounts of dataGood knowledge of Oracle Database, SQL, PL/SQLExperience with IBM InfoSphere DataStage and QualityStage Operations ConsoleExperience with IBM Information Governance CatalogExperience with Hadoop installation and scriptsKnowledge of scripting language on Unix systemsExperience as developer of multi-tier applicationsAbility to translate functional and non-functional requirements (eg. Security, High Availability)Experience with pair programming, release automationUnderstanding of Agile – Scrum methodology is considered a plusExcellent written and spoken English skillsWhy ING ING is a frontrunner in the transformation of banking and a company that puts technology at its heart.Our mission it to empower people to stay a step ahead in life and in business and provide products services that make our customers’ life easier.What enables us to deliver best banking experience is Technology mastered by best IT specialists in the market.Hence, with up to 9,000 IT professionals worldwide, we are constantly striving for innovation, using not only top-notch technologies but also the latest methodologies in software development. In  addition to developing products and services aimed at offering best client experience, the IT experience at ING Romania goes beyond local borders. Therefore, in recognition of the high standards of IT engineers in Romania, in 2014, ING opened a Center of Excellence that develops banking software solutions for several countries in Europe. The IT community in ING Romania gathers more than 300 IT specialists and it’s expanding fast.If we caught your eye, let’s chat and see how we can build the bank of the future together! \n\n\n", "title": "Big Data Technical Lead", "company_url": "http://www.bestjobs.ro/firme/ing-bank-romania/36692/1", "career_level": "Senior", "company": "ING Bank Romania", "locations": "\nTipografilor, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-big-data-technical-lead/749355/1"}