{"body": "\n\n\n\nVeeam Software is the leader in software solutions for VMware virtualization systems management. Veeam is an international company with global headquarters in Baar, Switzerland, regional headquarters for EMEA in Paris, for the Americas in Columbus, Ohio and for Asia Pacific in Sydney.\n\r\nNow we are looking for an energetic person who will join our team as EMEA Alliance Marketing Specialist.\n\r\nResponsibilities\n\r\nCo-marketing  with Veeam  alliance partners: NetApp, VMware, EMEA system integrators\r\nAnnual, quarterly research and planning\r\nProvide marketing support for Veeam Alliance team members and EMEA field marketing\r\nTracking of alliance marketing activities on Salesforce, reports for promo programs\r\nEMEA internal marketing space monthly update\r\nCoordinate the hands-on day-to-day execution of marketing plans and action items\r\nInternal education: leveraging of alliance marketing best practices for field marketing, channel, sales teams\r\nLiaison with corporate alliance team: best practices collection and leverage across EMEA territories\n\r\nQualifications\n\r\nHigher Education\r\nFluent English \r\nExperience of work in marketing and/or IT more than 3 years\r\nUnderstanding of the roles played by alliance partners, distributors, system integrators and vendors in the channel\r\nNegotiation skills\r\nAdvanced user of MSFT Power Point, Excel\r\nKnowledge of Salesforce analytics as a plus\r\nActive and reliable, self-starter\r\nTeam player, diplomatic\n\r\nWe offer\n\r\nWork in a stable, dynamic company\r\nModern energetic multinational working environment\r\nCompetitive salary, depending on skills and experience\r\nExtensive opportunities for professional growth\r\nFlexible work schedule\r\nAn extended medical insurance policy\r\nA partial compensation of costs on fitness \n\n\n", "title": "EMEA Alliance Marketing Specialist", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Middle, Senior", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-emea-alliance-marketing-specialist/208233/5"}