{"body": "\n\n\n\nREQUIREMENTS:The ideal candidate has:- at least 2 years of experience:     - PHP/HTML/CSS/Javascript     - PostgreSQL, SQL or other relational databases- **Candidates with less experience are also welcomed.- flexibility and open to learn new technologies, motivated, responsible respecting the milestones and the delivery dates, concerned about the quality of his work and of the final product, team player- fluent in English- Ability to work independently when needed- Ability to work in close relation with the client, gather the requirements, make an correct estimation of the project and respect the delivery dateCONSIDERED A PLUS:- experience in Linux SO administration, computer networks administration- language skills: French or German- web sites design experience- advanced skills and experience using PostgreSQL, PHP/HTML/CSS/Javascript/jQuery- experience developing mobile web sites- experience developing on iOS- experience developing on AndroidBENEFITS:- motivating salary, depending on your professional skills     - Junior starting from 800 euro net     - Mid-level experience starting from 1200 euro net- good working atmosphere- being part of a young and motivated team- gathering experience working with new web & mobile technologies- working with West European clients- gathering experience in managing projects and products while keeping close contact with the clientsABOUT US:Cmetrix Technologies Group offers solutions and services for Western European companies active on the mobile technologies market. The field of activity is generally of web technologies, mobile multimedia, mobile billing, providing technical solutions and services. Key features are flexibility and dedication to develop quality services. \n\n\n", "title": "Mobile & Web - PHP DEVELOPER", "company_url": "http://www.bestjobs.ro/firme/cmetrix-technologies-grup/13083012/1", "career_level": "Entry, Middle", "company": "Cmetrix Technologies Grup", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-mobile-web-php-developer/747806/1"}