{"body": "\n\n\n\nOur Solution\r\nWe provide a solution for the Dutch real estate industry which supports the core processes of a Real Estate company like: Property management, Contact management (Tenants, companies and households), Recurring invoicing based of a rental contract, Housing proposals for searching new tenants, Property maintenance, Financial management.\r\nOn a technical level our solution uses a wide range of technologies: Microsoft NAV, .NET, C#, AngularJS, Bootstrap, mobile applications for tables built using Xamarin, BI (Business Intelligence) with Microsoft SSAS, SSIS and others.\n\r\nWe need a new colleague in our newly formed OPS-OPS team. See below the responsibilities and requirements of this role.\n\r\nOur Chalenge\r\n               One of the main goals for the OPS-OPS  team is to setup and maintain a Continuous Delivery  and Integration pipeline.\n\r\n               Continuous Delivery (CD) is a software engineering approach in which teams keep producing valuable software in short cycles and ensure that the software can be reliably released at any time. The idea of Continuous Delivery is to perform these often complex and fault tolerant software process activities very frequently, rehearsing them often/continuously, so that potential issues with the software product are found fast/immediately/during development, not at the end or at the customer, and that the delivery of software into production is a routine and well-oiled process. \n\r\n                To make this approach efficient, automation and standardization of software build, test and release activities, called the pipeline, are required.\n\n\r\nResponsibilities\r\n\tAutomation & Scripting\r\n\tContinuous delivery \r\n\tCreating and Managing Environments \r\n\tWorking in close cooperation with development teams\r\n\tTeam player in an Agile environment\r\n\tCreate new Cloud environment\r\nRequirements\r\n\tUse automation tools and techniques in order to deploy, update and configure our products and create/destroy environments;\r\n\tAbility to use scripting or programming languages (Powershell);\r\n\tExperience with automated CM (Configuration Management) and deployment tools such as Chef, Puppet, or Ansible\r\n\tExperience using monitoring tools for server health and performance \r\n\tKnowledge with Azure is a big plus; willing to learn Azure and cloud in general is a big plus;\r\n\tKnowledge of VMware \r\n\tKnowledge of storage and/or network design and administration\r\n\tArchitect, implement, and manage cloud and on-premise server clusters required for large-scale testing\r\n\tAbility to configure our solution on different environments (development, test, acceptance, customer);\r\n\tMaintain the test environments as required (e.g., data loads, database backups, restarting the servers, requesting deployments, troubleshooting issues);\r\n\tAutomate repetitive tasks;\r\n\tIdentify, analyze, coordinate, and resolve environment and infrastructure issues to ensure a smooth running application\r\n\tPilot the use of monitoring tools including JVM profiling, Application monitoring tools, and Performance tools to improve the visibility of the impact of changes and the health of the testing Environment\r\n\tRecommend technical strategies to contribute to the overall effectiveness and quality of the solution infrastructure and deploymet;\r\n\tWork with technical services to understand and replicate customer IT environments\r\n\tAbility to work as part of a self-organizing team using the Agile/SCRUM methodology in which you determine your tasks on a daily basis in cooperation with colleagues; take initiative and be a team player;\r\n\tParticipate in a proactive manner in all activities and meetings of the team: planning, refinement, daily stand-up, demo, retrospective and other team specific activities;\r\n\tGood verbal and written communication skills in English;\r\n\tDesire to learn and continuously improve;\n\n\r\nWhat we offer\r\n\tComplete training plan upon entering our company and our team including: trainings about the Agile process & tools, Technologies used in the projects, Functionality of the project, tools & environments used\r\n\tWide range of learning activities focused towards continuous learning: reading groups, Pluralsight video trainings, internal and external events\r\n\tHeadquarters in the center of Bucharest (Victoriei Square) \r\n\tFlexible working environment within a dynamic team \r\n\t22 days as annual vacation + additional vacation days according to the internal policies\r\n\tAccess to various training programs (soft and hard skills trainings, according to the internal policies)\r\n\tPrivate medical subscription, you can choose from 2 providers\r\n\tMeal tickets\r\n\tFree Gym Subscription- fitness, aerobic, pool (according to internal policies)\r\n\tMassage within the company premises\r\n\tTeam events (team buildings, team hangouts, Christmas party, etc.)\r\n\tRelaxation room (foosball, darts, board games, X-box)\r\n\tBeing part of a growing organization with Belgian roots\n \n\n\n", "title": "OPS System Engineer", "company_url": "http://www.bestjobs.ro/firme/cegeka-romania/35771/1", "career_level": "Middle, Senior", "company": "Cegeka Romania", "locations": "\nIon Mihalache 15-17, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-ops-system-engineer/750514/1"}