{"body": "\n\n\n\nRed Mountain Management (RMM) is a Romanian consultancy company activating within the financial investment services market. Due to our registered business growth based on large partnerships with important international players, we are currently looking for highly dynamic professionals to join our team of sales specialists. \r\nWe are recruiting passionate and motivated Social Media Specialists able to deliver results against objectives and meet the company expectations in a professional and dynamic manner. The Social Media Specialists must be eager to develop themselves in a fast-paced professional environment.\n\r\nResponsibilities:\r\n- Responsible for the identification and contact of potential (international) clients using the social media platforms.\r\n- Use the company’s professional written templates in order to grow the share of the products and services based on the company strategy.\r\n- Ensure coherent and simple messages and ads.\r\n- Providing all the necessary information and assistance in a professional and accurate manner.\r\n- Selecting the best professional approaching methods to attract the potential clients attention and turn that interest into sales.  \r\n- Maintaining and developing successful business relationships throughout theentire approach and contact process/ life-cycle.\r\n- Making efforts to identify and anticipate the client needs.\r\n- Staying updated with RMM best practices and industry researches.\n\r\nRequirements:\r\n- Proficient in Italian and English (written & spoken).\r\n- Computer proficiency- Microsoft Office Suite, Internet \r\n- Strong familiarity with online environment, especially professional and social networks - LinkedIn and Facebook basic experience.- Knowledge of Arabic language is a PLUS.\r\nCreativity and presentation skills:\r\n- Attention to details and good communication skills. \r\n- Experience in consulting/marketing is a PLUS.\r\n- Eager to work in a demanding but challenging and dynamic environment that will quickly expand personal capabilities and marketing knowledge.\r\n- Driven by determination to grow fast (committed to work hard to support the growth of the company and thus create great career opportunities within the company). \r\n- Ability to learn fast and to adapt to new and challenging situations.\n\r\nBenefits:\r\n- Motivating position and unique chance for professional development in the local office of a major international company.\r\n- Dynamic, multinational work environment in a young team & young start-up branch - free of slow corporate procedures & regulations.\r\n- Opportunities for personal development through training courses.\r\n- Competitive remuneration package based on fixed salary+bonuses+commissions.\r\n- Private medical insurance.\r\n- Professional training and ongoing coaching.\n\r\nIf you enjoy being challenged over and over again, but also to have fun, RedMountain Management (RMM for friends) will be the best place for you to work.We invest heavily in the development of our people, and RMM gives you plenty of opportunities for individual initiative and responsibility.  \n\n\n", "title": "Social Media Specialist with Italian", "company_url": "http://www.bestjobs.ro/firme/red-mountain-management/13597751/5", "career_level": "Entry, Middle", "company": "RED MOUNTAIN MANAGEMENT", "locations": "\nAcademiei 28-30, București, Municipiul București, România\n", "languages": " Italiana, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-social-media-specialist-with-italian/209357/5"}