{"body": "\n\n\n\nFinance Analyst - Marketing Operations-FIN001388As Finance Analyst in the recently created European Marketing Operations team you will be working cross functionally with the category, marketing and commercial teams to support the deployment of a significant marketing budget across Kellogg’s European operation. This role will provide a fantastic opportunity for a finance professional looking to gain commercial knowledge and experience of embedding new ways of working. WHAT WILL I BE DOING?·         Responsible for day to day finance activities for European media spend, including month-end and forecasting processes and associated reviews with Media Buying team, A&P trackers, variance analysis, sign-offs, system loading and reconciliations within the Accounting Policies. This will involve liaison with the current R2R GBS team, who complete the close elements.·         Business partner with the Marketing Operations Team on Media to ensure visibility and control of spend and adherence to the budget; this includes working with agencies to ensure proper visibility and controls.·         Control and management of A&P Investment, including Forecasting, Budget Planning, Internal Order Numbers and Hyperion processes.·         Partner with Categories, Clusters, GBS and Wired to Win team as appropriate to simplify, standardize and automate relevant processes and drive continuous improvement.·         S404 – Ensure S404 templates are up-to-date and perform S404 testing.·         Actively managing relevant balance sheet accounts to ensure items are not overly aged.·         Special projects and ad hoc analysis, as required.WHAT DO I NEED TO DEMONSTRATE? To be considered for this position, you must be able to demonstrate the following. Required:·         Strong technical capability especially, in the use of Excel·         Impact & Influence·         Work independently·         Partner with non-finance customers·         SAP experience·         Proficient with Microsoft Office Excel (Required); Experience with Word, PowerPoint, and Access (Preferred)·         Experience working for a multinational organisation and working with colleagues internationallyPreferred:·         Commercial Finance, Financial Planning or Budgeting Experience·         Hyperion Planning experience·         Experience working in a shared services, process driven or service centre environment·         Strong understanding of accounting principles and deep, broad experience in all areas of general accounting·         Expertise in Record to Report function, including best practices, technologies, processes, procedures and tools WHAT ELSE DO I NEED TO KNOW? Some travel to other Kellogg locations will be required Please note that we will only accept applications that are made to us via our Careers site. If you experience any difficulty when applying please contact hrsharedservice@kellogg.com. Please note that the closing date may be subject to change. We will interview suitable candidates as they apply, so please don’t hesitate to take this opportunity to submit your application as soon as possible. If you would like to be immediately notified of new Kellogg's opportunities, please go to ‘Create or access my profile’ and complete the information required in the ‘Job Alerts’ section. You will then receive email alerts as soon as new jobs are advertised. The Kellogg Company is an Equal Opportunity Employer who strives to provide an inclusive work environment that involves everyone and embraces the diverse talent of its people. \n\n\n", "title": "Finance Analyst - Marketing Operations", "company_url": "http://www.bestjobs.ro/firme/kellogg-european-services-support-srl/13873245/5", "career_level": "Entry, Middle", "company": "KELLOGG EUROPEAN SERVICES SUPPORT SRL", "locations": "\nSoseaua pipera nr 43, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-finance-analyst-marketing-operations/205634/5"}