{"body": "\n\n\n\nSolutioneaza sau coordoneaza restabilirea serviciilor pentru a asigura conformitatea cu standardele de calitate ale ORO si a proceselor de comunicare interna si externa;Analizeaza impactul incidentelor sau al lucrarilor programate pentru a stabili prioritatile operationale sau riscul asociat.Responsabilitati•Acorda suport operational in implementarea noilor servicii sau planurilor de imbunatirea calitatii serviciilor;•Analizeaza si evalueaza activitatile programate ce au impact semnificativ asupra serviciului, alaturi de coordonatorul de operatiuni;•Analizeaza, solutioneaza sau coordoneaza rezolvarea reclamatiilor venite de laclienti;•Analizeaza, evalueaza, solutioneaza sau coordoneaza rezolvarea tuturor incidentelor majore sau critice ce afecteaza disponibilitatea si calitatea serviciilor fixe;•Gestioneaza actiunile referitoare la incidente si rezolvarea cazurilor critice;•Asista Coordonatorul de Operatiuni in definirea cerintelor organizarii cu succes aevenimentelor speciale;•Identifica problemele ce afecteaza critic sau prin recurenta serviciile fixe. Pregateste si propune actiuni pentru rezolvarea lor•Utilizeaza si adapteaza instrumentele si procedurile specifice postuluiRealizare rapoarte•Actualizeaza baza de date a incidentelor si reclamatiilor;•Realizeaza rapoartele de incidente critice.Cunostinte solide in:• FTTB, FTTH, retele de comunicatii;• Transmisiuni de date L2/L3;• TCP/IP, DNS, DHCP, VOIP• MS Office• Limba engleza, avansatCunostinte de baza in:•\toperare si administrare servere•\tsolutii de monitorizare(Cacti/Nagios)Educatie si Experiente (nivel minim necesar)•Studii universitare in telecomunicatii;•3-5 ani experienta in operarea retelelor de Telecomunicatii – transport date IP ;•Experienta in operarea si administrarea serverelor •Experienta in troubleshooting retele TCP/IPCompetente specifice: •Autonomie•Capacitatea de diagnoza si propunere de solutii•Orientare catre client si servicii•Gândire analitica•Asigura coaching / monitorizare•Abilitatea de a rezuma•Initiativa si pro-activitate•Abilitatea de a prioritiza•Abilitati de comunicare•Orientare spre rezultate•Cautarea informatiilor•Munca de echipaIti multumim ca ai aplicat la Orange! \n\n\n", "title": "Fix Broadband Service Operations", "company_url": "http://www.bestjobs.ro/firme/orange-romania-sa/885505/1", "career_level": "Entry, Middle", "company": "Orange Romania SA", "locations": "\nStr. Gara Herastrau nr 4,, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-fix-broadband-service-operations/749270/1"}