{"body": "\n\n\n\nStellenbeschreibungIm Rahmen unserer Strategie zum Ausbau der globalen Einkaufsaktivitäten sind Sie für den Aufbau eines strategischen Einkaufs in Abstimmung mit dem Konzerneinkauf, sowie für die Beschaffung der direkten und indirekten Materialien für den Standort Rumänien verantwortlich. In dieser Funktion verantworten Sie die Einkaufsziele Qualität, Kosten und Lieferservice im Umfeld aller in Rumänien lokalisierten Beschaffungsumfänge zur Versorgung des Standortes Sibiu. Mit Ihrem Fachwissen hinsichtlich der Beschaffungsregion Osteuropa sind Sie für die gezielte Lieferantenauswahl und deren vertragliche Absicherung zuständig und führen die Vergabeentscheidungen über Konzerngremien herbei. In dieser Funktion arbeiten Sie auch eng mit den angrenzenden Bereichen Vertrieb, Produktentwicklung-und Konstruktion, Produktmanagement, Qualitätswesen, Logistik und Produktion zusammen. Aus der systematischen Beschaffungsmarktbearbeitung und Überwachung der Preisentwicklung, setzen Sie Kostenreduzierungspotenziale selbstständig um. In Zusammenarbeit mit dem Konzerneinkauf reduzieren Sie die administrativen Aufwände und nehmen eine Lead Funktion für die Beschaffungsregion Osteuropa ein. Als Einkaufsverantwortlicher für die Beschaffungsregion Osteuropa sind Sie erster Ansprechpartner und Schnittstelle zu den regionalen Lieferanten für das gesamte WITTENSTEIN Einkaufsnetzwerk weltweit. In enger Zusammenarbeit und unter fachlicher Führung des zentralen Materialgruppenmanagements agieren Sie als lokales Einkaufsbüro, sowohl für die Lieferantenqualifizierung und – entwicklung, als auch für das lokale Beschaffungsmarktscouting und entwickeln unter Berücksichtigung der konzernweiten Materialgruppenstrategien ein leistungsfähiges Lieferantenportfolio in der Beschaffungsregion Osteuropa.AnforderungenSie haben eine technische Grundausbildung mit mehrjähriger strategischer Einkaufserfahrung im Lieferantenmanagement. Idealerweise verfügen Sie über einen Hochschulabschluss als Wirtschaftsingenieur oder vergleichbarer Ausbildung. Produkt- und Prozesskenntnisse hinsichtlich den Beschaffungsmärkten für mechanische und mechatronische Antriebssysteme auf Ebene der Einzelkomponenten sind von Vorteil. Ihre Persönlichkeit ist gekennzeichnet durch Verhandlungsgeschick, Organisationstalent sowie einer ausgeprägten Teamfähigkeit in Konzernstrukturen. Den sicheren Umgang mit ERP-Systemen, MS Office-Programmen sowie Reisebereitschaft setzen wir voraus. Als deutschsprachiger Konzern verfügen Sie über verhandlungssichere Deutschkenntnisse. \n\n\n", "title": "Strategischer Einkäufer (w/m)", "company_url": "http://www.bestjobs.ro/firme/wittenstein-srl/10911696/5", "career_level": "Middle, Senior", "company": "WITTENSTEIN SRL", "locations": "\nE81, Sibiu, Județul Sibiu, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-strategischer-einkaufer-w-m/201534/5"}