{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a long term basis, offering at the same time a wide variety of features such as expertise, challenging development opportunities in an international environment and the joy of a strong spirit.Mission:The ITEC / FCC / LTL / DTD team provides technical design and development of softwares/applications on the entire funding of department (Loans, Trade Finance and Leasing).The application scope LTL revolves around several software:- Cassiopae: software for back office management dedicated to leasing deals (development base in Romania);- ALLTRA: software for back office management dedicated to Commodity Trade Finance (development base in Romania);- Tomcat: Application for Middle Office risk management dedicated to commodity;- Loan IQ: software for back office management dedicated to Loans.The objective of this project will be to switch developers between Cassiopae and Alltra, so that they can be able code on both applications.Responsabilities:•\tUnderstanding of detailed functional specifications; •\tParticipate in the translation into technical specifications;•\tParticipate in the estimation of workload required to achieve the development and unit tests;•\tAppropriating the operating rules of the development environment;•\tCode/set-up and document what is produced;•\tComply with the standards and procedures (architecture, security, quality, documentation);•\tPerform a reporting activity (Daily Scrum) on the product or integrated component;•\tWorking with Continuous Delivery and Agile methodologies (Scrumban);•\tDefine the unit test cases for the product component;•\tEnsure compliance with technical specifications;•\tConduct performance tests;•\tContribute to the 3rd level support, this includes: monitoring of the resolution of incident and troubleshooting;Your technical profile:•\tExcellent understanding of Java 1.6 – 1.7, Oracle Database;•\tTools : SVN, Eclipse or IntelliJ, Maven,  Oracle SQL Developer, TortoiseSVN, Jira, Jenkins;•\tExperience with Spring and JPA / Hibernate is a requirement;•\tExperience with PL/SQL will be a very big plus;•\tExperience with batch jobs and front-end development (AngularJs, Js Framework) is appreciated;•\tBachelor’s degree in Computer Science or equivalent.We will also value:•\tA responsible attitude and ambition in achieving your mission;•\tA good combination of rigor, creativity and communication skills;•\tGood command of English, both written and spoken with the ability to participate in English-only meetings. — French knowledge is an advantage;•\tEnthusiasm, self-confidence, innovative problem-solving skills, curious, autonomous and really keen to develop his tech skills.Benefits:•\tCompetitive remuneration and benefits package, based on qualifications and experience;•\tPossibilities of promotion and development of a career plan;•\tA modern working environment: open, informal, fun and start-up atmosphere;•\tMeal tickets;•\tPrivate health insurance;•\tYearly bonus per company policy;•\tPermanent employment contract.Company:Société Générale European Business Services is a player in the shared service center market and delivers high added value services in various fields of activity for worldwide entities of the Group (finance/ accounting, procurement, human resources and IT).  The company is currently serving over 20 countries mostly across Europe for all major business lines of the Société Générale Group.ITEC is the IT department of the Investment Bank of Societe Generale, a.k.a. GBIS for Global Banking and Investor Solutions. With 18,000 employees working in 53 countries, GBIS focuses on the needs of Corporates, financial institutions, public sector, family offices or High Net Worth Individuals. It regroups Corporate & Investment Banking, Private Banking, Asset Management and Investor Services.GBIS is a major growth engine for the Group, (see more on https://www.sgcib.com ).What are the key characteristics of ITEC?•\tWe are BIG! ITEC is 7000 people strong worldwide.  •\tWe are global: GBIS is represented in more than 50 countries, but ITEC is concentrated in the major financial places of the planet: Paris, New-York, London, Hong Kong. But in parallel, ITEC has developed a network of operation Hubs like Bangalore, Montreal, and now Bucharest, in order to be more resilient, and more cost effective.•\tWe are complex: the type of business we support is very complex and dynamic. Financial products and solutions embed advanced mathematics and finance concepts, but they also need to be out on the market as fast as possible to beat the competition: Time to Market is key!•\tWe are growing: the investment banking is a very IT intensive business. And as we embark into the “Digital Transformation” journey to create the “Bank of the Future”, IT is becoming more and more a critical/core business partner for the bankers. ITEC represents one third of the overall GBIS staff.ITEC Bucharest operates with Parisian colleagues just like if we were one floor up (or down) in the same tower in Paris, La Defense. We want to be able to create that proximity in the relationship, and the trust and confidence in the connections. Our initial target will be to grow up to a few hundred people in the coming years. This will only be possible if we demonstrate our ability to deliver high quality work.Societe Generale is one of the largest European financial services groups. Societe Generale has been playing a vital role in the economy for 150 years. With more than 154,000 employees, based in 76 countries, it has been accompanied 32 million clients throughout the world on a daily basis. \n\n\n", "title": "Java Developer - Java Core", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer-java-core/749207/1"}