{"body": "\n\n\n\nQS unisolution is an international company with offices in Stuttgart, London and Bucharest. We provide innovative IT solutions in the field of higher education which are already being used by over 300 institutions worldwide. We support providers of education in optimising their organisation and work processes. We similarly help to strengthen market position through online education portals, marketing tools, highly advanced CRM products and procedures for the electronic transfer of data.If you share the our enthusiasm for the challenging field of education and you would like to help us develop further into a globally recognized market leader providing innovative software solutions in higher education, we are looking to fill the following position in our Bucharest officeJob responsibilities:The Project Support- Data Migration will extract, transform, and load data into our MoveON system, will help clients migrate to MoveON and create and maintain the migration tools. She/He will work with project managers and client stakeholders to understand and refine project functional requirements. Specific responsibilities include:\tPerform analysis of legacy data and advise project manager on the best way to migrate and manipulate client data to MoveON environments \tCreate and document scripts/programs to facilitate the extraction, transformation and loading of legacy data.\tPerform data extracts, data translation, and data cleanup as part of projects or ongoing client relationships\tPerform special data manipulation, data cleanup projects or health checks.Job requirements:\tFamiliarity with CRM or ERP like systems\tIT, Project Management or Professional Services experience\tFamiliarity with database systems (SQL, MySQL, etc.) and very good knowledge of MS-Office programs (mainly MS Excel and MS Access) \tKnowledge of data extraction, transformation, and data loading techniques.\tHigh comfort level with scripting, SQL, VBA.\tFluent English\tCustomer focusFurther beneficial\tExperience in working with XSLT and/or NoSQL DatabasesWhat we offerA fascinating and powerful solution in the international market of education An international team with a flat hierarchy and creative atmosphere Modern office in the city center Opportunity to learn and grow  Interviu Online:1.  What is your salary expectation for this position? \n\n\n", "title": "Project Support Specialist- Data Migration", "company_url": "http://www.bestjobs.ro/firme/qs-quacquarelli-symonds/13554254/5", "career_level": "Entry, Middle", "company": "QS Quacquarelli Symonds", "locations": "\nStirbei voda nr 114, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-project-support-specialist-data-migration/202359/5"}