{"body": "\n\n\n\nNetBet is a premium online platform for sports betting, casino and poker.  It is among the world’s largest and most successful iGaming operators and has extensive experience and a comprehensive selection of betting options and games to choose from. NetBet is at the forefront of iGaming innovation and our tailor-made solutions are designed to meet our customers’ every need.Our gaming suite includes a wide range of original video bonus slots, table games and branded content from some of the world’s most well-renowned film and TV studios and a unique collection of branded and original HTML5 games optimised for smartphone and tablet users.More info: www.netbet.roTHE ROLE The ideal web candidate will have extensive commercial PHP back end development experience using Object oriented PHP, MySQL. The ideal web developer will be experienced in back end integrations, SOAP and REST APIs with a problem solving and methodical approach. The candidate will work within a team of 7 people for our client, including project management, product owner and development team. PHP developer must have extensive knowledge and experience of:•        PHP5 OO, MySQL•        REST, SOAP API knowledge•        Used to work in a fast paced web development environment•        Ability to provide accurate development estimates•        Good communication skills•        Excellent team player•\tFluent in English and Romanian PHP developer desirable (not essential):•         Working with remote teams•         nodeJS•         API integration in between different technologies (C, Java, PHP)- Competitive salaries based on your knowledge level;- The perspective to develop yourself according to your own ambitions;- Freedom for your crazy ideas;- Cutting edge technologies. \n\n\n", "title": "Backend DEVELOPER", "company_url": "", "career_level": "Entry, Middle", "company": "", "locations": "\nSirenelor, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-backend-developer/746988/1"}