{"body": "\n\n\n\nWe are seeking for a qualified, highly motivated Quality Assurance Engineer. He/she will have a key role in an Agile Team, responsible for the overall quality of the product, involved in planning, design, validation, verification, maintenance of the product.\r\nThe QA engineer must understand and follow the established QA process. He / she will take part in the requirements analysis on a team level, define test cases according to the requirements, create and maintain the cases in the case repository, create defects based on “root-cause” analysis and verify fixed defects based on risk assessment of the affected areas.\r\nThe QA engineer is responsible for creating and maintaining QA related documentation (test strategies, test cases, test requirements etc.), status reporting and QA metrics. He / she has responsibility for the overall quality of the products.\r\nA candidate for this position will have to know or be willing to learn to write automation tests for the use cases validated.\n\r\nProject description\n\r\nSecure Relay is an Axway strategic component that is embedded in multiple Axway deliveries. This component is a proxy that allows routing of transferred messages between external partners and internal network. This is a security layer that insures our customer that their internal applications are not vulnerable to outside security attacks.\r\nThe product uses Java technology for securing communications between external parties and internal network. Multiple transport protocols are supported (HTTP/s, FTP/s, SFTP, OFTP, PeSIT and others). As the product is a proxy that our customers use to secure their internal network there is a high accent set on providing more secure implementation and making sure that all security alerts are being addressed.\r\nSkills/Qualifications\n\r\n•\tAt least 3 years of QA experience \r\n•\tStrong troubleshooting and analysis skills\r\n•\tProactive, able to quickly identify test risk areas\r\n•\tExperience using test management systems (e.g.: Quality Center)\r\n•\tBasic knowledge of Linux operating systems\r\n•\tScript programming (e.g.: UNIX shell, Perl, Python) is a plus\r\n•\tKnowledge of network and Internet standards (TCP/IP, FTP, SMTP, HTTP, SFTP)\r\n•\tUnderstanding of security algorithms and concepts (PKI Infrastructures, SSL, S/Mime)\r\n•\tSecurity-focused, up-to-date with the latest security trends\r\n•\tExperience working with at least one database (e.g.: Oracle, SQL Server) and MySQL is a plus\r\n•\tExperience with Test Automation (Java) is considered a plus\r\n•\tExperience using defect tracking systems (e.g.: Mantis, Bugzilla, Jira) is a plus\r\n•\tFluent or native English\n\r\nCareer Development\n\r\nThis is what our candidates can expect from us if they choose to join our team:\r\n- Career development: Employee career development is one of Axway’s major company values; and we are deeply committed to helping them leverage the promotion and job mobility opportunities that are right for them.\r\nIn addition, Axway’s global presence creates opportunities for geographical mobility both within Axway subsidiaries.\r\n- An important training plan (technical, product & functional) in order to insure your integration and your performance\r\n- A competitive remuneration package and real benefits\r\n- A future and a potential for growth in an international company\r\n- A very friendly working environment with experienced professionals\r\n- Get challenged with important tasks so they can show their full potential and obtain new skills\r\n- Working time that can be flexible when needed\r\n- More paid vacation\r\n- Open office space with various entertainment opportunities – table tennis, drums, sports and more!\n\n\r\nSubmit resumé or CV and region you are applying for to avrancianu@axway.com. \n\n\n", "title": "Senior Software Quality Assurance Engineer", "company_url": "http://www.bestjobs.ro/firme/axway-romania/35153/1", "career_level": "Middle, Senior", "company": "Axway Romania", "locations": "\nCentral Business Park Calea Serban Voda nr. 133, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-software-quality-assurance-engineer/751309/1"}