{"body": "\n\n\n\nPosibilitate de a-ti incepe cariera cu clientul nostru, cunoscuta companie multinationala, importanta in piata de telecomunicatii romaneasca\n\r\nCERINTE:\r\n Abilitati excelente de comunicare in limba romana\r\n Cunostinte de operare pe calculator\r\n Disponibilitate de lucru conform unui program flexibil\r\n Punctualitate, spirit de echipa, atitudine pozitiva, orientare catre client, persoana empatica si creativa\r\n Nu este necesara experienta in call center\r\n Nu avem limita de varsta, va asteptam sa faceti parte din echipa noastra\n\r\nRESPONSABILITATI:\r\n Efectuarea/primirea/gestionare de apeluri\r\n Inregistrarea interactiunii cu clientul in sistemele existente\r\n Identificarea celei mai bune si rapide metode de rezolvare\r\n Indeplinirea obiectivelor specifice per proiect/serviciu\n\r\nBENEFICII:\r\nUn mediu de lucru tanar si competitiv cu reale oportunitati de promovare\r\n Un program de lucru flexibil, atat full time, cat si part time\r\n Pachet salarial fix + bonusuri in functie de performanta\r\n Training specializat si training de comunicare, cat si suport pe parcursul proiectului\r\nComdata Service, apartinatoare a grupului COMDATA SPA, ce detine in Romania 5 sedii in Bucuresti, Constanta, Galati, Craiova si Pitesti.\r\n Prezenti in Romania cu peste 2000 angajati, Comdata se numara printre firmele de prestigiu pe piata de call center romaneasca.\r\n Adresa B-dul Iuliu Maniu, Nr. 7, Corp T, Et. 2, Sector 6, Bucuresti, Romania\r\n Asteptam cv-uri si la adresa mail hrservice@comdata.it  \r\n Pentru mai multe informatii ne puteti contacta la : +40 21.316.05.24 si +40 724.014.052\r\n http://www.comdata.it/ro/home.html \n\n\n", "title": "CONSULTANT RELATII CLIENTI FULL TIME/ PART TIME", "company_url": "http://www.bestjobs.ro/firme/sc-comdata-service-srl/13075060/1", "career_level": "Entry, Middle", "company": "SC COMDATA SERVICE SRL", "locations": "\nIuliu maniu  nr 7, București, Municipiul București, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-consultant-relatii-clienti-full-time-part-time/751276/1"}