{"body": "\n\n\n\nThe Secure Execution Environments team owns and operates the first line of defense for Amazon's confidential customer data. We build the tools and applications that allow the world's most customer centric company to protect our most valuable asset - customer trust.The team maintains a military-class secure system that operates under some of the most stringent security requirements in the world. If you can think like a black-hat in the morning and can outsmart attackers in the afternoon then this role is right for you. If you want to get involved with secure zones, HSMs, Smartcards, key-management systems, intrusion detection measures - get in touch.The Secure Execution Environments team is looking for innovative and enthusiastic engineers who can help build and maintain the systems that protect our customer data.In this extremely visible role, we're looking for engineers excited to build highly efficient and mission-critical systems. If you're interested in the prospect of protecting the customer data, and doing it on a large scale, then this is the team for you. Bachelor's Degree in Computer Science or related field2+ years professional experience in system engineeringComputer Science fundamentals in system design, problem solving, and complexity analysisExperience with performance analysis, systems software, and systems architectureProficiency in at least one programming language such as Perl, Ruby, Python, C, C++ or Java.Operational knowledge & experience of LinuxUnderstanding of TCP/IP networkingAbility to operate in high pressure environment troubleshoot complex issues quicklyAdvanced knowledge of written and spoken English  Experience building complex systems that have been successfully delivered to customersKnowledge of professional engineering practices & best practices for the full system development life cycleAbility to take a project from scoping requirements through actual launch of the projectStrong knowledge of troubleshooting systems and software.Desire to build; sense of ownership, urgency, and drive.Experience in communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs.Experience dealing with secure systems and architecting applications that deal with sensitive information.Candidates should have strong computer science credentials and should be passionate about Internet technology \n\n\n", "title": "Software Development Engineer - SXE", "company_url": "http://www.bestjobs.ro/firme/amazon-development-center-romania-srl/1339336/1", "career_level": "Entry, Middle", "company": "Amazon Development Center (Romania) SRL", "locations": "\nStr. Palat 3E, Iași, Județul Iași, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-development-engineer-sxe/746412/1"}