{"body": "\n\n\n\nPersoana vizata pentru aceasta pozitie va coordona activitatea Agentiei Targoviste, va promova imaginea, produsele si serviciile Alpha Bank in plan local, supervizand si motivand o echipa de profesionisti si va identifica oportunitati de dezvoltare a business-ului; el/ ea va propune solutii personalizate de finantare pentru clienti, stabilind parteneriate de durata, bazate pe un inalt nivel de profesionalism. Responsabilitatile includ de asemenea raportari catre celelalte unitati de business si top management.\n\n\r\nCerinte:\n\n\r\nAbsolvent/a al/a unei facultati cu profil economic;\r\nCel putin 4 ani experienta in domeniul bancar, dintre care minim 2 ani experienta profesionala, preferabil, intr-o pozitie similara (Sef agentie) sau implicand coordonarea activitatilor clientela/ credite;\r\nCunoasterea legislatiei bancare si a regulamentului BNR;\r\nLimba Engleza (scris si conversatie);\r\nAbilitati relevante de coordonare, comunicare si relationare interpersonala, orientare catre clienti si catre atingerea obiectivelor propuse;\r\nGandirea analitica si un inalt nivel de profesionalism sunt calitati necesare;\r\nAbilitati excelente de negociere si vanzare;\r\nCredibilitate, seriozitate, autodeterminare si incredere in fortele proprii, proactivitate, dinamism si capacitatea de rezolvare prompta a problemelor si de prioritizare a obiectivelor tinta, planificate.\n\r\nALPHA BANK ROMANIA apartine unuia dintre cele mai mari grupuri financiare din Grecia, Alpha Bank Group, cu o experienta de peste 140 de ani in sectorul financiar- bancar. ALPHA BANK a fost prima banca straina ce a venit in Romania dupa anul 1990. Banca ofera o gama larga de produse si servicii bancare pentru persoane fizice, cat si solutii complexe de finantare pentru corporatii.\n\r\nAplicantii vor avea ocazia sa se alature unei organizatii renumite, ale carei valori sunt: inovatia, onestitatea, flexiblitatea, inteligenta si siguranta.\n\r\nToate CV-urile vor fi pastrate in conditii de confidentialitate. Doar candidatii ale caror aplicatii sunt selectate vor fi contactati pentru interviu. \n\n\n", "title": "SEF AGENTIE  - TARGOVISTE", "company_url": "http://www.bestjobs.ro/firme/alpha-bank-romania/678/1", "career_level": "Senior, Executive", "company": "ALPHA BANK ROMANIA", "locations": "\nTârgoviște, Județul Dâmbovița, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-sef-agentie-targoviste/751317/1"}