{"body": "\n\n\n\nJob description The QA Automation Engineer is responsible for automating functional and regression test scripts to ensure the quality of Asentinel products. The QA Automation Engineer is responsible for working with the Development team to create and develop automation framework and automate test scripts.  The ideal candidate should have a strong aptitude for comprehending technical concepts and seek out answers even when given minimal instruction and guidance. Excellent interpersonal and communication skills are required.  Develop and maintain framework for automation  Work closely with QA in automating manual test scripts and gathering test data needed for automation  Work closely with developers and other automation engineers to leverage existing framework and tools for automation Design and execute test plans, scenarios, scripts for Automation testing  Document Software Defects using a bug tracking system and report them to software developers  Stepping up when necessary to help team with other duties and responsibilities Desired Skills and Experience Preferred:1+ years Java programming experience  Knowledge of automated testing tools  Experience with open source automation frameworks, Selenium/Webdriver is a plus  Experience in collaborating with development and quality assurance teams  Ability to stage data and to understand the hardware and software requirements for configuring automation environments  Experience with Agile Methodologies is an advantage.  Strong verbal and written communication skills  Strong analytical, technical, and detail-oriented skills  Ability to balance multiple tasks simultaneously and transition between projects  Ability to contribute in a team environment  Programming Language : JAVA (medium)  Education:University studies: Polytechnic University, Faculty of Mathematics and Informatics, ASE (Cybernetics) ,etc. Advantages and BenefitsPermanent Labor Contract, motivating salary based on skills and performance, meal tickets. Medical Insurance The opportunity to develop a career within a stable multinational environment Access to the last software technologies. Training and certification supported by Asentinel  American standard, non-stressful working conditions, excellent green environment, free parking space  American management and company culture  Monthly Parties, Halloween Party, Christmas Party and other recreational activities.   Interviu Online:1.   How long is your experience in Java programming (in months)?2.      How long is your experience in automation programming (in months)?3.  What are your salary expectations for this position?Please provide an estimate range. \n\n\n", "title": "Java Programmer for QA automation (Middle)", "company_url": "http://www.bestjobs.ro/firme/asentinel-international-srl/2845216/2", "career_level": "Middle", "company": "Asentinel International SRL", "locations": "\nStrada Aleea Lacul Morii Nr.3 Sector 6, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-programmer-for-qa-automation-middle/230461/2"}