{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. \n\r\nHoneywell Transportation Systems (TS), part of Honeywell’s Aero strategic business unit, is a leading provider of world-class technologies and solutions to automakers, their suppliers, and consumers. Transportation Systems’ fuel-saving and emission-reducing Turbocharger technologies enhance the efficiency and performance of passenger and commercial vehicles worldwide. Transportation Systems is part of Honeywell Aerospace, one of the Corporation’s three reported segments.\n\r\nHoneywell TS is looking for a Commodity Buyer to join the Romanian office in Bucharest!\n\r\nJob description:\r\n•\tMeet Annual Operating Plan / 5 years strategic planning plan’s performance objectives on his scope, while leveraging Honeywell Turbo Technologies’ global spend\r\n•\tSupport sub-commodity strategy activities on his assigned scope under the supervision of the Commodity Manager\r\n•\tBuild Supplier Panel for the Worldwide / Regions operational requirements (project & production)\r\n•\tEnsure commercial & industrial market expertise of the Sub-Commodity. \r\n•\tKeep Honeywell Turbo Technologies informed of all relevant technological & market trends and economical changes\r\n•\tLead new supplier integration process in the Panel: perform supplier prospection, supplier assessments (CSA), supplier development\r\n•\tEnsure platforms, customer teams current and future needs are identified and answered by his sub commodity strategy\r\n•\tMeet Annual Operating Plan’s objectives on his Sub-Commodity\r\n•\tBuild and consolidates productivity action plans for its sub-commodity (Negotiation etc)\r\n•\tDefine corrective action plans with Operations Buyers to ensure Annual Operating Plan’s objectives are met\r\n•\tConduct negotiations with assigned suppliers\r\n•\tGenerate & consolidate ideas for global projects, collect ideas from suppliers. \r\n•\tBuild business cases when Value Engineering Idea Leader is not in the Sourcing Operations\r\n•\tSupport new product launches in coordination with New Product Introduction team\r\n•\tManage advance purchase for his commodity\r\n•\tManage performance for assigned suppliers: review monthly metrics, lead supplier performance reviews and foster improvement of suppliers’ performance. \r\n•\tLead supplier development projects with the support of Supplier Quality & Development\r\n•\tSupport escalation of operational issues with impacted Buyer\n\n\r\nQualifications required: \r\n •\tUniversity degree\r\n•\tExperience in purchasing - minimum 2 years\r\n•\tNeed to have a level of contract negotiation expertise\r\n•\tVery good negotiation skills\r\n•\tAbility to communicate in English\r\n•\tKnowledge of ERP system.\r\n•\tExpertise in using MS office mainly excel and power point\r\n•\tGlobal mind-set and experience in working with the people from cross culture\r\n•\tGood communication and presentation skills are must for this position\r\n•\tAbility to communicate concisely\n\n \n\n\n", "title": "Commodity Buyer (determined period 1 year )", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Middle, Senior", "company": "Honeywell", "locations": "\nGeorge constantinescu, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-commodity-buyer-determined-period-1-year/752086/1"}