{"body": "\n\n\n\nA job in Vodafone, Network Operations Center is the first step in building a career in the big world of Telecommunications. \n\r\nWe are an elite club, a group of specialists passionate about telecommunications. We are building together the most powerful network for our 400 million clients, as well as support systems, applications and solutions for an organization’s and an industry that evolves at the speed of light.\n\r\nRole purpose:\r\n1st Line Operations of Vodafone Network in a multi-vendor environment.\r\nMonitors and maintains Vodafone Network, dispatches field and 2nd line personnel, performs periodically reports and follow up in order to reach the agreed Network and NOC KPI’s.\r\nPreventive and corrective first level troubleshooting ensuring quality and continuity of service and the restoring time for Vodafone Network elements.\r\nIn collaboration with 2nd Line Operations teams, work out procedures related to the analysis of alarms in order to detect and eliminate faults.\n\r\nKey accountabilities and decision ownership:\r\n- 24h/7days monitoring of the Vodafone Network (RAN, Core, VAS, Fixed), using umbrella fault management systems and specific NMS’s;\r\n- Escalates complex technical problems to 2nd Line Operations in order to solve incidents as soon as possible;\r\n- Dispatches field engineers and contractors, in case of incidents that need local support and follow up the issue until it is solved;\r\n- Provides notifications related to network outages to the management team and trigger the Incident Manager to coordinate the activities to solve the outages;\r\n- Participates at internal and external training sessions in order to permanently improve his/her technical skills.\n\r\nCore competencies, knowledge and experience:\r\n- Knowledge of telecommunication services and technologies (GSM, UMTS, LTE, IP, PDH, SDH, DWDM);\r\n- Capable to understand and to work with different Windows applications (WEB - based);\r\n- Good communication skills;\r\n- Team working oriented;\r\n- Good Knowledge of English and other languages: \n\r\n- German is a big plus;\n\r\nMust have technical / professional qualifications:\r\n- University degree: faculty of Electronics, Telecommunications, Information Technology;\r\n- Nice to have: 1-2 years of experience in Operations and Maintenance activities.\n\n \n\n\n", "title": "Engineer,  1st Line Support", "company_url": "http://www.bestjobs.ro/firme/vodafone-romania/2935259/2", "career_level": "Entry", "company": "Vodafone Romania", "locations": "\nȘoseaua București Nord 2A, Voluntari, Județul Ilfov, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-engineer-1st-line-support/231136/2"}