{"body": "\n\n\n\nSTANDARD STUDIO reprezinta autoritatea cand vorbim despre videochat de calitate.\n\r\nModelele noastre sunt cele mai bune din lume, iar partenerul nostru exclusiv, site-ul Streamate.com este in crestere constanta de peste 10 ani, ajungand la o cota de piata de peste 70%. DA, 70% din TOTI banii care se genereaza in acest domeniu, se genereaza pe Streamte.com.\n\r\nModul de lucru site-studio este total diferit la Standard Studio, adica toate modelele Standard lucreaza pe site ca si modelele independente, primind in totalitate si in mod direct incasarile generate pe contul de model, fara intermediere sau comision din partea Standard Studio.\n\r\nMai mult decat atat, pentru ca sunt exclusive si antrenate de Standard Studio, Streamate.com promoveaza modelele Standard pe site in fata altor modele, asigurandu-le posibilitatea de a genera o gramada de bani din prima zi.\n\r\nCe alte beneficii mai ofera www.streamate.com modelelor Standard Studio?\n\r\nIn afara de:\n\r\n- plati saptamanale si directe site-model fara intermediere si comision din partea studioului\r\n- listare preferentiala din prima zi pe pozitii avansate in lista de modele de pe site, listare care da posibilitatea si modelelor incepatoare sa castige mult de la inceputul activitatii\r\n- training dupa metoda de training American Standard folosita de cele mai bune modele din lume, training care se desfasoara intensiv pe o perioada de pana la 3 luni\n\r\nModelele Standard mai beneficiaza si de:\n\r\n- cadru si echipamente de lucru de ultima generatie\r\n- nivele diferite de comision pe site in functie de nivelul de castig saptamanal, ajungand pana la 83%, fiind cele mai mari din domeniu\r\n- programul de fidelizare Standard Rewards prin care primesc de la site, in plus fata de banii generati, un numar de puncte bonus proportional cu minutele petrecute in chat-ul platit, puncte bonus pe care le pot folosi pentru a-si achizitiona produse care variaza de la genti, pantofi pana la excursii sau chiar masini\r\n- echipa administrativa exclusiv feminina – la Standard Studio nu lucreaza decat modele feminine. Pentru a crea un spatiu intim si relaxant, toate membrele echipei administrative sunt tot femei.\n\r\nStandard Studio este platit de Streamate.com pe baza de CONTRACT, pentru RECRUTAREA si INSTRUIREA modelelor dupa metoda de training American Standard, si nu din banii modelelor. Din 2010 Standard Studio a intrat pe piata din Romania si a antrenat mii de modele, oferindu-le acestora sansa de a-si schimba viata si de a-si asigura un nivel de trai la care nici nu visau inainte. \n\n\n\n\n\n\t\t\t    $(document).ready(function() { \n\t\t\t    var allVideos = $('.job-video-container object, .job-video-container embed, .job-video-container iframe'); \n\t\t\t    var oldWidth = allVideos.width();\n\t\t\t    var oldHeight =  allVideos.height();\n\t\t\t    var aspectRatioOS = oldHeight/oldWidth; \n\t\t\t    allVideos.removeAttr('height').removeAttr('width');\n\t\t\t    function resizeVideoOSJS(){\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%;');\n\t\t\t\tvar widthInit = allVideos.width();\n\t\t\t\tvar heightInit = widthInit * aspectRatioOS;\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%; min-height: 220px; height: '+ heightInit +'px;');\n\t\t\t\t//.attr('width',  widthInit).attr('height', allVideos.height())    \n\t\t\t    }\n\t\t\t    resizeVideoOSJS();\n\t\t\t\t    window.onresize = resizeVideoOSJS; \n\t\t\t    });\n\t\t\t\n", "title": "CAM MODEL/hostess/plati in fiecare vineri!", "company_url": "http://www.bestjobs.ro/firme/standard-studio-srl/12705390/1", "career_level": "Entry", "company": "STANDARD STUDIO SRL", "locations": "\nBldv. Magheru nr. 11 sector 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-cam-model-hostess-plati-in-fiecare-vineri/752069/1"}