{"body": "\n\n\n\nSystems Analyst Business Solutions 6 - Aravo Operations\n\r\nRole Summary:\r\nThe key responsibility of this role is to act as the operations/production support lead for the highly visible Aravo support team for entire GE Oil & Gas, and manage day to day operations using Aravo KYS (Know Your Supplier) tool.\r\nThis will include liaising with internal GE vendor management/global supplier master team, Corporate Oracle SOA (Service Oriented Architecture) support team, business functional teams using Oracle or SAP ERP, technical ERP teams, corporate payment processing team for internal/external suppliers, Corporate and GE O&G indirect supplier team (SSS), and O&G functional program team to ensure on time resolution of buy to pay supplier master issues.\n\r\nAbout GE\r\nGE Oil & Gas is a world leader in advanced technologies and services with 43,000 employees in more than 100 countries supporting customers across the industry—from extraction to transportation to end use. Our unrelenting commitment to the environment, health and safety, quality and integrity defines us: it’s The Way We Work.\r\nWe develop smart solutions for our customers across the oil and gas value chain delivering the innovation,\r\ncustomized service solutions, training programs and technology that helps them to maximize their efficiency,\r\nproductivity and equipment reliability.\r\nWe partner with our customers to develop their next generation workforce; help them to fully benefit from the mega trends of natural gas, the growth of subsea and hard-to-reach reserves and the revolution in asset\r\nhealth management. \n\r\nEssential Responsibilities: \r\n• ‘Aravo Operations Support Lead’ is highly self-managed role, responsible for defined work or projects with moderate complexity,\r\n• This role follows an individual work plan, meets day-to-day short-term objectives, and has the ability to resolve issues through immediate action or short-term planning,\r\n• Serve as technical expert on assigned area’s applications, including code, interfaces, and data flows,\r\n• Responsible for the maintenance of in-place programs; coordinates with project teams and business analysts to translate detailed specifications into new or enhanced application solutions,\r\n• Demonstrate command of multiple programming languages, basic systems analysis techniques, testing, debugging, documentation standards, file design, storage, and interfacing,\r\n• Maintain peer relationships across IM areas (infrastructure, operations, project managers etc.) to provide effective day to day support,\r\n• Review day to day operations process and look for opportunities of process improvements,\r\n• Perform assigned tasks and project assignments in order to meet goals and objectives,\r\n• Assist others in the accomplishment to work assignments through technical leadership,\r\n• Provide technical expertise and counsel to management, other organizations, and special projects personnel,\r\n• Direct the preparation of and approve appropriate reports and communicate status and results,\r\n• Make technical decisions by applying fundamental IT principles and specialized knowledge or skills to assigned tasks,\r\n• Establish the priority of work and assignment of personnel to meet objectives,\r\n• Estimate costs and schedules, recommend resource required and solutions to problems, which arise during the course of a project,\r\n• Serve as a primary interface with internal and external contributing organization relative to technical requirements, directions and problem resolution,\r\n• Collaborate with management in developing technical directions, setting objectives, and setting realistic and challenging goals,\r\n• Implement work activities to meet these plans, monitor progress, and report status,\r\n• Provide timely leadership and direction to supporting organizations,\r\n• Assist in the modification or establishment of operating practices,\r\n• Work with vendor team to prioritize and resolve tickets for L1,\r\n• Collaborate with Aravo program manager to identify problem areas & put long terms fixes,\r\n• Manage communication rhythms with Aravo program manager on status of tickets.\n\r\nMinimum requirements:\r\n• Bachelor's degree in Information Systems, Information Technology (IT), Computer Science or • Engineering (or equivalent in knowledge/experience),\r\n• Experience with supplier master data management,\r\n• Experience in supporting / implementing tier 1 ERP (Oracle/SAP),\r\n• Very good understanding of supplier master data and its function in tier 1 ERPs,\r\n• Strong oral and written communication skills,\r\n• Strong interpersonal and leadership skills,\r\n• Proven analytical and problem solving skills,\r\n• Demonstrated initiative to stay abreast of technology advancements.\n\n\n \n\n\n", "title": "Systems Analyst Business Solutions 6 - Aravo", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-systems-analyst-business-solutions-6-aravo/752484/1"}