{"body": "\n\n\n\nCANDIDAT IDÉAL :\n\r\nWebhelp Roumanie est actuellement une entreprise en pleine croissance à la recherche des collègues enthousiastes, communicatifs, qui aiment bien travailler en équipe.\r\nEtant donné que tu seras en contact permanent avec nos clients, tu apprendras à répondre à leurs besoins et à t’adapter rapidement aux changements tout en ayant une attitude positive.\r\nNous allons travailler ensemble afin de t’aider à maîtriser l’art de la communication et de la relation client pour délivrer un service de la plus haute qualité.\r\nIntègre nos équipes pour enrichir ton expérience professionnelle et apprendre à maîtriser en français les outils de communication et une large gamme d’activités.\n\r\nRESPONSABILITÉS :\n\r\nEffectuer des modifications administratives sur les différents outils de communication, tout en te basant sur les informations communiquées par le client à travers différents canaux de communication (courrier, mail, transfert administratif).\n\r\nBÉNÉFICES :\n\r\nPour t’aider dans ton parcours professionnel, Webhelp Roumanie te propose des formations avancées (rémunérées) qui te préparent pour les missions que tu auras au sein de notre entreprise.\r\nAvec des locaux très accessibles (situés en centre-ville), nous te proposons des horaires de travail flexibles et adaptés à tes besoins.\r\nToutes les promotions sont issues de l’interne et nous mettons tout en œuvre pour t’offrir une carrière professionnelle au sein de notre entreprise.\r\nRémunération attractive (salaire, prime de performance mensuelle et individuelle, subventions, etc.)\n\r\nDESCRIPTION DE L’ENTREPRISE :\n\r\nN°2 des Outsourceurs en France et N°3 en Europe, le groupe Webhelp est un opérateur international en Gestion de la Relation Clients qui a connu la plus forte croissance de son secteur entre 2002 et 2012.\n\r\nLe groupe réalise près de 725 millions d'euros de chiffre d'affaires auprès de plus de 165 clients globaux. Au quotidien, 30 000 collaborateurs sont au contact des consommateurs dans 81 sites de production répartis dans 21 pays : France, Belgique, Roumanie, Portugal, Italie, Suisse, Autriche, Allemande, Pologne, République Tchèque, Pays Bas, Maroc, Algérie, Royaume-Uni, Afrique du Sud, Madagascar, Inde, Suriname et Turquie.\n\r\nWebhelp est le 1er employeur francophone de Roumanie avec plus de 2000 collaborateurs sur ses six sites de Bucarest, Ploiesti, Iasi et Galati. \n\n\n", "title": "BACKOFFICE ADVISER WITH FRENCH", "company_url": "http://www.bestjobs.ro/firme/webhelp/2942498/2", "career_level": "Entry, Middle", "company": "WEBHELP", "locations": "\nStr. Sfintii Voievozi 65, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-backoffice-adviser-with-french/230892/2"}