{"body": "\n\n\n\nThe Mission We are setting up a new development team that will be based in Bucharest but will most likely spend time in Italy, Spain and France. This team of international IT experts will work closely with the local ING colleagues in order to gain knowledge about their banking business and IT practices. We work within the Scrum-Agile methodology. This means that in short sprints, you will bring about new business expectations, from paper to production. Your exact role within a project will depend on the type of project and your technical skills, but the main focus will be on: • gathering the requirements; • designing the functionality; • testing the developments; • implementing maintenance. Your Day-to-Day •Interpret and clarify business requirements and refine the product backlog •Write software development specifications and stories and help estimate the complexity of user stories •Analyze internal processes and work with employees to ensure the system correctly models their latest process •Understand and translate complex business needs / requirements into functional specifications •Ensure the quality of the software and consider non-functional requirements (security, performance, availability or scalability). And manage quality assurance processes to ensure submitted development work meets requirements •Participate in daily scrums with in-house and offshore developers to help ensure that work in progress will meet requirement goals •Collaborate with developers to adapt solutions to the existing environment •Create automated functional tests for user stories and SMOKE. Build and execute (automated) functional and integration tests and (automated) user acceptance and production tests •Roll out new features and provide documentation for clients and employees. Provide support for the business user and other support lines •Look at potential causes for problems and identify alternative approaches of resolution •Quickly troubleshoot and establish functional issues in production What you bring to the team •You are the System Analyst we are looking for, if you understand business requirements from different banking areas , if you can design technical solutions for implementations, and you able to speak the same “language” with developers. •We need your entrepreneurial mindset and communication skills. We depend on your abilities to speak and understand the English language, and we count on you being customer-focused and self-organized. •You also have strong analytical skills and logical thinking, fair knowledge of oriented programming and a good understanding of SQL and database structures. •Deep understanding of SQL / no-SQL databases •You must be able to think strategically, see the bigger picture and question the logic. •Lastly, you are a team player and a facilitator, and you have earned a Bachelor’s or other university degree in IT. Do you recognize yourself in this profile ? If so, join us as a System Analyst at ING SERVICES Why ING ING is a frontrunner in the transformation of banking and a company that puts technology at its heart. Our mission it to empower people to stay a step ahead in life and in business and provide products services that make our customers’ life easier. What enables us to deliver best banking experience is Technology mastered by best IT specialists in the market. Hence, with up to 9,000 IT professionals worldwide, we are constantly striving for innovation, using not only top-notch technologies but also the latest methodologies in software development. In addition to developing products and services aimed at offering best client experience, the IT experience at ING Romania goes beyond local borders. Therefore, in recognition of the high standards of IT engineers in Romania, in 2014, ING opened a Center of Excellence that develops banking software solutions for several countries in Europe. The IT community in ING Romania gathers more than 300 IT specialists and it’s expanding fast. If we caught your eye, let’s chat and see how we can build the bank of the future together !  \n\n\n", "title": "System Analyst - Core Banking", "company_url": "http://www.bestjobs.ro/firme/ing-bank-romania/36692/1", "career_level": "Middle", "company": "ING Bank Romania", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-system-analyst-core-banking/749873/1"}