{"body": "\n\n\n\nBCR Banca pentru Locuinţe S.A.anunta concurs pentru ocuparea postului deSpecialist control riscDirecţia Managementul Risculuila sediul central din Bucureşti(1 post, perioadă nedeterminată)Principalele tale sarcini si responsabilitati: Sa întocmești corespunzător raportările lunare si trimestriale aferente riscului de lichiditate (LCR, NSFR, etc.) si de credit (cerința de capital, expuneri mari, provizioane, etc.) conform legislației bancare in vigoare/Basel III; Sa pregătești orice alte rapoarte, analize si informări solicitate de către structurile interne sau externe interesate (evoluția portofoliului, previziuni asupra indicatorilor de risc, etc.); Să identifici si sa evaluezi riscurile semnificative specifice si impactul lor asupra activității băncii; Să monitorizezi încadrarea in limitele de expunere la riscuri; Sa te implici in  procesul intern de evaluare a adecvării capitalului la riscuri (ICAAP), inclusiv in ceea ce privește simulările de criza; Să contribui la elaborarea/ îmbunătăţirea procedurilor interne ale direcţiei.Tu ai putea fi ocupantul postului, daca poti oferi: Experienţă anterioară în activităţi de administrarea riscurilor în instituţii financiar-bancare de cel puţin 2 ani, cunoașterea reglementarilor BNR si Basel II/III. Studii necesare: facultatea şi diplomă de licenţă, preferabil în domeniul economic  Alte competente profesionale: cunoştinţe economice şi financiare, cunoaşterea economisirii-creditării în sistem colectiv pentru domeniul locativ reprezintă un avantaj,  Limba engleza la un nivel avansat. Germana ar fi un avantaj pentru tine. Cunostinte PC: MS Office la un nivel avansat (Word, Excel, Access). Gândire analitica.Daca tu consideri ca indeplinesti cerintele de mai sus, te rugam sa aplici pe Bestjobs sau sa trimiti Scrisoarea de Intentie si CV-ul detaliat in limba romana si/sau engleza la urmatoarea adresa de e-mail: hr@bcrlocuinte.ro, specificand postul pentru care aplici. Fiecare candidatura va fi tratata cu maxim de confidentialitate. Vor fi contactati doar candidatii care indeplinesc cerintele de mai sus. \n\n\n", "title": "Specialist risc", "company_url": "http://www.bestjobs.ro/firme/bcr-banca-pentru-locuinte/4611488/2", "career_level": "Middle, Senior", "company": "BCR Banca pentru Locuinte", "locations": "\nPiata montreal, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-specialist-risc/229901/2"}