{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a longterm basis, offering at the same time a wide variety of features such asexpertise, challenging development opportunities in an international environmentand the joy of a strong spirit.\n\r\nResponsibilities:\r\n•             Manage the closing for SG EBS processes;\r\n•             Accounts and controls referentialmanagement, \r\n•             Plan and perform audit reviews\r\n•             Perform standard transversalcontrols and review of consolidation packages realized by SG EBS\r\n•             Produce reports for CFOs and otherthird parties\r\n•             Contribute to and supervisePermanent Supervision within SG EBS\r\n•             Prepare all needed reporting forI2C purposes\r\n•             KPI follow-up\r\n•             Answer to internal and external control bodies ( DEVL/COM/CCR, External Auditors, Internal audit, Inspection)\r\n•             Participate to all projects havingan impact on the control framework\r\n•             Become an internal control expertand insure a consultant role in this matter\r\n•             Support accounting SG team indeveloping their competencies\r\n•             Develop relationships with other departments to have a high quality closing;\r\n•             Propose process improvements;\r\n•             Alert head of QCM and of productionteams in case of blocking issues.\n\r\nRequirements: \r\n•            Strong academic record in Finance & Accounting, (Academy of EconomicStudies of Bucharest)\r\n•             Minimum 2 years of relevant experience in audit\r\n•             Examination and analysis skills\r\n•             Decision Making and/or problem solving skills\r\n•             Fluent with French and English\r\n•             Self control and open-mindedness\r\n•             Excellentcommunication & team player\n\r\nPlease note that only the selected candidates will be contacted for an interview and all the CVs will be kept in our database for future suitable professional opportunities.\n\r\nSociété Générale European BusinessServices is a player in the shared service center market and delivers highadded value services in various fields of activity for worldwide entities ofthe Group (finance/ accounting, procurement, human resources and IT).  The company is currently serving over 20countries mostly across Europe for all major business lines of the SociétéGénérale Group.\n\r\nThe Finance Shared Service Center of SociétéGénérale European Business Services, launched in 2011, now counts more than 250staff delivering services for more than 300 client entities.\n\r\nThe team’s activity consists indelivering two important kinds of processes: accounting – namely Groupreporting in IFRS, statutory and regulatory reporting on top of the permanentsupervision activities and related set of control; and Account Payable and Travel& Expenses, with teams specialize in optimizing all procure to payactivities. \n\n\n", "title": "Financial Controller/Auditor with French", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-financial-controller-auditor-with-french/750628/1"}