{"body": "\n\n\n\nOBJECTIVE OF THE JOBHas overall responsibility for a variety of reporting tasks. Extracts, compiles and interprets key operational and statistical data. Ultimately, s/he will be responsible for the overall approach to reporting and analysis within the GSC.Develop new processes to increase the effectiveness of reporting and consolidate & maintain departmental reports used internally and externally by parties such as to other departments, senior management, etc Develop and maintain new standardized reporting on a routine basis, i.e., define, create, automate, and maintain operational recurring reports.Maintain a reporting schedule and documentation of reporting procedures. Generate and maintain control documentation of reporting procedures to comply with governance audits and regulatory requirements. Will also build audit process to ensure data integrity and efficiency.Perform ad hoc duties in accordance to business needs.RESPONSIBILITIESBuild / design new reports based on new report requestsEvaluate the effort needed for building specific reportsMaintenance of existing reportsMaintenance of reporting portalMaintenance of the reporting environmentThe position will consist of three main service areas:automating procedures for data extraction from the GUI of various tools published on several Citrix farmsdeveloping, mentaining and modifying the BI platform used for reporting for the NOCporting of reports from the old reporting system to the new BI platformREQUIREMENTS:Previous experience on a similar Reporting job;University graduate (Computer Science, Cybernetics or similar)Strong knowledge of Excel, including VBA programming (in order to manage / develop custom reports)Strong knowledge of SQL, PL/SQL, SQL ServerKnowledge of Business Objects (in order to manage / develop reports in BO)Knowledge of PhP would be an advantage (in order to manage / develop the Reporting Portal)(Optional) technical skills:Action Script & Flex - Eclipse AXDTJava SE - SwingJSP + Java SE / advancedPhp / advancedLinux shell scripting / advancedC++ / advanced(Optional) knowledge of:Object Oriented ProgrammingAJAXTemplate MatchingWindows ServerCitrixOracle VM(Optional) experience with: Citrix and Oracle VM\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\n", "title": "Reporting Engineer", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reporting-engineer/749243/1"}