{"body": "\n\n\n\nResponsabilităţi:  \n\r\n•\tplanifică agenda de lucru a Directorului General şi îl asistă în activitatea sa zilnică;\r\n•\tîntocmeşte şi publică minuta sedinţelor echipei de management;\r\n•\torganizează deplasările şi monitorizează cheltuielile de deplasare conform bugetului;\r\n•\tcolectează, analizează şi sintetizează informaţiile necesare pentru întocmirea rapoartelor şi situaţiilor solicitate de către Directorul General;\r\n•\tmenţine un flux comunicaţional interdepartamental;\r\n•\tachiziţionează şi gestionează necesarul de birotică conform bugetului;\r\n•\torganizează activităţile din cadrul programului de Customer Care implementând şi menţinând standardele companiei;\r\n•\tasistă din punct de vedere al transportului şi al rezervărilor vizitatorii şi angajaţii, monitorizând întocmirea formularelor necesare;\r\n•\trăspunde de afişarea şi actualizarea informaţiilor, organigramelor, indicatorilor, a listelor de vizitatori, a panourilor de comunicare şi a altor materiale;\r\n•\tasigură suport pentru orice alt proiect iniţiat în cadrul companiei;\r\n•\trăspunde de respectarea legislaţiei în vigoare;\r\n•\tcoordonează respectarea programărilor în sălile de conferinţă;\r\n•\talocă numere pentru conferinţe telefonice;\r\n•\tîntocmeşte situaţii şi rapoarte specifice activităţii manageriale asigurându-se de acurateţea datelor\r\n•\tîn calitate de membru al echipei Managerului General, are întotdeauna o atitudine de profesionalism, integritate şi de responsabilitate faţă de toţi angajaţii;\r\n•\tpăstrează confidenţialitatea asupra informaţiilor cu care intră în contact. \n\r\nCerinţe:   \n\r\n•\tstudii superioare;\r\n•\tgândire analitică;\r\n•\tpersoană organizată, motivată şi disciplinată;\r\n•\tcunoştinţe solide de Microsoft Office;\r\n•\tcunoştinte avansate de limbă engleză;\r\n•\tabilităţi excelente de comunicare;\r\n•\tatitudine proactivă. \n \n\n\n", "title": "General Manager Assistant", "company_url": "http://www.bestjobs.ro/firme/celestica-romania-s-r-l/1568008/1", "career_level": "Middle", "company": "Celestica(Romania)S.R.L.", "locations": "\nBors,sos.Borsului ,nr.88, Oradea, Județul Bihor, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-general-manager-assistant/750592/1"}