{"body": "\n\n\n\nCompany Summary\n\r\nSince 1911, we have been part of society’s progress on five continents … and we’re not done! Our teams bring together some of the most skilled professionals anywhere. People like you, who have the desire to stretch their talents. By joining SNC-Lavalin, you’re seizing the chance to grow with a leader in engineering and construction offering challenges that never cease to inspire. Take this opportunity to go further. \n\r\nSNC Lavalin, a leader in engineering and construction, is actively recruiting the best and the brightest for our shared services center in Romania. This is your chance to showcase your skills by joining one of our world-class projects teams. \n\r\nGlobal Information Technologies (GIT) \r\nContributes to SNC Lavalin's operational excellence by offering, complete, cost effective and efficient technological solutions for our business units and partners. \n\r\nGlobal Financial Shared Services Center (GFSSC) \r\nOptimizes and standardizes finance processes and systems to streamline transaction based activities into one centralized location.\n\r\nSUMMARY OF THE POSITION: \r\nThe Developer will take part in the development and support of business applications for the firm’s business units. The job is in the GIT (Global Information Technology) department. \n\r\nWe are looking for someone with at least 2-3 years experience.\n\r\nYou will join a multi-national team of .Net Developers, DBAs, Architects, Project Managers, Analysts, etc. working on a large and diverse portfolio of applications (EDI, ERP, CRM, BI, Helpdesk, support) \n\r\nResponsibilities: \r\n• Develop or modify applications or systems functionality using .Net and SQL.\r\n• Write technical specifications or user needs from existing functional specifications.\r\n• Develop and execute unit tests and integrated tests to ensure that the system satisfies the requirements.\r\n• Develop and perform functional tests\r\n• To participate in impact assessments and efforts to implement various projects or applications\r\n• Participate in the customization, analysis of changes on company applications\r\n• To work closely with other members of the development team and other teams in GIT\r\n• Advise users in defining their needs (processes and systems);\r\n• Identify, write and review documents to be produced as part of projects or requests; \r\n• Assess project or request impacts and completion efforts\r\n• Support execution team;\r\n• Perform quality assurance process on the team’s various deliverables \r\n• Evaluate, in collaboration with the development team, the impacts and the efforts involved to realize the projects or requests for change\r\n• Work in close collaboration with the other members of the development team as well as with the other members of the GIT teams\r\n• Support the users in their preparation and realization of their system tests\r\n• Perform quality assurance on the different deliverables produced by the team\r\n• Share and document knowledge with team members, deliver training and knowledge sharing and attend cross-training for applications\n\r\nREQUIREMENTS: \r\n• Bachelor Degree in computer science and more than 3 years of experience\r\n• System development analysis (essential)\r\n• Relevant experience with Microsoft SQL Server 2012, 2008 (SQL knowledge is essential) \r\n• Relevant experience with .Net (essential)\r\n• Experience with Visual Studio 2010, TFS \r\n• Knowledge of software development methodology\r\n• Experience of object-oriented design analysis with UML or other standard (asset)\r\n• Experience in using and customizing BMC Service Desk Express (big asset)\r\n• Experience with the use of SharePoint technology\r\n• Knowledge of process management tools (asset)\r\n• Documentation for changes or for knowledge sharing\r\n• Interpersonal and teamwork skills\r\n• Organization and scheduling  skills\r\n• Analytical ability and capacity for synthesizing\r\n• English (both spoken and written). French would be an asset\n\r\nWe offer:\r\n• A friendly and professional working environment\r\n• Career development\r\n• Motivating salary\r\n• Opportunities to learn and grow in a multi-national company\r\n• A-class office facilities \n\n\n", "title": "Database Developer with .Net", "company_url": "http://www.bestjobs.ro/firme/snc-lavalin-romania/12574356/1", "career_level": "Middle", "company": "SNC Lavalin Romania", "locations": "\nDimitrie Pompeiu 5-7, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-database-developer-with-net/751511/1"}