{"body": "\n\n\n\nReady to make $30,000 USD while working for a fortune 500 company from the comfort of your home? Eager to join a network of the most talented remote workers in the world? If so, this role is for you. Work for Crossover, and you’ll earn the most competitive wages on the market, collaborate with the most skilled teams in your field, and work for the most elite companies in the world. Sound too good to be true? Take a closer look… What to Expect as a C# Engineer at CrossoverCrossover is looking for software engineers that are ready to utilize their experience in a comprehensive and multidimensional leadership role. Responsibilities will include writing and debugging both unit and integration tests for enterprise applications. You will also be expected to effectively execute the transition of current code to new technologies and update third party components. Lastly, you will take ownership of the process of identifying dependencies and performing code reviews, helping us to maintain Crossover’s standard of excellence throughout the process.Qualifications for this OpportunityIf you want to work with the best, you have to be the best. A successful C# Engineer at Crossover will demonstrate the following qualifications:- 3+ years of experience as a software engineer using C#.NET - A ruthless commitment to testing the code you’ve written - Extensive problem solving skills - An ability to communicate clearly regarding complex issues (in English) - Proficiency in the following skills and technologies is mandatory: - Visual Studio .NET - Web Services - REST - Database (SQL server, Oracle, MySQL) - Enterprise applications - Web API, WCF, MVC, and ASP.net - Proficiency in the following technologies is desired but not mandatory: NHibernate, Design - patterns, noSQL CompensationAt Crossover, you’ll earn extremely competitive wages while enjoying the flexibility of working from virtually anywhere on the face of the earth:- Salary: 15 USD/hr - Position type: Full time (40 hours per week) - Location: Global The Type of C# Engineers We’re Looking ForCrossover values a culture of excellence. We need engineers who are not only technically proficient, but also demonstrate the following qualities:- Willingness to embrace the concept of iterative development as the means for building seamless products - Readiness to give all the effort necessary to do an excellent job - even if it means putting in extra time to research the problem you’re facing - Perfectionism: knowing how a job should be done and not stop until it’s done correctly Next StepsReady to join? Start the process now by applying through our application link. If you meet the qualifications, we will proceed with a series of tests and interviews. Crossover is eager to see what you have to offer our cutting edge global workforce. \n\n\n\n\n", "title": "C# Software Engineer - $2500/month", "company_url": "http://www.bestjobs.ro/firme/crossover/13728342/5", "career_level": "Entry, Middle", "company": "Crossover", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-c-software-engineer-2500-month/198921/5"}