{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. For our strategic business group TS (Transportation Systems), we are searching for a Senior Finance Analyst to join the Romanian office in Bucharest! If you have:MBA/ University Finance degree Minimum 5 to 7 years financial experience with a large multinational company preferred and previous experience in financial planning in Analysis as a plus Strong finance background Strong Microsoft Excel & PowerPoint skills Ample knowledge of ERP Tools (e.g. SAP, Hyperion) Technical expertise in Finance Planning and Analysis: Income Statement, Balance Sheet and Cash Flow, Consolidation Excellent level of numeracy with high standard of personal integrity and decisiveness Strong problem solving and influencing skills Results driven approach Excellent written and communication skills Pro-active approach and the capability of working on own initiative The ability to synthesize information and proved senior leadership with necessary information to make a strategic decision then join us because you are the senior financial analyst we are searching for!The Senior Financial Analyst supports the global consolidation of TS forecasting process: Annual Operating Plan, 8+4, 5+7. Offers support for monthly closing reporting for TS globally. Responsible for all TS warranty related topics. Responsible for overseeing Worldwide Fixed Costs, for following up and challenging variances explanations Forecast / AOP (annual operating plan) vs. Baseline and Actuals vs. Forecast / AOP. The position also involves driving streamlining and standardization of FP&A (financial planning and analysis) processes in line with HOS (Honeywell operating system) deployment. It reports to Senior FP&A Finance Manager and requires working with Senior Finance Leadership & the Business Analysis & Planning Group in Morris Plains. As your main responsibilities, you will:Be the Leader of forecasting for all forecasts and AOP processes Support on Consolidation of Annual Operating Plan globally for HTT (Honeywell Turbo Technologies), and TS and submission to the HQ in Morris Plains Support Consolidation of forecasts (5+7, 8+4) Be responsible for accurate and timely corporate reporting Be the Leader of Fixed Costs risks and opportunities, responsible for consolidation of data and provision of quarterly estimates for forecasts Be responsible for monitoring and challenging Fixed Costs areas which exceed targets Be the main point of contact for provision of variance explanation versus AOP, latest forecast and previous year for Fixed Costs Be the leader of Closing Deck consolidation to present monthly results to TS Leadership Be the Leader of all TS warranty-related topics including calculation of warranty, provision of explanations for warranty worldwide, allocation per customer and quarterly corporate reporting ($10M yearly spent) Be the Leader to provide Worldwide Fixed costs variances on a monthly basis ($485M yearly spent) Be responsible for provision of month-end variances analysis for Asian and North America sites Team up with other TS Finance members to drive TS towards financial commitment presented in AOP, SRO, forecasts: fixed costs, warranty, free cash flow Maintain and provide extensive and comprehensive business analysis and reporting Be Daily engaged with the TS FP&A Director and Senior Managers to define financial commitments and drive the business towards those targets on FCF (free cash flow), Fixed Costs and Warranty Be daily engaged with the TS FP&A Senior Managers and Director to Lead Forecast / AOP Process and P&L analytics for Monthly Closing Be the Leader to provide AOP and monthly variances basis for Worldwide Fixed Costs ($485M) and warranty ($10M) Be driving streamlining and standardization of FP&A processes Have regular contacts with group to ensure any request at Corporate level on SBG (strategic business group) performance are answered Want to learn more? Visit:Our career website: www.careersathoneywell.comChannel: http://www.youtube.com/watch?v=CcMf_TFS0kAhttp://www.youtube.com/watch?v=Tj8Jr2USl4M \n\n\n", "title": "Senior Finance Analyst (job no. 00306548)", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Senior", "company": "Honeywell", "locations": "\nGeorge constantinescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-finance-analyst-job-no-00306548/749396/1"}