{"body": "\n\n\n\nSystem Developer, Support Tools – Timisoara\n\r\nWe have a challenging opportunity for an ambitious System Developer to join the Support Tools team in Visma Software. The team is responsible for delivering the “Support panel” which is a module available from all other Visma Software services and exposed to thousands of end users. The end user is to find answers to his/her questions about a Visma service via the Support panel, either self-service or by contacting Visma. The Support panel is central in Visma’s communication strategy.\n\r\nThe Support panel is built on the Microsoft .Net Framework stack. As a System Developer you will work with design and implementation of new features, with some maintenance and with writing automated tests. You will be working according to agile and lean principles and participate in Visma’s  exciting transition to continuous delivery on Azure.\r\nOur products have many integrations and dependencies, so having experience with integration techniques and knowledge about how to achieve high performance and reliability is important.\r\nWe value code quality and use of patterns, and we expect that you have a conscious attention towards quality in all deliveries. The team is located in 3 countries: Norway, Sweden and Romania. The work language is English. \n\r\nResponsibilities and work tasks:\r\nParticipating in modelling and architectural analysis, design and work estimation\r\nImplementation of new features\r\nWriting unit tests and participate in testing of solutions\r\nKeeping up-to-date on new technologies, methods and tools related to the development processes\n\r\nWe believe that you have:\r\nBachelor or Master’s degree in computer science\r\nExperience as a developer working with C# and Microsoft’s web stack : ASP.NET MVC, ASP.NET Web API\r\nExperience with web development: HTML5, CSS, JavaScript\r\nKnowledge about SQL databases. \r\nGood knowledge of design patterns and web design frameworks.\r\nKnowledge about unit testing, web application testing tools like Selenium WebDriver and JavaScript testing frameworks is a plus\r\nHands-on experience with  Test Driven Development, Continuous Delivery in Azure is a plus\r\nGenuinely interested in technology with focus on open standards, systems integration, SaaS architectures, Web services/SOA\n\r\nPersonal skills:\r\nWell-structured and quality focused attitude\r\nTeam spirit and good communication skills\r\nAnalytical mind-set and well organized with attention to details\r\nSelf-motivated and self-driven\r\nUser experience and customer satisfaction oriented\r\nFluent in English speaking and writing\n\r\nWe will offer you:\r\nExciting position in an international working environment \r\n(R&D community of 600 employees). \r\nYou will be part of a dynamic and highly skilled team.\r\nWe offer you interesting customer segments, a creative working environment and the latest technologies and tools.\r\nGood opportunities for career development working in different projects and in a large extensive international company. \r\nCompany apartments in Spain and France.\r\nCompetitive terms and conditions.\n\r\nWork place will be Timisoara.\n \n\n\n", "title": "Javascript/Web Developer", "company_url": "http://www.bestjobs.ro/firme/visma-software-srl/4281317/2", "career_level": "Middle", "company": "VISMA SOFTWARE SRL", "locations": "\nCoriolan brediceanu, Timișoara, Județul Timiș, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-javascript-web-developer/231097/2"}