{"body": "\n\n\n\nJOB DESCRIPTION: A developer has to listen to its clients, analyze, propose solutions, conceive, develop and test IT applications.  He has to take charge of both corrective and evolutive maintenance of the IT applications. He can participate in the business analysis of a project. He provides technical or functional support to its client or IT subsidiaries when needed and proposes a technical and/or functional analysis from the specifications received. Also, the developer: evaluates the proposed solution; builds the technical conception; produces technical documentation (technical conception, test reports…); develops in accordance with the rules of developments; develops and tests the solution with the respect of the deadlines; is responsible for the Software Configuration Management (SCM); provides N3 support or expertise; proposes workaround, temporary correction and/or definitive solution to a bug; fixes production bugs in the respect of the SLA. Follow-up activity : is able to make an accurate reporting of is activity and warns or alerts at the right time if needed. The candidate should be willing to travel 3 months to Munich.MANDATORY SKILLS: •\tJava/ JavaScript/ HTML5/ CSS3 ;•\tStruts, Spring, Junit / Mockito / JMock, EJB, APIs, WebServices (Axis / JAX-WS), JDBC / JPA / Hibernate,  JMS / CTG, JQuery ;•\tProgrammation in Java 7 ;•\tTools & Technologies J2EE, Spring, Hibernate, Maven, Git, Jenkins, Tomcat, Selenium, StackOverflow, Jira ;•\tWeb-services REST/SOAP ;•\tIDE IntelliJ ;•\tTest jUnit/mockito, powerMock, easyMock, unitils ;•\tUML ;•\tSQL language and relationship DB deep knowledge ;•\tSignificant experience in the developments of JAVA Applications ;•\tSignificant experience in testing methods ;•\tFluent in English  ;•\tAptitude to communicate orally and in writing ;•\tTeam work ;•\tAnticipation and reactivity ;•\tCapacity to argue ;•\tAbility to manage stress ;•\tOrganized and rigorous.BENEFITS: •\tMotivating salary;•\tGood working environment;•\tMedical insurance;•\tAnnual team building;•\tTrainings and certifications. \n\n\n", "title": "Java Developer", "company_url": "http://www.bestjobs.ro/firme/incrys/701643/1", "career_level": "Middle", "company": "InCrys", "locations": "\nStrada Anastasie Panu nr. 50 et. 1 sector 3  Bucuresti, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer/748537/1"}