{"body": "\n\n\n\nRed Mountain Management (RMM) is a Romanian consultancy company activating within the financial investment services market. Due to our registered business growth based on large partnerships with important international players, we are currently looking for highly dynamic professionals to join our team.\r\nYour career starts today, step into the financial market supported by a world leading company.\r\nTake a leap forward, gather new experience and evolve both professionally and personally. Red Mountain Management has a partnership with a revolutionary company in the binary options industry, due to its recognized experts in the trading assistance department and also due to the competitive financial products made available. Our partner achieves an outstanding performance with and an impressive expansion with the best team of experts and the best financial products.\r\nResponsibilities:\r\n-\tResponsible for maintaining and developing successful business cooperation with the international prospects in order to build and maintain their interest and satisfaction in the company’s products.\r\n-\tProviding all the necessary information and assistance in a professional and accurate manner for growing the share of the products and services based on the company strategy.\r\n-\tAttracting the potential client’s attention and turn that interest into sales.\r\n-\tMaking efforts to identify and anticipate the client needs and beyond current service relationship.\r\n-\tManage the relationship with the client through CRM and all available communication channels. \n\r\nDesired Experience and Skills:\r\n-\tAdvanced English skills both spoken and written. \r\n-\tAny other language is considered a PLUS.\r\n- Computer literate.\r\n-\tExperience in sales/consulting/call center/ capital markets is desirable.\r\n-\tAbility to build rapport and trust, in an excellent telephone and email manner, with a friendly and informative approach.\r\n-\tHighly customer-focused.\r\n-\tComfortable working independently, but also with a strong team-spirit.\n\r\nBenefits:\r\n- Motivating position and unique chance for professional development in the local office of a major international company.\r\n- Dynamic, multinational work environment in a young team & young startup branch - free of slow corporate procedures & regulations.\r\n- Opportunities for personal development through training courses.\r\n- Competitive remuneration package based on fixed salary+bonuses+commissions.\r\n- Medical insurance.\r\n- Professional training and ongoing coaching.\n\r\nIf you enjoy being challenged over and over again, but also to have fun, Red Mountain Management will be the best place for you to work. \n\n\n", "title": "Account Manager with English", "company_url": "http://www.bestjobs.ro/firme/red-mountain-management/13597751/5", "career_level": "Entry", "company": "RED MOUNTAIN MANAGEMENT", "locations": "\nAcademiei 28-30, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-account-manager-with-english/202313/5"}