{"body": "\n\n\n\nNe-am inceput activitatea in 2007 si cei 8 ani de experienta si-au spus cu siguranta cuvantul in standardele dupa care ne ghidam in acest moment. Suntem o echipa tanara, creativa, motivata si ceea ce ne defineste si ne place cel mai mult este faptul ca venim la munca de placere, crestem impreuna si ne completam reciproc. Dar...momentan lipsesti TU din echipa noastra!\n\r\nDescriere:\n\r\n- Crearea, realizarea si modificarea design-ului paginilor web din portofoliul nostru.\r\n- Asigura mententanta si aduce imbunatatiri site-urilor actuale ale companiei.\r\n- Colaboreaza si interactioneaza cu echipa de marketing in vederea implementarii de noi functii pe site-uri.\r\n- Se implica in campanii de promovare pe Google, Facebook, Twitter etc si alte surse de generare trafic.\r\n- Jobul se adreseaza persoanelor interesate de un program full-time, pe termen lung.\n\r\nCerinte:\n\r\n- Cunostinte avansate de Adobe Photoshop sau orice alt soft profesional de editare grafica.\r\n- Abilitati de design si cunostinte de HTML5 si CSS3.\r\n- Optimizare SEO, propunere de solutii si implementarea acestora in vederea imbunatatirii traficului.\r\n- Cunostinte deployment site-uri (CPanel, FTP... etc.).\r\n- Cunostinte de baza pe partea de backend a site-urilor, PHP, MySQL, JavaScript.\n\r\nAlte Cerinte:\n\r\n- Abilitatea de comunicare, lucru in echipa.\r\n- Persoana creativa si care poate propune solutii la problemele intalnite.\r\n- Atentie la detalii, persoana organizata.\r\n- Este capabil sa invete, se adapteaza la schimbari.\r\n- Portofoliul de proiecte este obligatoriu.\n\r\nAvantajele Postului:\n\r\n- Orar flexibil, full-time.\r\n- Colectiv tanar si dinamic.\r\n- Laptop.\r\n- Salariu motivant.\r\n- Seriozitate.\r\n- Investim in cresterea si dezvoltarea ta – asiguram participarea la cele mai bune cursuri.\r\n- Bonusuri de performanta pe baza unor KPI’s.\n\r\nDaca te potrivesti cu descrierea si te vezi colaborand cu noi, asteptam CV-ul tau! \n\n\n", "title": "WEB Designer", "company_url": "http://www.bestjobs.ro/firme/chatup/14209511/5", "career_level": "Entry, Middle", "company": "ChatUP", "locations": "\nStrada Eșarfei 60, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-web-designer/211149/5"}