{"body": "\n\n\n\nVisma\n\r\nVisma makes businesses more efficient, through offerings of software, outsourcing services, commerce solutions, retail-IT solutions and IT-related projects and consulting. Visma simplifies and digitalizes core business processes within the private and public sector. 340,000 customers in Northern Europe utilize Visma’s products and services and an additional 330,000 use Visma as a hosting partner. The group has 7000 employees and its net revenue amounted to NOK 7 000 million in 2015.\n\r\nVisma is known for developing leading software and high-quality services for satisfied customers in combination with financial strength and solid growth. The objective is to make the customers more efficient and competitive through freedom of choice between software solutions and outsourcing services.  \n\r\n.net Software Developer\n\r\nWe have a challenging opportunity for an ambitious and motivated Software Developer to join our Visma User Directory team. We are building an User Directory and Single Sign-On (SSO) solution that is an important component in Visma’s drive for integrated products & services toward hybrid strategy. You will work in R&D office from Sibiu, together with colleagues in Norway and Romania - and a lot of colleagues from the other teams spread in locations from nordic countries.\n\r\nAs a Software Developer you will be working with design, implementation and maintenance of new and existing features of our VUD asset. In your work you will need to focus on architecture, usability, performance, stability, security, etc.\n\n\r\nWork tasks and responsibilities:\n\r\n•\tDesign, implementation and testing of solutions\n\r\n•\tParticipate in architecture, design and code reviews\n\r\n•\tWrite unit and integration tests\n\r\n•\tMaintain good code quality\n\r\n•\tKeeping up-to-date on new technologies, methods and tools\n\r\n•\tParticipate in our Scrum processes and other team activities\n\n\r\nWe believe that you have:\n\r\n•\tBachelor or Master degree in Computer Science\n\r\n•\tExperience in C# and Microsoft technology stack\n\r\n•\tSolid Object Oriented Programming knowledge, design patterns\n\r\n•\tKnowledge of and experience with SQL databases - modelling and development\n\r\n•\tHands-on experience with unit testing & Test Driven Development, knowledge about other types of tests and tools is a plus\n\r\n•\tUnderstanding of security, certificates and identity providers is a plus\n\r\n•\tInterest in software engineering methods, design patterns and modelling\n\r\n•\tGood spoken and written English\n\n\r\nPersonal skills:\n\r\n•\tWell-structured and quality focused attitude\n\r\n•\tTeam spirit and good communication skills\n\r\n•\tAnalytical mind-set and well organized with attention to details\n\r\n•\tSelf-motivated and self-driven\n\r\n•\tUser experience and customer satisfaction oriented\n\n\r\nWe will offer you:\n\r\n•\tAn exciting position in an international working environment (R&D community of 600+ employees)\n\r\n•\tYou will be part of a dynamic and highly skilled team\n\r\n•\tWe offer you a creative working environment and the latest technologies and tools\n\r\n•\tGood opportunities for career development in a large international company\n\r\n•\tCompetitive terms and conditions\n\r\n•\tInternational travels for trainings and workshops\n\r\n•\tAccess to company apartments in Spain and France\n\n\r\nPosition: full time\r\nLocation: Sibiu, Romania\n \n\n\n", "title": ".net Software Developer", "company_url": "http://www.bestjobs.ro/firme/visma-software-srl/4281317/2", "career_level": "Middle, Senior", "company": "VISMA SOFTWARE SRL", "locations": "\nAv. Ilie Macelaru nr.2, Sibiu, Județul Sibiu, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-net-software-developer/230734/2"}