{"body": "\n\n\n\nThe ideal candidate:  - College graduate / college student, in Computer Science or a related field  - Should be willing to learn new things  - Good communication skills, the capacity to work within a team  - Individual responsibility and a strong desire for personal achievements  - Should have the desire to evolve towards a very good professional & technical levelMandatory requirements:  - Strong knowledge concerning algorithms, data structures, OOP  - Good C++ skills (at least intermediate level)  - Good English skills (at least intermediate level)The following requirements are NOT mandatory, but they are a plus:  - Practical experience with writing Windows applications  - Being familiar with .NET Framework or ASP.NETJob description:   - Software development in .NET / ASP.NET / C++, for a wide range of applications: multimedia, document management, business management, mobile development, web development, networking etc.   - Team members (who stand out from a technical and human perspective) have the opportunity to advance towards higher management positions within our companyThe benefits of working at SBP:  - We offer flexible working hours & part-time options, so that you can balance your work schedule with your college schedule & personal time  - We offer competitive salaries, periodical raises, performance bonuses & gratifications  - You will enjoy the opportunity to be part of a pleasant and friendly team, who shares the same values. You will learn on a daily basis and you will be able to develop your career in a professional environment, among colleagues that are ready to assist you and to help you grow  - The possibility of working (in alternation) on a variety of projects & technologies. Each of our colleagues belongs to several project-teams  - Permanent feedback, performance evaluations on a monthly basis  - Close communication within the team. The possibility of bringing suggestions & raising issues directly to the management  - Technical training on a wide variety of technologies, to cover the different types of projects & platforms that we use in our projects.Other benefits:  - Private healthcare (Medlife)  - Gym membership discount (World Class Fitness)  - Open space terrace  - Nap rooms  - Relaxation room (equiped with PS4, large screen TV, laptop, books etc.)  - Fresh fruits in the office. Regular dinners with the team. Teambuilding \n\n\n", "title": "Software Developer .NET/ C++", "company_url": "http://www.bestjobs.ro/firme/software-business-partners-srl/3062736/2", "career_level": "Entry, Middle", "company": "Software Business Partners SRL", "locations": "\nStr. Valea Oltului 123-129 et. 3 si 4 Sector 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-developer-net-c/230498/2"}