{"body": "\n\n\n\nEricsson Overview: Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.Job Summary:Drives internal communication activities in order to secure engaged employees who live the brand, secure strategies and targets communication; Ensures consistent communication within Ericsson;Drives the creation and implementation of communication plans; Coaches and advises the development of communicative leadership among managers.Responsibilities & Tasks:Designs communication solutions in support of business needs and strategy;Creates messages with stakeholders;Coaches and advises managers on communication;Develops communication channels;Evaluates and improve internal communications.Main interfaces:Ericsson Sourcing and other units; Unit's Management Team;Other employees within the unit. Position Qualifications:Core CompetencesBrand Knowledge and Skills (Brand platform knowledge);Business Understanding;Excellent communication skills; Market Insight;Project Management Skills; Coaching & Mentoring Skills; Audio/visual Production Skills; Negotiation & Argumentation Skills; Excellent written and spoken English language skills.Preferred Qualifications & Experience Requirements5 years ‘experience within internal communications field in multinational environment;Bachelor’s Degree from University required, preferably within Communications, Business Administration, Finance, Economics, or Education;High level of expertise in relevant communications tools and practices.Behavioural CompetencesCreating & Innovating;Writing & Reporting;Working with people; Relating & Networking;Adapting & Responding to Change;Planning & Organizing. \n\n\n", "title": "Internal Communication Specialist", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-internal-communication-specialist/749027/1"}