{"body": "\n\n\n\nJob Description\n\r\nJob Description:\r\n\tThe Verification Engineer is required to work closely with Ceragon VLSI group in designing and developing chips, participating in emerging talented group. The job offers the opportunity to verify complex devices from initial stages of development and design over AISC or FPGA platforms. It also offers exposure to definition of silicon making methodologies from architecture towards release to production, working closely with a dynamic and motivated team. \n\r\nVerification Engineer responsibilities:\n\r\n•\tDevelop verification Environment for various platforms – FPGA or ASIC. Implementing under top notch methodologies.  \r\n•\tResponsible for Various IPs (PHY, Networking IPs etc) and SOC Verification\r\n•\tDefining Test plans, coverage plans etc\r\n•\tWorking closely with Ceragon system team ensuring correct implementation wrt the Ceragon FibAir products requirements\n\r\nJob Requirements\n\r\nThe ideal candidate has the following:\n\r\nMust:\n\r\n•\tPreferred university background – Automatics/Computers, Electrical Engineering\r\n•\tAt least 3 years experience with Specman or System Verilog based verification ( specman is preferred )\r\n•\tIn depth understanding of overall verification methodologies\r\n•\tBackground in Networking IPs and SOC architecture\r\n•\tUnderstanding of verification and design practices\n\r\nAdvantage: \n\r\n•\tExperience with RISC processors \r\n•\tExperience with C coding\r\n•\tVerilog\n\r\nWe are looking for candidates capable of self-learning and working in a dynamic environment, with excellent communication skills and team player, capable of grasping an overall view of complex systems. \n\n\n", "title": "Verification Engineer", "company_url": "http://www.bestjobs.ro/firme/ceragon-networks-srl/13228347/1", "career_level": "Middle, Senior", "company": "Ceragon Networks SRL", "locations": "\n5 Gheorghe Manu Street Floor 2 and 4 District 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-verification-engineer/751375/1"}