{"body": "\n\n\n\n1. Position purpose and scope of work: - Recruiting process: role definition, sourcing, selection (CV selection and classification, screening, face to face interviews), feedback and final offering;- Provide recruiting services according to SLA and business priorities;- Develop and implement recruitment strategies;- Coordinate HR interns;- Organise and participate at internal assessments;- Appropriate and effective sourcing channel usage;- Administrative department activities: employee data processing, labor: documents creation, providing admin support for company’s employees;- Participate pro-actively in all actions that are or need to be taken by the HR department. 2. Requirements:- Experience in the recruitment field and knowledge of Romanian labor market;- Experience in using multiple sourcing channels;- Excellent networking and relationship - building skills;- Proven ability to manage multiple assignments simultaneously, balance project work with high-priority requests;- Flexibility, openness to change and new challenges;- Very good organization of work and ability to quickly adapt priorities to changing business requirements;- Excellent communication skills, both written and verbal;- Ability to work with minimum supervision and meet tight deadlines with great attention to details;- Commitment and ownership attitude;- Able to work effectively and be flexible in a small team;- Fluent English communication skills (oral & written);- Knowledge of French might be an advantage;- Good knowledge of MS Office: Word, Excel, Power Point.3. Benefits:- Attractive salary package;- Meal tickets;- Health insurance;- Foreign language courses, trainings, certifications and tuition fees reimbursed by Capgemini;- Team building events;- Regular performance assessments - twice a year;- Significant development opportunities within the company.- Schedule pattern: 09.00 – 17.00, Monday to Friday.Location: Palas Center. \n\n\n", "title": "Recruitment Specialist", "company_url": "http://www.bestjobs.ro/firme/capgemini-services-romania/11119981/5", "career_level": "Entry, Middle", "company": "CAPGEMINI SERVICES ROMANIA", "locations": "\nStrada Palas nr. 7D-7E, Iași, Județul Iași, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-recruitment-specialist/206124/5"}