{"body": "\n\n\n\nPeople make Dell – so wherever in the world they work, everyone is rewarded for their contribution. Ready to develop your career in a truly global company? Within the Services Business Unit at Dell, we are looking for a Network Security Specialist to join our team in Bucharest.\n\r\nDell Romania was recognized by AON Hewitt as a Best Employer for 2015. This year, they ranked the companies by evaluating employees’ level of engagement with the company and top management best practices. We pride ourselves on being a great place to work!\r\nFrom our point of view, people are our most important asset, so we’re constantly looking for new ways to make them feel appreciated.\n\r\nKey Responsibilities: \n\r\nThis position will involve daily maintenance and operations of the leveraged firewall service infrastructure.  \r\n• You will be working primarily with SonicWall, Cisco, Checkpoint, and Juniper firewall products in order to help design, confirm, determine and/or troubleshoot firewall traffic flows;\r\n• Network Security Services include daily maintenance and operations of multiple customers’ firewall and network security infrastructure; \r\n• You will be required to troubleshoot firewall traffic flows, as well as maintain accurate documentation of firewall and network security support activities and processes;  \r\n• You will also be required to work independently and remotely when troubleshooting; \r\n• You must have the ability to solve problems with minimal client input and ability to escalate when solution is not readily apparent.\n\r\nEssential requirements:\r\n• Drive for results \r\n• Ability to grasp complex issues to arrive at optimal solutions \r\n• 4 + years of network troubleshooting experience and at least 2 years of firewall administration and design experience \r\n• At least one mid-level certification from Cisco, Checkpoint or Juniper (CCSE, CCNP, JNCIS, etc) \r\n• Excellent customer service and communication skills are required \r\n• Good time management skills to properly manage operations duties and other task that will assist in the optimization of the firewall team \n\r\nDesirable requirements:\r\n• Bachelors degree or equivalent experience \r\n• Experience with Provider-1 is a plus \r\n• Experience with Cisco routers and switches is a plus \r\n• At least 2 recognized networking or security certifications \r\n• Knowledge of Juniper Firewall/VPN products and ScreenOS software  \n\r\nBenefits:\n\r\nOur people are the most critical component of our long-term success and their health and wellbeing are our priority. You will enjoy a comprehensive, locally competitive benefits package.\n\r\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, colour, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. \n\n\n", "title": "Network Specialist - Firewall (16:00 - 01:00)", "company_url": "http://www.bestjobs.ro/firme/dell-international-services-srl/2252737/1", "career_level": "Middle", "company": "DELL International Services SRL", "locations": "\n10A Dimitrie Pompei Blvd. Conect Business Park Building C3 5th floor Bucharest 2nd district, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-network-specialist-firewall-16-00-01-00/747423/1"}