{"body": "\n\n\n\nOrder to Cash Associate - Order ProcessingThe OTC Associate is responsible for performing work activities included in the end-to-end Order to Cash (OTC) process for the Kellogg organization in Southern Europe, in support of the Global Business Services strategic objectives.WHAT WILL I BE DOING? Be responsible for the timely processing of a large volume of sales orders in an accurate and efficient manner by ensuring the completeness of sales orders.Consistently meet compliance measures and achieve SLAs. Achieve and sustain best practices in effectiveness, quality delivery and efficiency within a strong internal control framework.Pursue continuous improvements aimed at challenging the norm and being innovative, driving efficiencies and decrease costs.Customers and Operationso    Monitor daily incoming sales orders and analyse & resolve order issueso    Ensure proactive communication to customer via Customer Associate for order issueso    Resolve inquiries from internal OTC teamso    Maintain an in-depth knowledge of products and services offeredo    Generate reports for OTC leadership teamo    Cover across markets and for BO Service monitoring associate as needed and GBS OTC LeadCapability-Building and Innovationo    Build individual skills and capabilities through learning opportunities such as training courses and on-the-job training; strive to be a process champion or expert for the end-to-end OTC process.o    Support implementation of improvements for process efficiency,quality and control KPIs.o    Work on special projects and continuous improvement initiatives; identify opportunities to make the processes more effective.o    Participate in pilots or service rehearsals before major changes are implemented; conduct system testing for technology upgradesWHAT DO I NEED TO DEMONSTRATE?Required:High School DiplomaStrong verbal and written communication skillsFluency in EnglishExperience within a related fieldExcellent office skillsAbility to work in a team environmentSolid analytical, problem solving and time management skillsPreferred:Experience working in a shared services, process driven or service centre environmentKnowledge of a Second languageExpertise in Order-to-Cash function including best practices, technologies, processes, procedures and toolsExperience of using SAP: The ability to navigate SAP modules.This may include Master Data, Order to Cash, APO, Return Transactions,Order Management, Pricing, Reserve systems and Contract ManufacturerExperience working for a multinational organization and working with colleagues internationallyProcessed and Packaged foods industry experienceWHAT ELSE DO I NEED TO KNOW?This position requires regular attendance and punctuality in accordance with Company policies. Additionally, the ability to interact well with other employees and work overtime, as necessary, is required. All employees are responsible for implementing Kellogg EEO policy andAffirmative Action commitments.This position profile identifies the key responsibilities and expectations for performance. It cannot encompass all specific job tasks that an employee may be required to perform. Employees are required to follow any other job related instructions and perform job related duties as may be reasonably assigned by his/her People Manager.Please note that we will only accept applications that are made to us via our Careers site.We are unable to accept applications via email.Please note that the closing date may be subject to change. We will interview suitable candidates as they apply, so please don't hesitate to take this opportunity to submit your application as soon as possible.If you would like to be immediately notified of new Kellogg's opportunities, please go to 'Create or access my profile' and complete the information required in the 'Job Alerts' section. You will then receive email alerts as soon as new jobs are advertised.The Kellogg Company is an Equal Opportunity Employer who strives to provide an inclusive work environment that involves everyone and embraces the diverse talent of its people. \n\n\n", "title": "Order to Cash Associate - Order Processing", "company_url": "http://www.bestjobs.ro/firme/kellogg-european-services-support-srl/13873245/5", "career_level": "Middle", "company": "KELLOGG EUROPEAN SERVICES SUPPORT SRL", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-order-to-cash-associate-order-processing/206254/5"}