{"body": "\n\n\n\nFollow our job advertisements and join the exciting world of automotive industry today; come and meet the challenges and opportunities of a fast paced environment that will excite and develop you as a young professional! Delphi is willing to grow young talents into young professionals! In the same time, we have a deep knowledge to share and we need the expertise of senior professionals! Be smart and we shall use your creativity, be proactive and we shall appreciate your initiatives, be remarkable and we will definitely see you standing out from the crowd.\n\r\nMain Duties and Responsibilities:\n\r\n• Formulate, develop and execute the training and development strategy for Delphi Romania; \r\n• Develop training and development programs to support the strategy; partner with the HR Managers in Delphi locations across Romania, Country HR Team and leadership team to ensure that the learning and development strategies are aligned with corporate objectives \r\n• Design, implement and follow up learning & development programs for employees throughout the various stages of their careers from on-boarding to leadership potential development; \r\n• Identify, together with the department manager, the training needs of the organization; draw training plans; organizes and supervises the training processes/ projects\r\n• Design training programs to develop employees’ skill in order to meet the required competence matrix on each position within the organization\r\n• Elaborates training programs and prepares training materials; act as trainer for certain training programs\r\n• Monitors and ensure follow up for the induction process for new employees in the locations; ensure follow up for the induction period on certain position, using one to one discussions, activity assessments, 360 degree feedback, etc…\r\n• Elaborate and implement a succession planning strategy for identifying and developing internal people with the potential to fill key business leadership positions in the company\r\n• Develop, update and follow up for the general performance management system and manage the personal business plans for certain categories of personnel\n\r\nEssential requirements:\n\r\n•Bachelor's degree\r\n•3 years+ experience in Training and Development, experience in management of HR complex processes is a an advantage\r\n•A background in manufacturing multinational companies is an advantage\r\n•Trainer certification is a plus, as well as a trainer background\r\n•English advanced knowledge is a must\r\n•Excellent PC knowledge (MS Office)\r\n•Previous experience in working with large teams\r\n•Analytical and synthetically thinking, attention to details and problem solving abilities \r\n•Solution and people oriented, dynamic and resourceful\n\n\r\nIf you think this is the opportunity you have been looking for, please send an application letter stating your career options and an application in English by e-mail to the following e-mail address: ristena.veghes@delphi.com or apply on-line. All information regarding your application will be treated with the utmost confidentiality. Only selected candidates will be contacted for an interview. Delphi Packard Romania www.delphi.com\n \n\n\n\n\n", "title": "Country Training and Development Coordinator", "company_url": "http://www.bestjobs.ro/firme/delphi-packard-romania-srl/849436/1", "career_level": "Middle, Senior", "company": "Delphi Packard Romania SRL", "locations": "\nArad, Județul Arad, România;Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-country-training-and-development-coordinator/751555/1"}