{"body": "\n\n\n\nClinical Research Associate (CRA)\n\r\nDescription\n\r\nAs a top five CRO, we have worked on 100+ marketed drugs across several therapeutic areas and conducted the pivotal or supportive trials that led to FDA and/or international regulatory approval of 45+ such drugs. \n\n\n\r\nAt PRA Health Sciences, providing innovative solutions for our clients is what we do. From full service clinical development to the pioneering Embedded SolutionsTM model, PRA provides a broad spectrum of solutions that meet the demands of a diverse marketplace. \n\n\n\r\nAt PRA, borders do not create boundaries. PRA's success is dependent upon our ability to attract and retain a talented team of diverse professionals. Our growing workforce is comprised of over 10,000 employees, spanning 13 time zones across six continents and who speak more than 30 languages - yet operate in unison as one worldwide PRA community. \n\n\n\r\nWorking fully outsourced to our global pharmaceutical client, the Clinical Research Associate is ultimately responsible for the successful management of investigator sites throughout the site lifecycle, whilst working in accordance with ICH-GCP guidelines, the study protocol, applicable local and international regulatory requirements and internal Standard Operating Procedures. \n\n\n\r\nWith full ownership of investigator sites for your assigned studies, your involvement begins at site feasibility stage, with responsibility for the successful management of the site right through to close-out. In addition to planning and conducting various site visits (feasibility, site selection, interim and close-out) in accordance with the clinical monitoring plan, you will foster effective relationships with investigator site staff to ensure that key clinical metrics are met. This will involve establishing innovative ways of increasing site and patient recruitment. When issues do occur, the Clinical Research Associate proactively and promptly implements corrective action plans, and, when applicable, escalates issues to more senior members of the study team. You may also design and deliver training to site staff, when appropriate. \n\n\n\r\nTypical duties will likely include preparing for and attending investigator meetings, coordinating the timely shipment and the subsequent proper storage and accountability of clinical supplies and following-up of drug safety issues that have occurred at your site. You will ensure the integrity of clinical data through your ability to sufficiently maintain site tracking records and work diligently to relevant guidelines. \n\n\n\r\nThrough your ability to operate as a key part of a global study team, you will play a fundamental role in our client's drug development process. \n\n\n\r\nThe successful candidate for this role will be able to demonstrate prior experience of working in investigator site management, including conducting monitoring visits, from either a pharmaceutical company or a CRO environment. \n\r\nIt is essential that you have prior working knowledge of ICH-GCP guidelines and local and international regulatory requirements. Fluency in Romanian and English is an absolute requirement, as well as an ability to communicate effectively with others and manage your time effectively. \n\n\n", "title": "Clinical Research Associate (CRA)", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-clinical-research-associate-cra/751424/1"}