{"body": "\n\n\n\nWipro WT is a trendsetter and leader in the Outsourcing space. We invite passionate, energetic, creative and focused individuals who want to be a part of our growth story! Wipro WT is the best option you can find to develop your expertise in the industry. You will get immense opportunities to learn from our focused approach towards delivering long-term benefits and measurable value to our customers through: Business Domain KnowledgeIntegrating TechnologyProcess ExcellenceAt Wipro, you will get a solid understanding about the best way to service the customer requirements by leveraging Quality, Innovation, self-sustaining Process Framework, IT expertise and Domain knowledge. With the best people talent, we offer customized service offerings, translating into the most flexible and cost effective services of the highest quality. You will get the opportunity to be a part of a very capable and energetic team of over 24,000 colleagues, operating out of more than 25 delivery locations across the globe. This team from Wipro BPS has been a valued partner to all our customers in achieving their business goals. A wide range of industry options are available since we services customers in various industries including Banking & Capital Markets, Insurance, Travel & Hospitality, Retail & Consumer Products, Energy and Utility, Technology, Manufacturing, Telecom & Healthcare sectors. We have built deep expertise in Processes like Finance & Accounting, Procurement, Marketing, Legal, HR Services, Tech Support, Customer Services and Analytics. Follow us on Facebook @ www.facebook.com/WiproRomaniaService Desk Admin L1Profile:- Fluent communication skills in English and one of the following: Arabic/ Turkish/ Greek- Previous Helpdesk (Voice Support) experience is to be preferred.- Excellent telephone manner.- Experience of using call logging software.- Knowledge of Microsoft based operating systems with emphasis on Windows X- Experience with using and troubleshooting Outlook within a network environment (permissions, calendar sharing, delegation)- Experience with using and troubleshooting Microsoft Office with emphasis on MS Word, MS Excel and MS PowerPoint.- Basic understanding of PC hardware set-up and configuration.- MCP certification would be desirable- Should have worked as a Customer Support Engineer / Technical Support Executive / System or Network Administrator & acquired hands-on experience in the above areas in large & complex setups- Should have good understanding of infrastructure management processes; Understanding of ITIL framework is needed- Good communication (written & oral), presentation skills, quick learner, self-initiated, team player, willing to travel, open to work in shiftsRole and responsibilities:- To provide 1st line/2nd line technical support; answering support queries via phone, email, Chat and Web- To maintain a high degree of customer service for all support queries and adhere to all service management principles.- To take ownership of user problems and be proactive when dealing with user issues.- Logging / verifying customer details- Identifying the issue and categorizing / prioritize the incident- Creating a ticket in CRM tool- Referring KB for workaround / resolution and attempting resolution- Strong interpersonal skills are a prerequisite.- Ability to work effectively in a dispersed team and individually.- Ticket re-assignment to L2 if ticket unresolved by L1 (where ever applicable)- Ticket reassignment to PRG's if ticket unresolved by L1 (where ever applicable)- Routing / Chasing of tickets with other PRG's- Recording trend of calls and identifying outages proactively- Callbacks for customer not reachable cases & customer request- Identifying the trend of calls / tickets and highlighting it to L2 / TL as applicable for outage confirmation (where ever applicable)- Creating child tickets and tagging them with problem ticket- Callback the user and confirm resolution (where ever applicable)Foreign languages skills:- Advanced English language skills, both written and spoken and- Fluent communication and writing skills in Arabic/ Turkish/ GreekBenefits:- Opportunity to work in a young and dynamic environment;- Attractive benefits package;- Lunch tickets- Fitness deduction- Health insurance and dental scheme;- Opportunity to develop and learn constantly- Access to internal training (job related and soft skills training) \n\n\n", "title": "Service Desk Admin L1 with Arabic/ Turkish/ Greek", "company_url": "http://www.bestjobs.ro/firme/wipro/12205216/1", "career_level": "Entry, Middle", "company": "Wipro", "locations": "\nFloreasca 169 A, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-service-desk-admin-l1-with-arabic-turkish-greek/748359/1"}