{"body": "\n\n\n\nDescrierea companiei:\r\nRomanian Business Consult este partener si unic reprezentant in Romania al brandurilor Wincor Nixdorf si Bizerba, fiind un jucator important pe piata de solutii retail. Din 1991 suntem alaturi de cele mai mari companii internationale din retail si industria alimentara.\r\nPortofoliul de clienti include nume precum: AUCHAN, BILLA, CARREFOUR, DECATHLON, IKEA, KAUFLAND, MEGA IMAGE, METRO, LIDL etc.\n\r\nScopul acestui post este implementarea proiectelor de instalare hardware si software specifice catre clientii din retail-ul international.\n\r\nResponsabilitati: \n\r\nRealizeaza in principal activitati de derulare proiecte hardware si software catre clientii RBC, proiecte ce cuprind: echipamentele Wincor Nixdorf, echipamente wireless, verificatoare de pret, imprimante industriale;\r\nRealizeaza activitati de instalare/service/configurare/mentenanta on site pentru echipamentele Wincor Nixdorf instalate la beneficiari;\r\nCompleteaza documentele de service conform normelor interne;\r\nRealizeaza scolarizari ale echipamentelor Wincor Nixdorf pentru beneficiari;\r\nMentine un nivel ridicat de satisfactie al clientului;\n\r\nCerinte/candidatul ideal\n\r\nAbsolvent studii superioare tehnice - Electronica sau Automatica;\r\nExperienta in service echipamente POS, scannere coduri de bare, terminale, wireless, verificatoare de pret;\r\nExperienta in service echipamente fiscale prezinta avantaj;\r\nBune aptitudini tehnice (hardware si software);\r\nAbilitatea de a lucra cu mai multe tipuri de echipamente;\r\nPermis de conducere categoria B;\r\nDisponibilitate pentru deplasari;\r\nDispus sa invete, dinamic, deschis catre nou;\n\r\nBeneficii:\n\r\nSalariu fix\r\nTichete de masa\r\nAbonament clinica medicala privata\r\nLaptop, telefon, masina de serviciu\n \n\n\n", "title": "ING. SERVICE - IMPLEMENTARE PROIECTE SOFT./HARD.", "company_url": "http://www.bestjobs.ro/firme/romanian-business-consult-srl/30400/1", "career_level": "Middle, Senior", "company": "Romanian Business Consult SRL", "locations": "\nStr. Promoroaca 3A etaj 4 sector 1 Bucuresti, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-ing-service-implementare-proiecte-soft-hard/752369/1"}