{"body": "\n\n\n\nEricsson Overview\n\r\nEricsson is world’s leading provider of communications technology and services. Our offerings include services, consulting, software and infrastructure within Information and Communications Technology.\r\nUsing innovation to empower people, business and society, Ericsson is working towards the Networked Society: a world connected in real time that will open up opportunities to create freedom, transform society and drive solutions to some of our planet’s greatest challenges.\r\nWe are truly a global company, operating across borders in over 180 countries, offering a diverse, performance-driven culture and an innovative and engaging environment. As an Ericsson employee, you will have freedom to think big and the support to turn ideas into achievements. Continuous learning and growth opportunities allow you to acquire the knowledge and skills necessary to progress and reach your career goals. We invite you to join our team.\n\r\nJob Summary \n\r\nTo manage and coordinate master data related projects and improvements to secure that planned goals are met, stakeholder expectations are fulfilled.\n\r\nResponsibilities & Tasks \n\r\n•\tAct as external and internal interface for project/activities with master data impact\r\n•\tAct as Project Manager for assigned projects/activities\r\n•\tEstablish project plan baseline: define project scope, secure the necessary resources, plans and monitor all activities\r\n•\tDrive project execution: track project activities , monitor and handle communications, changes, conflicts and escalations. Ensure the deliveries meet requirements\r\n•\tCoordinate assigned SSO MDM cross area activities\r\n•\tActively participate in the unit development with innovative ideas\n\r\nPosition Qualifications:\n\r\nCompetences Requirements: \n\r\n•\tMinimum 3 years of Master Data Management experience with good business understanding and knowledge of Ericsson Processes.\r\n•\tProject management tools and methodologies (i.e. ePROPS)\r\n•\tProblem solving and strategic thinking\r\n•\tFundamental leadership skill\r\n•\tHigh level oral and written Communication and interpersonal skill in a multi-cultural, cross organizational environment\r\n•\tChange & Improvement Management skill\r\n•\tRelevant experiences with Project management is preferred\n\r\nPersonal Traits: \n\r\n•\tHigh enthusiasm to work with people and take challenges\r\n•\tSense of structure, logic, quality, team spirit\r\n•\tHighly analytical and keen to details. Able to work under high pressure with perseverance and result orientation\n\n \n\n\n", "title": "Project Manager Master Data", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nBucharest, Bucharest, Romania;West Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-project-manager-master-data/750502/1"}