{"body": "\n\n\n\nRecrutam pentru completarea echipei Lajumate.ro, MODERATOR ANUNTURI.\r\nLajumate.ro cel mai proaspat site Antena TV Group, o platformă de anunțuri online lansată în octombrie 2015, care are ca scop facilitarea procesului de vânzare-cumpărare între toți utilizatorii de internet din România. O premieră adusă pe piaţă din România de site-ul de anunturi Lajumate.ro, este faptul că pentru prima oară, anunţurile postate pe un site pot fi văzute şi la tv. 24 de ore pe zi, la fiecare \" şi jumate \", un anunţ de pe site va apărea şi la televizor.\r\nSite-ul are în spate o echipă puternică și 100% dedicată care își propune să atingă cele mai bune performanțe într-un timp record.\r\nEste un produs realizat cu multa munca de catre o echipa de oameni minunati, ca toti cei care formeaza in acest moment Digital Antena TV Group!\n\r\nResponsabilitati:\r\n•\tVerifica, corecteaza si asigura calitatea informatiilor publicate in anunturi;\r\n•\tIdentifica erori in procesul de moderare al anunturilor;\r\n•\tInvata/asuma periodic reguli noi de moderare si ofera sugestii de imbunatatire a  \r\n        modului de lucru.\n\r\nProfil:\r\n•\tStudii medii sau superioare;\r\n•\tCunostinte bune de operare PC (MS Office, email, internet);\r\n•\tVorbire fluenta si scriere corecta a limbii romane;\r\n•\tAbilitatea de a lucra simultan cu mai multe aplicatii;\r\n•\tAtentie la detalii;\r\n•\tCapacitate analitica;\r\n•\tSeriozitate, simt de raspundere;\r\n•\tCapacitatea de a lucra independent;\r\n•\tComunicare foarte buna in cadrul echipei;\r\n•\tAtitudine pozitiva;\r\n•\tDisponibilitate pentru lucrul in ture, inclusiv in weekend;\r\n•\tPunctualitate, responsabilitate, perfectionare .\n\r\nBeneficii:\r\n•\tProgram flexibil;\r\n•\tBonusuri in functie de performante;\r\n•\tTraining-uri lunare;\r\n•\tPosibilitati de dezvoltare profesionala.\n \n\n\n", "title": "MODERATOR  ANUNTURI", "company_url": "http://www.bestjobs.ro/firme/intact-media-group/1283039/1", "career_level": "Entry", "company": "INTACT Media Group", "locations": "\nStr. Garlei nr. 1B Sector 1, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-moderator-anunturi/752170/1"}