{"body": "\n\n\n\nTehnician Service Compresoare, domiciliul în județul Brașov sau zona limitrofă.\n\r\nÎntreţinerea şi repararea echipamentelor (compresoare industriale) produse de firma KAESER KOMPRESSOREN SE Germania.\n\r\nCerinţe minime (CV-urile care nu respectă oricare dintre acestea nu sunt luate în considerare):\r\n- studii medii tehnice\r\n- limba română foarte bine\r\n- carnet de conducere categoria B\r\n- experienţa minim trei ani în întreţinerea şi repararea unor echipamente   electromecanice exclusiv industriale - disponibilitate pentru deplasări zilnice (activitatea se desfăşoară la clienţi)\r\n- cunoştinte în utilizarea calculatorului (MS Office, Outlook, SAP)\n\r\nConstituie un avantaj:\r\n- limba engleză vorbit si scris\r\n- experienţa şi deţinerea unor autorizaţii în domeniul electric şi/sau instalaţii de frig industrial\r\n- limba maghiară\n\n\r\nBeneficii:\r\n- lucrul într-o companie multinaţională de renume\r\n- pregătire specializată\r\n- stabilitate maximă\r\n- venituri corelate cu rezultatele\r\n- asigurare medicală extinsă  Interviu Online:1.  Care sunt cele mai mari echipamente la care ați realizat lucrări de întreținere sau reparații?2.  Care sunt echipamentele cele mai complexe din punct de vedere tehnologic la care ați realizat lucrări de întreținere sau reparații?3.  Care sunt principalele caracteristici ale unui job pe care să-l considerați foarte atractiv dar și potrivit pentru dvs.?4.  Descrieți, vă rugăm, situația din trecutul dvs. profesional în care ați simțit satisfacție maximă?5.  Dacă ați fi în locul nostru, ce calități ați căuta la candidații pentru această poziție? \n\n\n", "title": "Tehnician Service Compresoare", "company_url": "http://www.bestjobs.ro/firme/kaeser-kompressoren-srl/12278312/1", "career_level": "Middle, Senior", "company": "KAESER KOMPRESSOREN SRL", "locations": "\nSibiu, Județul Sibiu, România;Brașov, Județul Brașov, România;Covasna, Județul Covasna, România\n", "languages": " Romana, Engleza, Maghiara", "url": "http://www.bestjobs.ro/locuri-de-munca-tehnician-service-compresoare/751572/1"}