{"body": "\n\n\n\nLUXOFT Global presenceThe Company develops its solutions and delivers its services from 24 dedicated delivery centers worldwide. It has over 9,500 employees across 27 offices in 15 countries in North America, Mexico, Western and Eastern Europe, Asia Pacific, and South Africa. Luxoft is incorporated in Tortola, British Virgin Islands, has its operating headquarters office in Zug, Switzerland and is listed on the New York Stock Exchange.LUXOFT Romania With 1500 employees on board, Luxoft Romania works on delivering high quality product engineering and application development services. Luxoft Romania focuses on three main technology verticals: Automotive, Financial and Telecom. Project Description:Providing Software Quality Assurance services for Layer 4-7 Security and Testing solution:      - Manual testing      - Test case automation      - Regression testing Tools used for test case automation: TCL, Spirent iTest.Responsibilities:You will be part of the Product Verification team and you are expected to:      - Provide input for Functional Specifications      - Design and create Test Cases and Test Plans for different Features      - Execute manual test cases for New Feature and Regression      - Maintain Test documentation      - Configure test setup and perform troubleshooting activities      - Root cause isolation. Bugs / Problems reporting with accurate description, steps to reproduce, associated logs.      - Develop and maintain automation infrastructure and automated scripts      - Run and debug automated regression      - Test data review and script code review      - Report progress and results of the tasks performed periodically (to team and management) Skills Required:The best candidate would be a networking tester (qa) engineer - preferably with experience in running and creating automated scripts. - Good networking skills: TCP / IP, Layer 4-7 protocols, Switching, Routing (Cisco Certifications are a plus) - Good understanding of testing principles and QA skills. Experience with designing, creating and executing Test Plans and Test Cases, bug isolation and reporting. - Load / performance testing knowledge. - Basic Linux knowledge - Experience with building and maintaining a test setup. - Scripting skills are a plus; any programming / scripting language experience is good; TCL / Spirent - Experience with network traffic generators is a plus. - Good communication in English, both speaking and writing What we offer:- An interesting job in one of the largest IT companies- Challenging & professional work environment- Pleasant working atmosphere within an international team- Competitive salary and opportunities for professional development- Various in house training & webinars- Atractive relocation package \n\n\n", "title": "QA with networking and preferably scripting", "company_url": "http://www.bestjobs.ro/firme/luxoft-professional-romania-s-r-l/1554/1", "career_level": "Middle, Senior", "company": "LUXOFT PROFESSIONAL ROMANIA S.R.L.", "locations": "\nDimitrie pompeiu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-qa-with-networking-and-preferably-scripting/749191/1"}