{"body": "\n\n\n\n\r\nMSD is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. Today, we are building a new kind of healthcare company – one that is ready to help create a healthier future for all of us. \n\n\r\nOur ability to excel depends on the integrity, knowledge, imagination, skill, diversity and teamwork of an individual like you. To this end, we strive to create an environment of mutual respect, encouragement and teamwork. As part of our global team, you’ll have the opportunity to collaborate with talented and dedicated colleagues while developing and expanding your career. \n\n\n\r\n•Actively promote company’s products to diabetologists, and other health care professionals according to marketing and sales strategies defined for the franchise while always maintaining an ethical & compliant behaviour in line with all laws & regulations (internal & external). \r\n•Develop positive relationships with all customers and provide product and disease state expertise. \r\n•Assess customer requirements and advise on the most appropriate products. \r\n•Submit regular reports on sales and related activities. \r\n•Follow up with customers to ensure that a high level of customer satisfaction is achieved and maintained. \r\n•Identify potential target territories and provide feedback to line managers. \n\n\n\n\r\nQualifications\n\r\n•University degree\r\n•At least 2 years experience in Diabetes on CV area of Romania (CJ, MS, AB, BN) is a strong advantage \r\n•Good knowledge in Diabetes field and understanding of pharma business \r\n•Highly customer-focused \r\n•Comfortable working independently, but also with a strong team-spirit \r\n•Sense of responsibility and attention to detail \r\n•Language: Romanian and English business proficiency and understanding \r\n•Computer proficiency: \r\n•CRM systems (Oracle, Viva, etc.) \r\n•Office: Excel, Word, PowerPoint – business level \n\n\n\r\nOur employees are the key to our company’s success. We demonstrate our commitment to our employees by offering a competitive and valuable rewards program. Our Company’s benefits are designed to support the wide range of goals, needs and lifestyles of our employees, and many of the people that matter the most in their lives. \n \n\n\n", "title": "Senior Customer Representative,  Cluj-Napoca", "company_url": "http://www.bestjobs.ro/firme/merck-sharp-dohme-romania/3370980/2", "career_level": "Senior", "company": "Merck Sharp & Dohme Romania", "locations": "\nCluj-Napoca, Cluj County, Romania\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-customer-representative-cluj-napoca/230770/2"}