{"body": "\n\n\n\nAbout DB Global Technology: \r\nDB Global Technology (DBGT) is the newly established European development center in Bucharest, Romania. As a subsidiary of Deutsche Bank AG, DBGT is a dedicated application development and software engineering center for leading-edge technology solutions that power the future of global capital markets. DBGT partners with the Deutsche Bank Group Technology and Operations division to access superior technology skills and promote innovation in the development of software applications and IT solutions.Deutsche Bank is looking for an experienced, motivated and ambitious Architecture Specialist to develop and implement architecture guidelines in Deutsche Bank IT projects. The Architecture Specialist will be expected to work closely with the Treasury business as well as data, functional and solution architects.\r\nPosition Description Summary:\r\nThe Architecture Specialist supports and performs analysis for day to day tasks of the Group, Data, Business, Solution or Technical Architects in specific projects.To support Data Architects, the IT Architecture Specialist mainly performs analysis on planned data flows into and from systems. They also pay attention to the appropriate data stores and access approaches for transactional, reporting and analytical environments. Specifically, the role includes the documentation of data issues arising in a project’s data architecture.To support Solution Architects, the IT Architecture Specialist provides support in defining solution architectures and high-level software designs, by creating architectural models and the documentation required by the SDLC. Additionally, the IT Architecture Specialist provides support in reviewing the architecture and design of solutions and analyses their conformity to architecture guidelines.In all their activities, the IT Architecture Specialist is closely guided by more senior IT Architects. The IT Architecture Specialist will have intimate knowledge of the architecture principles and apply them in all their tasks.\r\nKey Responsibilities / Tasks:\r\n• Supports in developing data architectures for a business domain / area or project which align with the overall bank-wide data architecture.• Researches and profiles data sources in data categories of expertise.• Assists the business in defining data requirements.• Has a specialist role in one or more data environments like data warehousing, real-time data access, data integration, or messaging.• Helps to create templates for data deliverables to enhance the productivity of all Data Architects.• Supports the development of project related data deliverables.• Plays an active role in data related Communities of Interest and promotes proper data management techniques within the Bank.• Prepares analysis for the design of the optimum architectures of IT solutions.• Ensures that architectures of solutions conform to the defined principles, blueprints, standards, patterns, etc., for solution architecture as well as for enterprise architecture.• Carries out reviews of software designs and documentation.• Advises the assigned technology initiatives in:• Undertaking peer reviews of, and reviewing solution architectures and designs, taking into consideration specific business and technical constraints, requirements and dependencies.• Preparing high level design documentation and detailed-level design documentation produced by project teams for review and validation.• Measuring the quality of the solution from an architectural perspective and ensuring the conformance of delivered solutions to predefined quality metrics.• Analyses level of conformance of solutions to defined solution architecture and Enterprise Architecture principles, blueprints, standards, patterns, etc.• Analyses level of conformance to defined SDLC processes and reuse of shared enterprise assets where possible.• Actively supports achievement of Bank’s/Division’s strategy, plans and values, and ensures they maintain a clear understanding and ongoing alignment of activities with the organisation’s priorities.• Demonstrates personal support to the achievement and maintenance of a high performance culture in which people management and development is a key priority. Demonstrates personal commitment to supporting colleagues within the team.Exposure• Knowledge of IT delivery and architecture including knowledge of Data Modelling and/or DBA, first experience in application design and programming.• Relevant Financial Services experience.• Experience in data and business analysis and design with a cohesive vision of key business data challenges.• Ability to work in a fast paced environment with competing and alternating priorities with a constant focus on delivery.• Ability to balance business demands and IT fulfilment in terms of standardisation, reducing risk and increasing IT flexibility.• Ability to relate and adapt data-related vision and strategy to the external environment that affects the organization in terms of economic climate, customer market demand, regulation and other legalities, geography, political, culture, labour, technology.\r\nExperience:• Knowledge of IT delivery and architecture including knowledge of Data Modelling and/or DBA, first experience in application design and programming.• Experience in data and business analysis and design with a cohesive vision of key business data challenges.• Ability to work in a fast paced environment with competing and alternating priorities with a constant focus on delivery.• Ability to balance business demands and IT fulfillment in terms of standardisation, reducing risk and increasing IT flexibility.• Ability to relate and adapt data-related vision and strategy to the external environment that affects the organization in terms of economic climate, customer market demand, regulation and other legalities, geography, political, culture, labour, technology.• Well-developed requirements analysis skills, including good communication abilities (both speaking and listening) and stakeholder management (all levels up to Managing Director).• Experience in IT delivery or architecture including experience as an Application Developer• Strong object oriented design skills• Experience working in an Agile based team – ideally Scrum• Desirable Technology Skills: Business Rules Engines in general (IBM ODM in particular), Scala / Akka / Reactor Pattern / Camel,  Oracle Exadata• A demonstrable track record of successful delivery• Candidates with previous experience working in a bank desired, but not mandatory.\r\nThe ideal candidate:\r\n• Experienced, ambitious and motivated to work in a Treasury function• Structured in your approach with a mind-set built on simplicity• An able communicator, both written and verbal• Comfortable engaging with senior stakeholders to MD level.• A capable leader, with strong influencing skills• Comfortable with a high pressure environment with tight deadlines driven by our regulators. \n\n\n", "title": "Architect", "company_url": "http://www.bestjobs.ro/firme/db-global-technology-s-r-l/13695597/5", "career_level": "Middle, Senior", "company": "DB Global Technology S.R.L", "locations": "\nBulevardul Dimitrie Pompeiu nr. 6A, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-architect/198332/5"}