{"body": "\n\n\n\nCandidatul idealSuntem in cautarea unei persoane tenace si dornice de a avea parte de dezvoltare profesionala si personala. Candidatul ideal trebuie sa cunoasca limba engleza la nivel mediu(scris+vorbit), si sa detina cunostinte PC. Va ghidam catre o cariera care va permite sa va controlati programul de lucru si care va ofera o corelatie directa intre efort si rezultat, o cariera cu potential nelimitat pe planul realizarilor profesionale si financiare.Beneficii • Activitate in cadrul unei organizatii de inalt profesionalism;• Training de specialitate;• Mediu de lucru modern si in continua evolutie;• Perfectionare continua in plan profesional;• Participare la conferinte si seminarii de specialitate;• Posibilitatea unui venit peste medie nationala;• Program de lucru full time/ part time.Compania asigura prin partenerii locali din Bucuresti, Timisoara,Cluj-Napoca, Constanta si Iasi pregatire preliminara. Pentru candidatii fara experienta, compania ofera doua posibilitati, la alegere, pentru a accesa aceasta pozitie,si anume:parcurgerea trainingului la sediul unui partener local sau studiu individual. Pentru cei care sustin ca au experienta in activitatea noastra, cerem candidatilor o testare , sub anumite conditii. Oferim suport pentru fiecare etapa in care va veti afla.Descrierea companieiCompania noastra in parteneriat cu companii mari de investitii va ofera posibilitatea de a va dezvolta o cariera in domeniul financiar. Prin aceasta oportunitate aveti posibilitatea de a administra capitalul companiei.Se acorda fiecaruia sansa de a-si descoperi adevaratul potential si de a-si folosi la maximum aptitudinile si capacitatile personale. \n\n\n", "title": "Responsabil Cont", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nConstanța, Județul Constanța, România;Iași, Județul Iași, România;Str. Decebal 110 parter, Cluj-Napoca, Județul Cluj, România;STR. IACOB FELIX 49 ETAJ 3, București, Municipiul București, România;Str.Traian Grozavescu nr.2, Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-responsabil-cont/746996/1"}