{"body": "\n\n\n\nJob Description:\n\r\nThe position is located in Bucharest, Romania.\n\r\nCeragon training department provides up to date training material and tools for entire organization.\r\nCeragon trainer also involves in practical trainings around the globe, providing the highest level of training for Ceragon customers, partners and employees.\r\nIn order to maintain the highest level of knowledge, Ceragon trainers are working closely with Expert’s team and R&D.\n\r\nBy joining our team, you will enrich your experience and become a proficient trainer in the telecommunications field, working closely with high-end technologies and have global interaction with hi-tech professionals.\n\r\nJob Requirements:\n\r\nThe ideal candidate has the following:\n\r\nMust:\n\r\n•\t1st degree (BA/BSc) in technology related field \r\n•\t3 Years of proven experience as trainer for technology companies (customer facing) \r\n•\tProven excellent English communication, both verbal and written\r\n•\tAbility to create high level presentations (PowerPoint) \r\n•\tAvailable for international travel throughout the world (estimated to 50% from working time) \n\r\nAdvantage: \n\r\n•\tAdditional common languages (Spanish, Portuguese, Russian, French) \r\n•\tExperience in wireless communication, and specifically Microwave \r\n•\tIP and networking knowledge \r\n•\tExperience with e-learning software (Adobe Captive, Camtasia, Wink) \r\nWe are looking for candidates with excellent communication skills, capable of self-learning and working in a challenging environment, who is highly motivated and able to work under pressure, as well as willing to work as a team player. \n\n\n", "title": "Support Training Engineer", "company_url": "http://www.bestjobs.ro/firme/ceragon-networks-srl/13228347/1", "career_level": "Middle, Senior", "company": "Ceragon Networks SRL", "locations": "\n5 Gheorghe Manu Street Floor 2 and 4 District 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-support-training-engineer/751376/1"}