{"body": "\n\n\n\nUn job fun, intr-un loc de munca modern, cu o echipa tanara si primitoare, si multe altele te asteapta la CCC! \n\r\nVorbesti fluent Franceza si mediu Engleza? \r\nAtunci acesta este jobul ideal pentru tine! \n\r\nCe urmeaza sa faci si ce trebuie sa stii: \n\r\nNu este neaparat nevoie sa ai experienta anterioara. Noi te vom pregati si iti vom arata cu rabdare tot ce e nevoie sa inveti pentru a lucra in departamentul de CS pentru o companie aeriana de renume! \n\r\nDaca poti:\n\r\n• Sa vorbesti in Franceza fluent\r\n• Sa comunici telefonic intr-un mod eficient si adaptat la fiecare client in parte \r\n• Sa stii sa folosesti un calculator: MS office si internet\r\n• Sa poti sa lucrezi atat singur cat si in echipa\r\n• Sa privești proiectele ca pe o provocare și o oportunitate de dezvoltare\r\n• Sa te descurci in limba Engleza\r\nSi in plus daca ai mai si lucrat pe un job similar-un avantaj, dar nu un criteriu obligatoriu- asteptam cu nerabdare sa ne cunoastem! \n\r\nCe iti oferim noi:\r\n• Salariu fix, bonuri de masa si bonusuri.\r\n• Asigurare medicala privata\r\n• Perioada de training platita\r\n• Contract pe perioada nedeterminata\r\n• Program flexibil- part time/ full time- cum vrei tu :)\r\n• O echipa foarte motivata si dedicata, cu colegi tineri, dinamici si independenti cu care sa lucrezi si sa te distrezi\r\n• Sansa de a deveni un profesionist in domeniul comunicarii\r\n• O perioada de pregatire si de asemenea programe extinse de training si specializare in cadrul CCC Campus\r\n• Perspectiva dezvoltarii unei cariere de succes intr-o companie internationala\n\r\nVino sa faci parte din povestea de succes CCC!\n\r\nCCC este una dintre companiile de top din Europa care ofera servicii de customer care . Cei peste 5.000 de colegi din cele 15 locatii ale noastre din 8 tari diferite au creat deja o echipa dinamica, distractiva si flexibila, care asteapta cu nerabdare colegi noi!\n\r\nDaca vrei sa afli mai multe despre noi, echipa noastra de recrutare iti va raspunde cu bucurie la un email trimis la jobs.bucharest@yourccc.com, sau poti intra cu incredere aici:\n\r\nhttps://www.facebook.com/CCC-475187499233075\r\nhttp://bucharest.yourccc.com/ \n\n  Interviu Online:1.  Comment as tu appris le francais?2.  Would you like to work full time or part time? \n\n\n\n\n", "title": "FRANCEZA: Operator Call Center", "company_url": "http://www.bestjobs.ro/firme/ccc/4006107/2", "career_level": "Entry, Middle", "company": "CCC", "locations": "\nBasarabia, București, Municipiul București, România\n", "languages": " Franceza, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-franceza-operator-call-center/230816/2"}