{"body": "\n\n\n\nAlison Hayes is one of the leading companies designing and manufacturing clothes for retailers in the UK and elsewhere. \n\r\nJob overview\r\n To manage Romanian Subcontractors and to support the Production Operational Manager and Chief Operational Officer on any production issues on the International Production Base.\n\r\nMajor responsibilities\n\r\nTo ensure that production and customer service targets are met through planning, co-ordinating and directing manufacturing resources and continually improving manufacturing processes.\r\nResponsible for the management and communication of production schedules.\r\nTo review that production is on schedule and the finish is acceptable.\r\nTo liaise with the DC, factories and QCs regarding the quality issues on delivered items and work together to resolve these.\r\nTo establish priorities to Logistic/ warehouse departments on supplying raw materials or loading finished garments to/ from subcontractors according to the cutting date and delivery dates\r\nTo update on real time basis FR system.\r\nTo travel regularly basis and as needed to AH Subcontractors \r\nReplaces the Production Operational Manager during his absence.\n\n\r\nCompetencies for success (skills)\n\r\nFunctional skills:\r\nExperience with overseas manufacturing.\r\nExcellent IT skills are essential for this role\n\r\nGeneral skills:\r\nExhibit strong organisational and presentation skills.\r\nDemonstrate excellent time management. \r\nBe highly organised.\r\nShould be a team-player with excellent communication skills.\r\nAbility to prioritise work in a deadline-orientated environment. \r\nImportant organisational relationships\r\nProduction managers should demonstrate their leadership skills\r\nThey should liase with senior management regularly, including the Directors of the \r\n Company.\r\n The post manages the production team (merchandisers, controllers, trimmings    and      fabric teams) and its day-to-day running.\r\nKnowledge of factory production planning\r\nEnglish (written and spoken)\r\nDaily information exchange with the  AH DC departments and UK office departments (sales/warehouse/ logistics department/ QC department)\n\n\n\r\nThe headquarters of Alison Hayes (Romania) S.R.L is in Urziceni, Ialomita County \n\n\n", "title": "Production Manager - Subcontarctors", "company_url": "http://www.bestjobs.ro/firme/alison-hayes-romania/887585/1", "career_level": "Senior", "company": "Alison Hayes Romania", "locations": "\nAleea industriilor Nr. 17, Buzău, Județul Buzău, România;Sos. Buc- Bz km 55,2 Urziceni jud. Ialomita, Urziceni, Județul Ialomița, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-production-manager-subcontarctors/751458/1"}