{"body": "\n\n\n\nPentru ca in scurt timp deschidem un nou magazin in BISTRITA suntem in cautarea activa a noilor colegi!Cautam colegi pasionati de tehnologie, cu experienta in vanzari, pentru promovarea si vanzarea de produse electronice, electrocasnice, entertainment, IT si comunicatii.Ce iti mai poate aduce in plus aceasta experienta? Vei invata cum sa iti adaptezi discursul si atitudinea in functie de fiecare tip de interlocutor, vei invata cum sa controlezi situatiile stresante, vei fi la curent cu ultimele inovatii tehnologice, vei avea posibilitatea ca dupa o perioada de timp, in functie de rezultatele tale si oportunitatile ivite, sa poti avansa.\n\r\n\tRaion Manager\n\r\nRaion managerul asigura activitatea comerciala din cadrul magazinului si detine responsabilitati de gestiune a stocului pentru raionul care ii este atribuit. De asemenea, el organizeaza si supervizeaza activitatea asistentilor de vanzari de pe raionul de care se ocupa si se implica activ in rezolvarea problemelor de orice natura, care pot apare in raionul respectiv.\r\nResponsabilitati: \n\r\n- Coordoneaza activitatea comerciala in cadrul raionului;\r\n- Atingerea obiectivelor de performanta pe categoria pe care o reprezinti;\r\n- Satisfacerea cerintelor clientilor cu profesionalism si printr-o atitudine de vanzari consultativa cu scopul de a crea cea mai buna experienta pentru client;\r\n- Mentine relatia cu furnizorii;\r\n- Asigura necesarul de marfa pe categorii de produse;\r\n- Asigura display-ul de marfa in magazin;\r\n- Promoveaza produsele de care este responsabil si asigura procesul de vanzare.\n\r\nCerinte\n\r\n- Studii superioare finalizate-preferabil Economice/Comert;\r\n- Cunostinte operare PC (Microsoft Office – Word, Excel , E-mail) – nivel mediu;\r\n- Cunostinte in domeniul produselor electronice, electrocasnice, it & multimedia;\r\n- Alte cunostinte: evidenta gestiuni stocuri, cunostinte in domeniul vanzarilor;\r\n- Orientare catre client;\r\n- Bune abilitati de comunicare;\r\n- Integritate.\n\r\n\tAsistent vanzari\n\r\nScopul principal al Asistentului de Vanzari in Altex este acela de a-si indeplini obiectivele de vanzari prin crearea unei experiente de cumparare memorabila clientilor Altex, bazata pe respect, disponibilitate si solutionarea eficienta a nevoilor clientului.\r\nResponsabilitati:\r\n- Asigura vanzarea produselor si serviciilor oferite de catre companie;\r\n- Cunoaste si ofera informatii despre caracteristicile tehnice si modul de folosire ale produselor;\r\n- Identifica nevoile clientilor si ofera consultanta in alegerea produselor in acord acestea;\r\n- Realizeaza target-ul lunar de vanzari;\r\n- Serveste clientii intr-o maniera prompta si politicoasa.\n\r\nCe cautam la urmatorul Asistent Vanzari? \n\r\nPregatirea necesara obligatorie:\r\n- Experienta relevanta in promovarea si vanzarea de produse electronice, electrocasnice, entertainment, IT si comunicatii;\r\n- Studii medii / superioare;\n\r\nCompetente necesare:\r\n- Usurinta in stabilirea relatiilor interpersonale;\r\n- Capacitate si disponibilitate de asimilare rapida a informatiilor noi;\r\n- Atentie la detalii;\r\n- Toleranta crescuta la stres;\r\n- Capacitate de a lucra sub presiune;\r\n- Capacitate de analiza si rezolvare rapida a problemelor de vanzare;\r\n- Orientat in aceeasi masura si catre client si catre rezultat;\r\n- Perseverenta si incredere in sine;\r\n- Empatie;\r\n- Stabilitate emotionala;\r\n- Integritate profesionala. \n\n\n \n\n\n", "title": "ALTEX BISTRITA Raion Manager,  Asistent Vanzari", "company_url": "http://www.bestjobs.ro/firme/altex-romania-srl/25746/1", "career_level": "Entry, Middle", "company": "Altex Romania SRL", "locations": "\nBistrița, Județul Bistrița-Năsăud, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-altex-bistrita-raion-manager-asistent-vanzari/752017/1"}