{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a longterm basis, offering at the same time a wide variety of features such asexpertise, challenging development opportunities in an international environmentand the joy of a strong spirit.\r\nResponsibilities:\r\nLa mission générale du « Chef de Projet Processus Liquidité et ALM » est de définir, formaliser et mettre en œuvre un périmètre de processus qui lui est confié, liés aux sujets décrits ci-dessus.\r\n• A la mise en place de nouveaux volets (nouvelles métriques ou nouveaux reportings à produire, augmentation de la fréquence, réduction des délais)• à des travaux de revue, optimisation et amélioration continue des processus existants à l’initiative des sponsors (alimentations « filière gestion »), des utilisateurs (ajustements, restitutions, industrialisations), des régulateurs (évolutions des reportings, recommandations BCE, renforcement des contrôles), voire de projets connexes.\r\nCe travail doit souvent être réalisé sur la cible mais aussi être décliné pour chaque étape de la trajectoire de déploiement de cette cible, en accompagnement des étapes de mise en œuvre définies par le Programme Liquidité + ALM.\r\nLe Chef de Projet Processus Liquidité et ALM doit donc être un professionnel familier des bonnes pratiques qu’il aura à appliquer en étant en charge des activités suivantes : • Management non hiérarchique de différentes ressources travaillant en équipe et à coordonner et à fédérer• Gestion de projet (organisation des travaux, préparation et animation de réunions, pilotage des délais des coûts et de la qualité, gestion des alertes et les points de blocage, escalades si besoin) et de projets IT en particulier (de l’expression de besoins à l’homologation).• Analyse et conception de processus• Formalisation de processus (cartographies et synoptiques, RACI, délais, outils, points de contrôle, KPIs, procédures modes opératoires et fiches de poste, etc)• Conduite du changement auprès des utilisateurs et partie-prenantes. La qualité de cet accompagnement conditionne souvent l’appropriation effective des processus et donc le succès de sa mission. Il a à cœur d’organiser et réaliser les actions de communication information et formations nécessaires auprès des publics concernés.\r\nIl devra avoir un bon niveau d’autonomie dans l’exercice des responsabilités ci-dessus.\r\nRequirements:\r\n• 3 ans d’expérience en Project Management• 1 an d’experience in Process Management (mapping et optimisation des processus)• Bonne compréhension de la méthodologie des projets IT– compréhension de business et des spécifications fonctionnelles, tester, gestions de , formation des utilisateurs);• Connaissances de IT–  Lycée Informatique or Faculté de Cybernétique -ASE• Bonne connaissances de Français • Etudes financière-banquière – Académie des Etudes  Economiques• Connaissances de reportings de liquidité régulateurs– l’expérience sera un avantage• 6 mois - 1 an de travail en Paris\n\r\nPlease note that only the selected candidates will be contacted for an interview and all the CVs will be kept in our database for future suitable professional opportunities.\n\r\nSociété Générale European BusinessServices is a player in the shared service center market and delivers highadded value services in various fields of activity for worldwide entities ofthe Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20countries mostly across Europe for all major business lines of the Société Générale Group.\r\nThe Finance Shared Service Center of SociétéGénérale European Business Services, launched in 2011, now counts more than 250staff delivering services for more than 300 client entities.\r\nThe team’s activity consists indelivering two important kinds of processes: accounting – namely Groupreporting in IFRS, statutory and regulatory reporting on top of the permanentsupervision activities and related set of control; and Account Payable and Travel& Expenses, with teams specialize in optimizing all procure to pay activities. \n\n\n", "title": "Project Manager Liquidity process&ALM with French", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-project-manager-liquidity-process-alm-with-french/749720/1"}