{"body": "\n\n\n\nSB Software is an international software developer committed to providing a highly professional complete suite of integrated retail management system for Lifestyle Retail with planning, goods allocation and reporting features, to ensure a continuous flow of data from the point of sale, via the branch, to the head office. Our suite of products is currently used internationally by customers with more than 700 installations in companies engaged in various lines of businesses and with various organizational structures (chain of branches, department stores, and franchise and concession concepts).\r\nSB Software is looking for a wide range of entry-level and experienced professionals with strong informatics / technical skills and a \tdedication to excellence, able to work full-time in a challenging multicultural environment.\r\n\tDescrierea postului: \r\n\tSB Software is looking for a full-time C#.net developer able to work in a team environment and alone to develop application for retail \tfield. \r\n\tThe job responsibilities are: \r\n•\tAnalyze clients requests about software needs\r\n•\tDesign and develop program interfaces\r\n•\tWrite detailed technical specifications for applications\r\n•\tSoftware development\r\n•\tSoftware testing and maintenance\n\r\n\tCerinte: \r\n\tThe ideal candidate MUST have: \n\r\n•\tComputer science (or equivalent) degree\r\n•\tStrong knowledge of C#, C++, Windows Forms ADO.NET, ASP.NET, MS SQL Server; knowledge of object oriented programming\r\n•\tAbility and willingness to learn new technology quickly\r\n•\tAbility to work in a team; communication skills\r\n•\tClient oriented attitude\r\n•\tAnalytical skills\r\n•\tAttention to details\r\n•\tInitiative \r\n•\tStrong problem-solving skills\r\n•\tEnglish - advanced level\r\n•\tItalian - would be a plus\n\n\r\n Send your CV : office@sbsoftware.ro \n\n\n", "title": "PROGRAMMER", "company_url": "http://www.bestjobs.ro/firme/sb-software-srl/3718812/2", "career_level": "Entry, Middle", "company": "SB Software SRL", "locations": "\nStr.Eremia Grigorescu Nr.1, Timișoara, Județul Timiș, România\n", "languages": " Engleza, Italiana", "url": "http://www.bestjobs.ro/locuri-de-munca-programmer/230950/2"}