{"body": "\n\n\n\nWe have an open position of Country Manager Assistant, as contractor position, for non-determined period, reporting to Romania Country Manager, located in Bucharest.\n\r\nPlease find below the main responsibilities of the above-mentioned position.\n\r\nResponsibilities: \n\r\n \tProvide full range of administrative support to the Country Manager including, but not limited to, scheduling meetings, managing travel arrangements, processing expense reports, and providing other site-specific assistance;\r\n \tCoordinates the arrangements for meetings, manages and coordinates agenda, books relevant facilities and equipment; attends and takes minutes upon request (e.g. Country Management Forum Meetings, other meetings organized by the Country Manager);\r\n \tPrepare and edit meeting agendas, minutes, action items, and presentations using Microsoft Office;\r\n \tCoordinates registration, travel and accommodation arrangements for the Country Manager and Leadership Team colleagues travelling with the Country Manager;\r\n \tPlans, organizes and prioritizes work on a daily basis in order to meet deadlines;\r\n \tPrepares routine documents as requested by the Country Manager;\r\n \tManages the Country Manager’s financial/administrative information (e.g. invoices, expense requests, keeping track of budget);\r\n \tManages financial/administrative information (e.g. invoices, expense requests, keeping track of the team’s budget), checks and validates information; checks for errors/discrepancies.\n\n\r\nSkills, Knowledge, Qualifications & Experience:\n\r\n \t1-3 years previous experience in relevant senior secretarial or administrative role\r\n \tUniversity degree\r\n \tAdvanced English level\r\n \tAbility to work under pressure (e.g. cope with multi-tasks) whilst maintaining quality\r\n \tComputer literacy – Microsoft Office (Word, Excel, Power Point)\r\n \tVery good ability to plan, organize, prioritize\r\n \tAbility to communicate effectively verbally and in writing\r\n \tSystematic thinking and ability to work according the instructions\n \n\n\n", "title": "Country Manager Assistant", "company_url": "http://www.bestjobs.ro/firme/pfizer-romania-srl/1912605/1", "career_level": "Middle", "company": "PFIZER ROMANIA SRL", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-country-manager-assistant/752309/1"}