{"body": "\n\n\n\nWe are looking for YOU! A new colleague, front-end enthusiast and open minded about the new UI technologies wanting to join our young and agile development team. We strive to excel in Software Development and together we can accomplish great things and transform the future.             Join our vision and come work for the Telecom Expense Management solutions US leader, using the latest technologies.  In our creative environment, you will be highly appreciated and you can make a tremendous contribution that you always wanted to make.Requirements• Minimum 1 year HTML5, Javascript, CSS• JQuery and/or angular JS experience•\tExperience developing for multiple browsers•\tExperience with version control software•\tExcellent detail orientation and problem solving skills•\tGood command of SQL•\tGood command of the English languageOptional:•\tExperience with a javascript testing framework like Jasmine•\tKnowledge of Linux commands, shell scripting•\tExperience in working with web application servers (example: Tomcat, WebSphere, Weblogic, etc.)Education• Bachelor degree in Computer Science.Advantages and Benefits• Permanent Labor Contract, motivating salary based on skills and performance. • Medical Insurance• The opportunity to develop a career within a stable multinational environment• Access to the last software technologies. Training and certification supported by Asentinel• American standard, non-stressful working conditions, excellent green environment, free parking space• American management and company culture• Monthly Parties, Halloween Party, Christmas Party and other recreational activities. \n\n\n", "title": "Software Web UI Developer", "company_url": "http://www.bestjobs.ro/firme/asentinel-international-srl/2845216/2", "career_level": "Entry, Middle", "company": "Asentinel International SRL", "locations": "\nStrada Aleea Lacul Morii Nr.3 Sector 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-web-ui-developer/230026/2"}