{"body": "\n\n\n\nRed Mountain Management (RMM) is a Romanian consultancycompany activating within the financial investment services market.Starting with the Quality department, our trainers, analysts, tech support, back office and the management, the cohesion and energy of our team, together with the desire to assert oneself are the secret to being successful in one of the most challenging business spheres today.We are recruiting passionate and motivated people, able to deliver results against objectives and meet the company expectations in a professional and dynamic manner.Main Responsibilities Description: •\tEnsure procedures are followed•\tVerify and check information provided to our customers•\tTest and check recorded calls and their quality•\tPrepare reports with conclusionsSpecific Job Requirements: •\tPrevious experience - advantage•\tExcellent verbal and written skills in English. Other languages a plus•\tInterpersonal skills•\tStrong problem solving skills•\tSelf-starter who can get things done with minimal direction•\tTeam Player•\tDetails orientedWe offer:- Motivating position and unique chance for professional development in the local office of a major international company. - Dynamic, multinational work environment in a young team & young startup branch - free of slow corporate procedures & regulations.- Opportunities for personal development through training courses.- Competitive remuneration package.- Medical insurance.- Professional training and ongoing coaching.If you enjoy being challenged over and over again, but also to have fun, Red Mountain Management will be the best place for you to work.  \n\n\n", "title": "Quality Control Representative", "company_url": "http://www.bestjobs.ro/firme/red-mountain-management/13597751/5", "career_level": "Entry, Middle", "company": "RED MOUNTAIN MANAGEMENT", "locations": "\nAcademiei 28-30, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-quality-control-representative/199488/5"}