{"body": "\n\n\n\nThe Customer Service Representative will be responsible for delivering exceptional service to our customers and clients. He or She will combine skills, passion, customer-focus, positivity and helpful mindset to elevate Avangate`s service delivery and will be a strong contributor to the overall success we achieve. This position serves as a customer/client advocate, which involves hands-on contributions to the daily departmental work load, handling incoming calls and emails.Main Responsibilities:Handle customer requests via phone or e-mail related to payment process and platform showcasing excellent interpersonal skills;Provide problem resolution and customer satisfaction which may include:Answering questions regarding the purchase and/or how to download the software;Initiating a refund;Assisting a customer with ordering;Secure handling confidential information according to internal rules;Update internal database with critical information regarding problem resolution;Proactively identify areas for improvement within the CS department and make recommendations on how to solve such challenges;Ability to effectively communicate with customers to resolve any issues of customer experience with the Avangate platform or arrears;Performance of other duties and projects as required by supervisor;Available to work daily on Russian Business hours. Job Requirements:High school / College diploma, or equivalent/ Bachelor's diploma, or equivalent is a plus;Previous work experience in customer care or technical support (online order experience is a plus);Experience with billing and payments is a plus;Sound knowledge of Internet technologies;Sound knowledge of eCommerce concepts is a plus;Strong PC skills in Windows environment and familiarity of Microsoft Office Suite including Excel, Word & Outlook;Excellent command of Russian language;Good command of English language (both written and spoken);Flexible, creative person with planning and organizational skills;Talks in a way the customer can understand;Accurate working style and with an eye for detail;Willingness to take responsibilities;Demonstrate exemplary maturity and professionalism on a daily basis, toward both customers and colleagues;Focus, problem solving skills.Job Benefits:Strong corporate culture open towards innovation, commitment and people;Young, dynamic team and international work environment;Attractive financial and benefits package;Lunch every day with your colleagues at the company restaurant (within the building);Healthcare services for you through private medical subscription. \n\n\n", "title": "Customer Service Representative - Russian&English", "company_url": "http://www.bestjobs.ro/firme/avangate/2748/1", "career_level": "Entry, Middle", "company": "Avangate", "locations": "\nBulevardul Dimitrie Pompei nr.10A Bucuresti, București, Municipiul București, România;Bulevardul Dimitrie Pompeiu 10A București, București, Municipiul București, România\n", "languages": " Engleza, Rusa", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-service-representative-russian-english/748065/1"}