{"body": "\n\n\n\nYour role within our KingdomWe’re looking for an exceptionally skilled Technical Lead with strong Java skills to establish and lead development of an innovative new tools for our game teams in our QA Hub in Bucharest.The King QA Hub is the evolution of two years of designing and implementing a different way of thinking about QA and building the tools and expertise needed to support it. At King, QA means Quality Assistance, which is all about equipping teams with the knowledge they need to take ownership for the quality of their games. We do this by providing different testing services throughout the software development life cycle. We are focused on building the future of testing tools that improve productivity and quality. As a Development Team Lead at King, you’ll have a great opportunity to build the systems we need, as we don’t depend heavily on external frameworks. You’ll be involved in making the architectural decisions that will ensure that the quality of our systems is the best.We offer you the chance to work in an Agile environment where frequent, fast-paced releases mean you’ll see the impact of your work almost immediately. You will among other things…•\tHelp build a team of front and backend Developers•\tLead the team and ensure its effort is invested focusing on the areas that reap the most benefit for the company•\tResponsible for defining and overseeing technical architecture and development best practices•\tDesign and implement server features required to support new game and platform functionality and releases.•\tDeliver code (and supporting documentation) of the highest quality through good design, attention to detail and system testing on a timely basis.•\tSupport the technical and professional development of the DevelopersWorking in the QA Hub provides opportunities to learn different testing disciplines and working with cutting-edge technology on all mobile platforms. This all happens in a space designed specifically to support your own way of working.Skills to create thrillsYou have great passion for programming and a solid sense of quality and polish. As a developer you are also analytical and genuinely interested in understanding the whole tech stack. Other skills include:•\tExperience in designing robust, highly scalable systems.•\tAble to architect & design components, features and systems.•\tVery experienced in Java, databases and web development in general.•\tFamiliar with HTML, CSS, Javascript, JSP, Bash.•\tNo stranger to web protocols, application servers and web servers.•\tStriving to be a genius in your area of expertise.•\tUsed to TDD, UNIX environments, VCS•\tA team player who likes to discuss solutions and ideas.•\tAble to translate business needs to technical requirements and implementation.•\tMotivated by challenges and new opportunities.•\tFluent in English.We’re knights of creativityWe believe that great games are developed by working in small, autonomous creative teams that control the whole process – from idea to amazing game. Our close connection with and instant feedback from the player community, enables us to deliver truly magical moments. We value your free time and your need to refuel, relax and find inspiration – by playing games with your colleagues, being at home with your family or going to the gym or out for a run. That's how we stay creative. That’s why we call ourselves developers of magic and knights of creativity.  Want to join our Kingdom?Please send us your CV by clicking the ‘Apply now’ button. All applications must be in English.  The brilliant experience we give our players comes from the diversity and experience of our people. A great saga needs all sorts of heroes. That’s why we hire all sorts of talent. \n\n\n", "title": "Development Team Lead", "company_url": "http://www.bestjobs.ro/firme/king/13337673/5", "career_level": "Senior", "company": "King", "locations": "\nCostache Negri, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-development-team-lead/199928/5"}