{"body": "\n\n\n\nÎnfiinţată în 1991, CRIsoft a dobândit o vastă experienţă în analiza, conceperea, dezvoltarea şi implementarea de soluţii software integrate, timp în care motto-ul companiei “Programe care gândesc” a reuşit să impună la propriu o nouă abordare în acest domeniu.Profilul candidatului: • Excelente abilităţi în design, dezvoltare şi programare Java; • Experienţă de lucru cu servere de aplicaţii (Tomcat / JBoss / Glassfish / Websphere); • Experienţă în HTML, CSS, Javascript, JQuery; • Cunoştinţe de arhitectură software şi Design Patterns; • Cunoştinţe de operare şi programare a bazelor de date SQL (cunoştinţele de PL/SQL constituie un plus); • Familiaritate cu unelte de Continuous Integation (ant/ svn/ Jenkins/altele); • Familiaritate cu Unit Testing (JUnit); • Experienţă în analiza de cerinţe şi redactarea de specificaţii tehnice; • Bune abilităţi de comunicare şi relaţionare; • Persoana independentă, orientată spre rezultate şi rezolvare de probleme; • Bună capacitate de organizare; • Engleză fluent. Responsabilităţi: • Analiza  specificaţiilor  tehnice  pe  baza  cărora  se implementează/configurează/integrează aplicaţiile specifice; • Proiectarea şi  dezvoltarea  de  aplicaţii şi  interfeţe de integrare; • Testarea   modulelor   implementate şi   rezolvarea bug-urilor aparute în procesul de implementare; • Elaborarea     documentaţiei     de     utilizare şi administrare a sistemului. CRIsoft vă oferă: • Posibilitatea de a lucra cu experţi în domeniu şi tehnologii de vârf; • Oportunitaţi de dezvoltare personală, cursuri şi certificări profesionale. Aplică acum! Departamentul Resurse Umane hr@crisoft.roVă rugăm să specificaţi denumirea funcţiei şi locaţia pentru care aplicaţi în subiectul mesajului. \n\n\n", "title": "Senior Java Developer", "company_url": "http://www.bestjobs.ro/firme/crisoft/31069/1", "career_level": "Senior", "company": "CRIsoft", "locations": "\nBd. Victoriei Nr. 12, Brașov, Județul Brașov, România;Str. Av. Nicolae Drossu Nr. 19, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-java-developer/747588/1"}