{"body": "\n\n\n\nFollow our job advertisements and join the exciting world of automotive industry today; come and meet the challenges and opportunities of a fast paced environment that will excite and develop you as a young professional! Delphi is willing to grow young talents into young professionals! In the same time, we have a deep knowledge to share and we need the expertise of senior professionals! Be smart and we shall use your creativity, be proactive and we shall appreciate your initiatives, be remarkable and we will definitely see you standing out from the crowd.\n\n\r\n Quality Engineer for Sannicolau Mare Plant \n\n\r\nJob Requirements:\n\r\n•\tGraduate Engineer of technical University;\r\n•\tMinimum of 2 year experience in the Quality field, preferably Automotive;\r\n•\tExperience in wiring harness business represents and advantage;\r\n•\tExperience and abilities in managing auditing systems and developing improvement plans;\r\n•\tTeamwork, result orientation and passionate for excellence; \r\n•\tBasic MS Office knowledge;\r\n•\tGood knowledge of Automotive Standards: ISO TS 16949, VDA 6.3, VDA 6.5;\r\n•\tKnowledge of VW Group customer requirements is an advantage;\r\n•\tExperience in dealing with customers;\r\n•\tStrong presentation, communication, group facilitation, conflict management and training skills;\r\n•\tExperience with AIAG core tools, PPAP, APQP, MSA & SPC;\r\n•\tAnalyze and troubleshoot processes for rework and scrap reduction opportunities;\r\n•\tSix Sigma certification represents an advantage;\r\n•      Willing to travel to Sannicolau Mare (daily commute).\n\n\n\r\nMain Duties and Responsibilities:\n\r\n•\tContinuous improvement leader of voice of process and voice of customer processes;\r\n•\tResponsible for investigating internal concerns along with external customer concerns, implementing corrective action and validating the root cause as needed;\r\n•\tIssues 8D reports and maintain Delphi Packard Resolution Tracking System; \r\n•\tDevelop and maintain the Project Quality Improvement Plan;\r\n•\tDevelop and maintain the Project Control Plan;\r\n•\tDirect plant connection to CSE and customer for product quality problems;\r\n•\tParticipate to Engineering Change feasibility studies and conducts System Releases;\r\n•\tProactively investigate ways to improve the process to reduce waste, scrap and customer concerns;\r\n•\tCreate Quality Alerts and customer specific Quality presentations;\r\n•\tAssist Operating System Audits, develop and maintain action plans to achieve target rating;\r\n•\tAssist Delphi Business System audits, develop and maintain action plans to achieve target rating.\n\n\n\n\r\nIf you think this is the opportunity you have been looking for, please send an application letter stating your career options and an application in English by e-mail to the following e-mail address: andrada.sitaru@delphi.com or apply on-line. All information regarding your application will be treated with the utmost confidentiality. Only selected candidates will be contacted for an interview. Delphi Packard Romania, 305600, Sannicolau Mare, Str.Garii, nr.11 tel: +40 (256)-309 300/ 0799513131 www.delphi.com\n\n\n \n\n\n\n\n", "title": "Quality Engineer", "company_url": "http://www.bestjobs.ro/firme/delphi-packard-romania-srl/849436/1", "career_level": "Entry, Middle", "company": "Delphi Packard Romania SRL", "locations": "\nArad, Județul Arad, România;Balcescu, Lugoj, Județul Timiș, România;Balcescu, Moldova Nouă, Județul Caraș-Severin, România;Calea Aradului nr. 23, Ineu, Județul Arad, România;Eminescu, Orșova, Județul Mehedinți, România;Iancu, Reșița, Județul Caraș-Severin, România;Lugojului, Caransebeș, Județul Caraș-Severin, România;Piata unirii, Timișoara, Județul Timiș, România;Stadionului, Sânnicolau Mare, Județul Timiș, România;Str. Campurilor nr. 2B, Arad, Județul Arad, România;Timișoara, Județul Timiș, România;Timisorii, Sânnicolau Mare, Județul Timiș, România;Zona industriala, Arad, Județul Arad, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-quality-engineer/751350/1"}