{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. \n\r\nHoneywell Aerospace is looking for a Capital Buyer to join the Romanian office in Bucharest!\n\n\r\nThe Capital Buyer, within the ISC (integrated supply chain) Indirect Procurement organization, will report solid line to the Capital Senior Manager for Capital Center of Excellence and is responsible for all aspects related to the purchase of Direct and Indirect Capital purchases. \r\nThe Buyer thoroughly understands and adheres to Honeywell sourcing policies/ procedures and Code of Conduct.\n\r\nIn this role, you will be:\n\r\n•\tPerforming all procurement activities\r\n•\tbe proficient with electronic purchasing systems\r\n•\tnegotiating with suppliers, and analyzing total costs and will protect the Company's interests by reviewing and utilizing appropriate contract terms and conditions and contract templates\r\n•\tCompleting in-depth price analyses, marketplace surveys, and sole and single-source justifications\r\n•\tDeveloping formal negotiation plans\r\n•\tImplementing quality requirements and resolves exceptions to terms and conditions. Transactions may exceed $100,000 with a high level of complexity being exhibited on a portion of assignments\r\n•\tEffectively interacting with multiple departments at all levels of internal and external organizations\r\n•\tProfessionally resolving problems in a fair and ethical manner. \r\n•\tAssisting the Sourcing Manager in driving all indirect goals & initiatives, and will recommend actions to meet goals and initiatives\r\n•\tAdministering purchase orders\r\n•\tPurchasing order placement\r\n•\tSupporting internal customer requirements\r\n•\tEnsuring equitable opportunity for qualified suppliers\r\n•\tE-Sourcing (RFx and e-Auctioning events)\r\n•\tAnalyzing competitive bids and formulate purchase recommendation\r\n•\tComparing/ evaluating procurement cost\r\n•\tControlling costs and obtaining savings by using target pricing, reverse auctions, negotiations, and market tests\r\n•\tConducting Price/ Cost Analysis\r\n•\tConsulting with Commodity Leaders to identify cost savings projects/ opportunities\r\n•\tMeeting or exceeding established goals and objectives\r\n•\tOther duties and responsibilities as may be assigned by management, 100% tactical \n\n\n\r\nIf you have:\r\n•\tBachelor's degree from an Accredited University in business or technical field\r\n•\t2-3 years procurement experience in goods and services buying\r\n•\tProficiency working with MS Office Tools (Word, Excel, PowerPoint)\r\n•\tExcellent written and verbal English (German or Czech communication skills are considered a great plus)\n\r\nThe following are desirable qualifications:\r\n•\tWorking knowledge of purchasing procedures, concepts, products, services and strategic supplier management\r\n•\tContracts negotiation experience\r\n•\tGreen belt or lean certification\r\n•\tE-Auction experience\r\n•\tCapital experience\r\n•\tCasting and Machining Knowledge\r\n•\tDirect and/ or Indirect purchasing experience\n\r\nThen, join us!\n\r\nWant to learn more? Visit:\r\nOur career website: www.careersathoneywell.com\r\nChannel: http://www.youtube.com/watch?v=CcMf_TFS0kA\r\nhttp://www.youtube.com/watch?v=Tj8Jr2USl4M\n\r\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status. - See more at: \r\nhttp://www.careersathoneywell.com/en/jobsearch/jobdescription.aspx?languageid=1&jobid=00281661#sthash.O3RzNOF7.dpuf\n\n \n\n\n", "title": "EMEA Capital Buyer (job no. 00306529)", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Middle", "company": "Honeywell", "locations": "\nStrada George Constantinescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-emea-capital-buyer-job-no-00306529/750707/1"}