{"body": "\n\n\n\nJob Description Working in the Network Operations Center, the Intermediate Analyst – Telecommunications will focus on functional analysis and technical support for any telecommunications-related equipment or infrastructure application problems and will have the opportunity to learn about other fields (server, email, remote access, Web access). The incumbent will also monitor service availability of existing infrastructure at various SNC-Lavalin business units and project sites. The duties will require ongoing cooperation with the GIT services center, the implementation/maintenance group and external GIT resources. Responsibilities • Diagnose and solve hardware and infrastructure application problems mostly related to servers management (material and operating systems) • Administer and monitor the main infrastructure components at various business units and project sites • Analyze causes of incidents and document them • Identify and report performance problems related to material problems or server exploitation systems • Identify and report hardware or link-related performance problems • Consult specialized technical resources for complex cases Requirements Qualifications & Experience: • University Diploma in Information Technologies• At least 3 years of general experience in network administration or any other relevant experience • Good knowledge of and experience with Microsoft Windows Server 2003/2008/2012 • Good knowledge VMware ESX server administration • Good knowledge of and experience with Back-up systems • Good knowledge of Active Directory, DNS and DHCP • Good knowledge of TCP/IP protocol • Experience with large and complex environments • Good knowledge of IIS 6 or new version Capabilities: • Proficiency in English (French writing and speaking is an advantage)• Attention to detail and thoroughness• Customer service oriented• Ability to work well in a team environment.  \n\n\n", "title": "NOC SERVER ANALYST", "company_url": "http://www.bestjobs.ro/firme/snc-lavalin-romania/12574356/1", "career_level": "Middle", "company": "SNC Lavalin Romania", "locations": "\nDimitrie Pompeiu 5-7, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-noc-server-analyst/748663/1"}