{"body": "\n\n\n\nJOB SUMMARY\n\r\nGrow with us as HR workstream Project Assistant.\n\r\nYou will be part of the European HR Transformation project team, specifically the Process & Policy workstream. You will support the workstream in the coordination of HR Process & policy related activities across Europe, working in close partnership with internal Subject Matter Experts.\n\r\nYou will have experience in supporting the delivery of complex transformation projects in a multinational environment, in partnership with internal HR Transformation workstreams, global project teams, HR subject matter experts, etc.\n\r\nWHAT WILL I BE DOING?\n\r\nWhen joining the European HR Transformation project team, you will be a member of the Process and Policy workstream and your main tasks will be: \r\nEngage and partner with Kellogg Subject Matter Experts to gather and develop detailed procedure documentation and policies for HR processes across all European countries\r\nExplore options and potential ideas to build and implement a new European policy portal \r\nSupport internal project by managing a large amount of data and information for reporting and tracking\r\nSupport ad hoc project activities as and when required\r\nSupport the delivery of project milestones by undertaking project co-ordination activities\r\nBe an active member of the European HR transformation team, working in partnership with the global project team\n\r\nWHAT DO I NEED TO DEMONSTRATE?\n\r\nRequired:\r\nBachelor/Master Degree or equivalent plus relevant business qualification \r\nExperience in Human Resources, ideally HR shared services\r\nProject Management experience ideally linked to HR processes\r\nExperience in working across multiple countries and cultures\r\nAbility to monitor, prioritize and resolve issues\r\nStrong verbal and written communication skills\r\nProactive and follow through attitude\r\nExcellent knowledge of Microsoft (Excel, PowerPoint, Visio , etc)\r\nIdeally good knowledge of HR systems i.e. SAP, Taleo, Success Factors\r\nHighly motivated and able to work in a fast changing, dynamic environment\r\nAble to work in a multi-cultural and multi-disciplined team\r\nExcellent team player \r\nWHAT ELSE DO I NEED TO KNOW?\n\r\nSignificant amount of travel across Europe will be required for the role.\n\r\nThis role is 6 to 9 months Fixed-term contract.\n\r\nFluency in English is required. Another European language is a plus.\n\r\nPlease note that we will only accept applications that are made to us via our Careers site.\n\r\nIf you experience any difficulty when applying please contact hrsharedservice@kellogg.com.\n\r\nPlease note that the closing date may be subject to change. We will interview suitable candidates as they apply, so please don’t hesitate to take this opportunity to submit your application as soon as possible.\n\r\nIf you would like to be immediately notified of new Kellogg's opportunities, please go to ‘Create or access my profile’ and complete the information required in the ‘Job Alerts’ section. You will then receive email alerts as soon as new jobs are advertised.\n\r\nThe Kellogg Company is an Equal Opportunity Employer who strives to provide an inclusive work environment that involves everyone and embraces the diverse talent of its people.\n \n\n\n", "title": "HR Project Assistant, Process and Policy 6-9 months", "company_url": "http://www.bestjobs.ro/firme/kellogg-european-services-support-srl/13873245/5", "career_level": "Entry, Middle", "company": "KELLOGG EUROPEAN SERVICES SUPPORT SRL", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-hr-project-assistant-process-and-policy-6-9-months/208643/5"}