{"body": "\n\n\n\n As a Resolution Team Supervisor in the Global Finance Shared Service Center (GFSSC), you will be supervising activities of the Contact and Resolution Center team that comprises in assisting the members of the teams in troubleshooting, owning issues to resolution and responding to general inquiries or escalations in a clear effective way. The Resolution team composed by 2 teams: one team dedicated to customer contact on GFSSC activities (75% Accounts Payables flow resolution) and the other team Master File Data Maintenance for Suppliers and Customers in ERP. You will also provide guidance and mentoring to team members, evaluate and take actions when need to correct or improve activities, and will be collaborating with other GFSSC departments and Business Units.  Responsibilities: • Leads the GFSSC Resolution Team activities and delivers service level agreed on and drives strong quality and customer service • Manages financial enquiries (internal & external) through Service Desk Express (SDE) and monitor all open tickets: dispatching, taking escalations • Leads transitions for incoming activities to the Team • Coordinates the documents and maintains procedures and makes sure the team is acting accordingly • Prepares and deliver training , update the training documents • Identify areas for improvement in either business processes or the system • Develop and maintain KPIs of the team activities; follow the the KPIs and intervene for improvement • Demonstrates a constructive, enthusiastic leadership style, coaching the team and members for performance • Communicates effectively – clearly and proactively communicates to partners and team • Highly collaborative; seeking and supporting cross-boundary relationships • Drives for Results - Highly productive; meets or exceeds multiple/simultaneous always professional demeanor • Contribute to developing a Team-Based culture. Requirements:• Proficiency in English is a must and advanced French is desirable • Strong customer service skills and deliver excellence • Experience working in an ERP(SAP, Oracle e-Business Suite would be an asset) • Experience in one or more of the processes flows Procure to Pay(AP,PO, Create Supplier), Order to Cash(AR, Collection, Client Billing, Create Customer);GL • 1+ years experience as Supervisor or Team leader or equivalent • Knows Accounts Payables, Create and update Vendors in ERP and Resolution Center • Operational flows and metrics /quality measures KPIs • Strong knowledge of the Microsoft Office Suite • Bachelor of commerce with major in accounting or finance systems • Excellent oral and written communications skills • Ability to multi-task in a fast-paced, demanding environment • Strong analytical skills • Efficient time management • Experience and strong skills in training delivery will be an asset • Self-motivated, independent and ability to execute with minimum supervision • Team player. Additional Information Working hours allocated to team members in organization: 4 days 10-19(+/– 1 hour) shift and one day per week 13:30-22:30 shift, meant to overlap with Canada time zone; possible shift planning; Only candidates selected for an interview will be contacted. We are an equal opportunity employer.  \n\n\n", "title": "GFSSC Resolution Team Supervisor", "company_url": "http://www.bestjobs.ro/firme/snc-lavalin-romania/12574356/1", "career_level": "Middle, Senior", "company": "SNC Lavalin Romania", "locations": "\nDimitrie Pompeiu 5-7, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-gfssc-resolution-team-supervisor/748686/1"}