{"body": "\n\n\n\n Descrierea responsabilităţilor postului • Elaborează strategia de comunicare internă;  • Concepe/editează materiale de comunicare internă; • Dezvoltă şi implementează planuri şi proiecte de comunicare internă, care să respecte valorile şi să îndeplinească strategia companiei;  • Se informează în legatură cu cele mai bune practici ale industriei de comunicare;  • Adaptează şi îmbunătăţeşte planurile de comunicare internă conform cu schimbarile şi oportunităţile apărute;  • Propune idei creative şi dezvoltă planurile de implementare ale campaniilor de comunicare internă; • Facilitează procesul de comunicare în interiorul companiei; • Cunoaşte metodele digitale existente în vederea integrării acestora în training;  • Administrează aplicaţia de training on-line; • Dezvoltă cursuri hard şi soft adaptate unei platforme on-line;    • Livrează sesiuni de formare şi dezvoltare profesională în vederea atingerii obiectivelor profesionale ale angajaţilor companiei; • Evaluează eficienţa programelor de formare şi dezvoltare profesională livrate prin organizarea sesiunilor de follow-up; • Propune şi implementează instrumente noi inovatoare în mediul on-line pentru îmbunătăţirea programelor de formare şi dezvoltare profesională existente; • Actualizează documentele necesare desfăşurării activităţii angajaţilor companiei/partenerilor (manuale, materiale de formare şi dezvoltare profesională).Cerinţe   •  Studii superioare absolvite cu diplomă de licenţă; • Minim 2 ani într-o poziţie similară; • Experienţă în: -     conceperea/ editarea de materiale pentru comunicarea interna;-     dezvoltarea si implementarea de planuri si proiecte de comunicare interna; • Abilităţi de prezentare, feedback, debriefing; • Abilităţi de facilitare a discuţiilor în cadrul sesiunilor susţinute; • Abilităţi de analiză şi sinteză; • Abilităţi tehnice dezvoltate; • Orientare spre rezultate;    • Spirit de echipă; • Limba engleză - nivel avansat; • Cunoştinţe PC: Excel, Word, Power Point- nivel avansat.Descriere CompanieCetelem IFN SA este lider pe piaţa creditelor de consum din România şi face parte din grupul financiar francez BNP Paribas Personal Finance. Cetelem, ca marcă comercială a grupului BNP Paribas Personal Finance, este considerat numarul 1 pe piaţa creditului de consum în Europa iarprezenţa în 30 de ţări ale lumii cu peste 29.000 de angajaţi certificăexperienţa şi forţa ce însoţesc activitatea sa. Din 1999 Cetelem (BNP Paribas Personal Finance) este membru al BNP Paribas şi se constituie într-o filială specializată în creditul de consum. Apariţia Cetelem pe piaţa românească a avut loc în mai 2005 prin preluarea societăţii Credisson International SRL. \n\n\n", "title": "Trainer- comunicare internă", "company_url": "http://www.bestjobs.ro/firme/cetelem-ifn-sa/9594431/5", "career_level": "Middle, Senior", "company": "CETELEM IFN SA", "locations": "\nClucerului nr.78-80, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-trainer-comunicare-interna/202298/5"}