{"body": "\n\n\n\n\t\t\t\t\t\t\tHORNBACH se află în topul magazinelor de materiale de construcţii şi grădinărit cu o cifră de afaceri de peste 3 miliarde de euro/an, cu o rețea de peste 150 de magazine şi aproximativ 16.000 angajaţi; momentan în 9 ţări europene.Referent resurse umane (Cod COR - 333304)Responsabilităţi:- Întocmeşte rapoarte şi evidenţe specifice;- Acordă asistenţă directorului de resurse umane în vederea unei bune organizări a departamentului de resurse umane şi asigurării unui real suport în administrarea şi gestionarea personalului: eliberarea adeverințelor, aplicarea formalităților de  încetare a contractelor individuale de muncă, întocmirea contractelor individuale de muncă, a actelor adiţionale, conform prevederilor legale;- Gestionează dosarele de personal;- Desfăşoară şi alte activităţi specifice administrării de personal;- Asigură existenţa şi verificarea documentelor necesare la angajare;- Menţine relaţia cu autoritățile şi prestatorii de servicii;- Răspunde de arhivarea dosarelor de personal curente sau aparținând foştilor angajaţi;- Programează candidaţii pentru interviuri, gestionează baza de date a acestora şi susţine procesul de recrutare.Cerinţe:- Cunoştinţe bune de legislaţia muncii;- Cunoştinţe de limba engleză - limba germană constituie un avantaj;- Experienţa in SAP constituie un avantaj;- Abilităţi de raportare şi sinteză, de planificare, organizare şi prioritizare;- Persoană motivată de post şi de dezvoltarea în domeniul resurselor umane;- Absolvent de studii superioare;- Atestat inspector resurse umane;- Experienţă relevantă în domeniul resurselor umane (minim 3 ani);- Cunoştinţe foarte bune de operare PC (MS Office, Internet); - Nivel ridicat de operare cu baze de date şi statistici specifice în domeniul resurselor umane;- Excelente abilităţi de comunicare şi relaţionare;- Disponibilitate şi rezistenţă la muncă în condiţii de stres;- Persoană bine organizată, ordonată şi eficientă;- Discreţie şi bun-simţ;- Responsabilitate maximă şi loialitate.Ofertă (bonusuri, beneficii):- Oportunitatea de a lucra şi a vă dezvolta cariera într-o companie multinaţională;- Posibilitatea desfăşurării activităţii într-un mediu de lucru dinamic.Aşteptăm CV-ul tău până în data de 15.02.2016 la următoarea adresă:str. Hornbach, nr. 17-21, Domneşti, Jud. Ilfov sau la e-mail: hr_ro@hornbach.com; fax: 021/206.15.32.   \n\n\n", "title": "Referent resurse umane (Cod COR - 333304)", "company_url": "http://www.bestjobs.ro/firme/hornbach-romania/3114604/2", "career_level": "Middle, Senior", "company": "HORNBACH ROMANIA", "locations": "\nHornbach, București, Municipiul București, România\n", "languages": " Engleza, Germana", "url": "http://www.bestjobs.ro/locuri-de-munca-referent-resurse-umane-cod-cor-333304/229867/2"}