{"body": "\n\n\n\nWe have 2 open positions of Key Account Manager Oncology:1 located in Craiova, covering DJ, GJ, MH, OT, VL, AG, TR 1 located in Mures, covering SB, MS, CV, HR, BN, MM Responsibilities:   \tTo Promote Pfizer products to the allocated key clients in order to ensure the achievement of sales targets.  \tTo interact with established customers and to develop new prospects within the assigned territory. \tTo identify the business potential across the territory and initiate appropriate actions.   \tTo organize medical events for Pfizer products in collaboration with colleagues and direct supervisor.Skills, Knowledge, Qualifications & Experience: \tUniversity Degree (Medical or Pharmaceutical graduate is an advantage) \tPreferably sales experience within pharmaceutical industry – for at least 3 years \tOncology experience would be considered a plus \tVery good relational skills \tEnglish Language – medium level \tComputer literacy (Word, Excel, Power Point) \tClean driving licenseWe have 1 open position of Key Account Manager Inflammation, located in Bucharest, covering Bucharest and adjacent counties.Responsibilities:   \tTo Promote Pfizer products to the allocated key clients in order to ensure the achievement of sales targets.  \tTo interact with established customers and to develop new prospects within the assigned territory. \tTo identify the business potential across the territory and initiate appropriate actions.   \tTo organize medical events for Pfizer products in collaboration with colleagues and direct supervisor.Skills, Knowledge, Qualifications & Experience: \tUniversity Degree (Medical or Pharmaceutical graduate is an advantage) \tPreferably sales experience within pharmaceutical industry – for at least 3 years \tVery good relational skills \tEnglish Language – medium level \tComputer literacy (Word, Excel, Power Point) \tClean driving license \n\n\n", "title": "3 positions of Key Account Manager", "company_url": "http://www.bestjobs.ro/firme/pfizer-romania-srl/1912605/1", "career_level": "Middle", "company": "PFIZER ROMANIA SRL", "locations": "\nBucurești, Municipiul București, România;Craiova, Județul Dolj, România;Târgu Mureș, Județul Mureș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-3-positions-of-key-account-manager/749925/1"}