{"body": "\n\n\n\nAs the world’s leading Telecommunications Company, we’re proud to help millions of people in every corner of the globe connect, whether through texting, talking, working, swapping pictures, watching movies... Vodafone Shared Services empowers its people to create value for Vodafone by providing the expertise and insight to drive business transformation, deliver high quality and efficient operations, and enable Vodafone to operate with speed, simplicity and trust. We invite you to join us and start building a career with us! ROLE PURPOSE:- To provide and operate Vodafone’s latest technology services of Unified Communications / Voice over IP solutions for global enterprise customers.- Ensure high availability and optimal performance of all aspects of customer’s services.- Constantly improve and optimize existing ways of working and ensure a cost efficient delivery of services focused on multi-national customers and internal Vodafone user communities across more than 20 operating companies.RESPONSIBILITIES:-To deliver technical support for network applications and systems (2nd Line support).- To provide input for planning, assessment, implementation, rollout and preparation of change requests.- To execute or manage incident, problem and service requests including implementation of workarounds and changes including timely availability of major incident reports for any priority 1 incident and actively driving the implementation of appropriate counter measures.- To work with external customers to define requirements, solve technical issues and provide professional services.- Working to defined service level agreements and key performance indicators.- To assist in the building of knowledge and skills throughout the team and to work to continuously improve service to customers.- Managing technical service ramp-up (installation, configuration and coordination of setup tasks) for network platforms.- Delivering operational and technical expertise for feasibilities, including delivery of cost estimations for network application operations activities during service lifecycle, to ensure services can be efficiently integrated into the existing network landscape.- Setting and continually managing service expectations with customers, Networks Services /Networks operations and business stakeholders.- Managing long term, sustainable relationships with Vodafone’s internal and external sourcing partners to ensure SLA compliance and service improvements for network services according to aligned financial figures.- Identifying, implementing and continuously monitoring sourcing options for the managed service portfolio and provide input for the Network portfolio management process.REQUIREMENTS:Education: Academic levelCore competencies, knowledge and experience:- English proficiency- Experience in a multinational environment.- Experience in designing, operating and managing Networks Platforms in large scale enterprise environment.Desired competencies, knowledge and experience:- Basic programming skills in Perl and UNIX Shell Scripting.- Basic knowledge in IMS Core architecture.Must have technical / professional qualifications:- Experience in Cisco Unified Communications Applications Call Manager, Unity, Presence Servers).- Experience in troubleshooting and configuration of end points and telephony features.- IP Network/Routing knowledge. Routing and switching troubleshooting (interface/port channels status, static routes, OSPF, BGP).- Linux, SOLARIS.- Virtualized environments.- Experience and knowledge of mobile internet communication, protocols (SIP, SIGTRAN, SS7, DIAMETER, CAMEL).- Good understanding of ITIL methodology.What we offer: - Private medical and dental care insurance; - Life insurance; - Special discounts for gyms and retailers; - Project specific training; - A youthful and multicultural working environment with dedicated professionals and great development opportunities.Don’t miss this unique opportunity to enjoy a high challenging profile role, to progress in your career and to develop experience within a world leading and multinational organization. Vodafone Shared Services Center is part of a Global Services Center and will cater for Vodafone operations in different countries, as well as for the Vodafone Group. Our success comes from the outstanding people that make it happen for our customers every day! We’re at our best when you’re at yours! Vodafone Power to you***NOTE: We thank all those who apply; however, only those selected for further consideration in the selection process will be contacted.Due to current immigration restrictions, we are welcoming applications from the persons who have the legal right to work in Romania (these means the citizens of EU countries). \n\n\n", "title": "2nd Line Unified Communication Engineer (VoIP)", "company_url": "http://www.bestjobs.ro/firme/vodafone-shared-services-romania/13832334/5", "career_level": "Middle, Senior", "company": "Vodafone Shared Services Romania", "locations": "\nAvrig 3-5, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-2nd-line-unified-communication-engineer-voip/203015/5"}