{"body": "\n\n\n\nWorkplace: Constanta.A candidate must speak English fluently and have advanced written English skills.CV must be presented in English only. CV presented in any other language will not be taken into account.In case a candidate will be contacted an interview shall be conducted in English.The main object of activity for the Assistant Manager is to provide secretarial, administrative, human resources and marketing support.The Assistant Manager shall have the following duties/responsibilities:•\tManagement of the GD’s diary and appointments;•\tHelp GD manage output, workflow and office deadlines;•\tTake and relay accurate and timely messages from telephone callers, and answer queries where possible;•\tCollect  all mail addressed to the GD;•\tTake minutes for all meetings;•\tDispatch all the GD’s correspondence;•\tLiaise with relevant individuals, external organisations etc. to arrange meetings, prepare agendas and draft minutes;•\tMaintain a comprehensive filing system;•\tCo-ordinate GD’s travel in conjunction with travel agencies;•\tTabulate and retrieve GD’s official expenditures and claims;•\tArrange local transportation when necessary;•\tSome research, media relations and promotional work;•\tUndertake any other duties as requested by the GD;•\tPetty Cash management;•\tManage all internal orders, stationary etc. almost like a procurement officer;•\tLiason for organizing hotels, transfers, flights, meeting rooms;•\tTaking and distributing minutes of meeting;•\tTranslation of documents, correspondence, agreements etc.;•\tTranslator services for official meetings;•\tAcquisition of office supplies;•\tRelationship with the companies for the acquisition, maintenance, repairing of the office equipment;•\tElaboration and keeping up to date of car’s routes and records, fixed assets, inventory objects as per current legislation;•\tResponsibility for the efficiency of the expenses incurred for the office.Professional Training: •\tMaster’s degree•\tForeign languages: English and/or Russian \n\n\n", "title": "Assistant Manager", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nConstanța, Constanța County, Romania\n", "languages": " Engleza, Rusa", "url": "http://www.bestjobs.ro/locuri-de-munca-assistant-manager/748794/1"}