{"body": "\n\n\n\nBitdefender is now looking for a frontend developer to join our team in Bucharest. We need an individual who's passionate for high-quality development and is ready to tackle new challenges on a day to day basis.\n\r\nRequirements:\n\r\n• Strong knowledge of HTML5, CSS3 and browser compatibility;\r\n• Proficient in developing responsively for a variety of mediums;\r\n• Good understanding of Javascript;\r\n• Good working ability with Photoshop;\r\n• Familiar with CSS and JS animations;\r\n• Familiar with software principles (e.g. DRY, KISS);\r\n• Team player, self-motivated, and able to multi-task;\r\n• Excellent comprehension and retention;\r\n• Good English skills written and spoken;\n\r\nResponsibilities:\n\r\n• Being a tireless advocate for the end-user;\r\n• Implement web designs and user interfaces using HTML, CSS, JavaScript (ExtJS framework);\r\n• Write clean, well-engineered, maintainable code;\r\n• Advise, collaborate with, and synthesize feedback from UX designers and other team members;\n\r\nNice to have:\n\r\n• A drive for self-improvement;\r\n• Experience with Git, Mercurial or other version control system;\r\n• BS or higher in Computer Science or related discipline;\r\n• Experience Sass, Less or similar;\n\r\nIf you take up our offer, you will:\n\r\n•\tWork on great technologies & products;\r\n•\tBe a member of a great and highly knowledgeable technical team;\r\n•\tBe part of a multinational company;\r\n•\tBenefit from career development programs; \r\n•\tEnjoy a competitive salary, flexible work arrangements, as well as medical and accident insurance;\n\r\nAbout Bitdefender:\n\r\nBitdefender is the creator of one of the world's fastest and most effective lines of internationally certified internet security software. The company is an industry pioneer, introducing and developing award-winning protection since 2001. Today, Bitdefender technology secures the digital experience of around 400 million home and corporate users across the globe. \n\r\nTop international testing organizations and world-renowned software reviewers acknowledge Bitdefender as the world’s most effective antimalware solutions. In January 2014, Bitdefender has won both awards from AV-Test, becoming the first solution to be named “Best Protection” and “Best Performance” at the same time. Bitdefender’s latest line of products also won the title of “Best Antivirus of 2014” and two Editor’s Choice awards from PC MAG, and CNET has also named Bitdefender its 2013 Editor’s Choice, that confirmed its leadership status among security products. \r\nMore information about Bitdefender's products is available from the company's security press room. Additionally, Bitdefender publishes the HOTforSecurity blog, where readers can find stories from the underworld of internet fraud, scams, malicious software - and gossip. \n \n\n\n\n\n", "title": "UI/UX Developer", "company_url": "http://www.bestjobs.ro/firme/bitdefender/684783/1", "career_level": "Entry, Middle", "company": "Bitdefender", "locations": "\nDelea Veche nr 24, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-ui-ux-developer/750881/1"}