{"body": "\n\n\n\nConosci bene l’italiano e sai usare il computer? Vuoi lavorare in un ambiente giovane e dinamico e avere opportunità di crescita professionale?Vieni a lavorare in Comdata! Comdata è un'azienda di persone e ha costruito il proprio successo sulla loro passione e sulla loro grande professionalità e competenza!Siamo costantemente alla ricerca di persone dinamiche e intraprendenti, che abbiano voglia di misurarsi ogni giorno con nuove sfide e opportunità, per crescere insieme a noi con spirito di squadra e passione nei confronti del cliente.Il candidato ideale deve :• conoscere ad un buon livello la lingua italiana ;• avere conoscenza minima del PC ( Word, Excel );• avere capacita di lavorare individualmente e/o in gruppo per il raggiungimento degli obbiettivi, anche in situazioni di stress;Non è necessario avere esperienza precedente nel settore call center.Offriamo:• contratto di lavoro con stipendio fisso 1.200 lei• bonus legati agli obiettivi• formazione continua• opportunità di sviluppo professionaleComdata Service fa parte del Gruppo Comdata, leader Italiano nell’outsourcing di servizi di Contact Center, Help Desk, Back Office, Credit Management e Gestione Documentale.Il gruppo conta oggi più di 13.000 dipendenti, ha 14 centri operativi in Italia e sta sviluppando in modo significativo la sua presenza internazionale: oggi comprende infatti 13 siti all’estero (di cui 5 in Romania).Per ulteriori informazioni e per fissare un colloquio oggi stesso potete trovarci in Via Stefan cel Mare nr 36-40,Constanta Ci trovi ai numeri 0341.100.388 / 0737.735.949.Aspettiamo CV anche all`indirizzo mail hrservice@comdata.it.  Interviu Online:1.  Dove avete imparato la lingua italiana? \n\n\n", "title": "Constanta - operatori call center limba italiana", "company_url": "http://www.bestjobs.ro/firme/sc-comdata-service-srl/13075060/1", "career_level": "Entry", "company": "SC COMDATA SERVICE SRL", "locations": "\nStrada stefan cel mare, Constanța, Județul Constanța, România\n", "languages": " Italiana", "url": "http://www.bestjobs.ro/locuri-de-munca-constanta-operatori-call-center-limba-italiana/751272/1"}