{"body": "\n\n\n\n\r\nCANDIDAT IDÉAL :\n\r\n•En tant qu’employé de Webhelp Roumanie on attend de vous d’agir en permanence avec responsabilité dans la relation avec nos clients. Il faut être capable d’offrir l’assistance nécessaire à travers plusieurs canaux de communication tout en contribuant d’une manière active à l’amélioration des processus.\n\r\n•On cherche des personnes qui souhaitent maîtriser l’art de la communication avec les clients et leurs collègues pour contribuer à l’amélioration de la qualité de nos services. Ces personnes doivent pouvoir obtenir les résultats quantitatifs et qualitatifs à l’aide des outilles de qualité et de management.\n\r\n•Webhelp Roumanie est à la recherche d’un nombre de professionnels capable d’intégrer nos équipes, de gérer en langue française une large gamme d’activités comme la gestion de client, l’adaptation des outils de communication, la customisation des solutions et le respect de l’architecture et la culture organisationnelle.\n\n\r\nRESPONSABILITÉS / BÉNÉFICES :\n\r\n•Rejoindre nos équipes, ce n’est pas seulement un parcours professionnel, c’est un challenge personnel.\n\r\n•Pour vous y aider WEBHELP Roumanie vous propose des horaires de travail adaptés à vos besoins, une ambiance de travail agréable, des locaux en plein centre-ville et un investissement continu dans votre formation.\n\r\n•Tout est fait pour faire de vous un maître de l’art de la communication, tout vous proposant de réelles évolutions de carrière (100% des promotions sont issues de l’interne), une rémunération attractive avec des nombreuses primes (performance individuelle et mensuelle, parrainage, subventions, etc.), de fortes perspectives pour des contrats à durée indéterminée et même un parcours de formation au sein de l’Université Webhelp.\n\n\r\nDESCRIPTION DE L’ENTREPRISE :\n\r\nN°2 des Outsourceurs en France et N°3 en Europe, le groupe Webhelp est un opérateur international en Gestion de la Relation Clients qui a connu la plus forte croissance de son secteur entre 2002 et 2012.\n\r\nLe groupe réalise près de 725 millions d'euros de chiffre d'affaires auprès de plus de 165 clients globaux. Au quotidien, 30 000 collaborateurs sont au contact des consommateurs dans 81 sites de production répartis dans 21 pays : France, Belgique, Roumanie, Portugal, Italie, Suisse, Autriche, Allemande, Pologne, République Tchèque, Pays Bas, Maroc, Algérie, Royaume-Uni, Afrique du Sud, Madagascar, Inde, Suriname et Turquie.\n\r\nWebhelp est le 1er employeur francophone de Roumanie avec plus de 2000 collaborateurs sur ses six sites de Bucarest, Ploiesti, Iasi et Galati. \n\n\n", "title": "Consultant clientèle à Ploiesti", "company_url": "http://www.bestjobs.ro/firme/webhelp/2942498/2", "career_level": "Entry, Middle", "company": "WEBHELP", "locations": "\nBlvd Bucuresti 39 A, Ploiești, Județul Prahova, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-consultant-clientele-a-ploiesti/230890/2"}