{"body": "\n\n\n\nAlison Hayes Romania S.R.L.,   lider in industria textila, angajeaza “ Analist cumparari” pentru sediul din Urziceni, Sos. Bucuresti- Buzau, Km. 55.2, Jud. IalomitaObiectivul postului: Desfasurarea activitatii de derulare a contractelor de achizitii pentru materii prime si materiale, respectiv etichete si ambalaje, necesare procesului de fabricatie conform activitatii companiei, identificarea si selectarea furnizorilor alocati si monitorizarea relatiilor cu furnizorii acceptati. Atributiuni/ Sarcini si Responsabilitati:•Introducere in sistemul informatic a comenzilor de achizitii si urmarirea confirmarilor si livrarilor acestora in concordanta si pentru respectarea planului de productie si livrari produse finite catre clienti;•Transmite si urmareste comenzile de la furnizori pe categoriile alocate si se asigura ca toate materialele sunt disponibile in locatiile AHR, atunci cand si daca acest lucru este necesar pentru productie;•Planifica nivelurile optime de comanda pentru articolele de baza din stoc si informeaza colaboratorii interni (depozitare/productie/clienti) pentru fiecare categorie in parte;•Verifica intotdeuna inainte plasarii comenzilor de achizitii de materii prime, daca articolele ce urmeaza a fi comandate sunt conforme cu cerintele clientilor;•Creeaza si introduce in sistemul informatic toate informatiile necesare ale acelui articol conform fisei de specificatii ale produsului;•Verifica calitatea si standardele materialelor conform cerintelor clientilor si aprobarilor acestora;•Raspunde de corectitudinea datelor cuprinse in documentele pe care le intocmeste si le semneaza, urmarind ca circuitul acestora este complet si au fost inregistrate corect;•Propune solutii, rezultate in urma auditurilor interne/sedintelor de analiza a activitatii departamentului achizitii;•Participa activ la solutionarea reclamatiilor catre furnizor pentru produsele livrate cu diferente (cantitative sau calitative) sau care prezinta defecte de fabricatie sau nu sunt conforme cu cerintele clientilor;•Verifica realizarea indicatorilor operativi (rotatie, vechime stoc sau lipsa stoc) si implicare in atingerea acestora;Profilul ideal al angajatului: - studii superioare din domeniul de activitate constituie avantaj; - limba straina-engleza- nivel avansat - conditie eliminatorie;- experienta anterioara in industia textila constituie avantaj.Competente fundamentale:- cunostinte de operare calculator; - abilitati analitice;- buna intelegere a procesului de business.Se ofera pachet salarial competitiv;Transportul este  asigurat din Urziceni, Buzau, Ploiesti , Bucuresti. \n\n\n", "title": "Analist cumparari", "company_url": "http://www.bestjobs.ro/firme/alison-hayes-romania/887585/1", "career_level": "Middle", "company": "Alison Hayes Romania", "locations": "\nAleea industriilor Nr. 17, Buzău, Județul Buzău, România;Sos. Buc- Bz km 55,2 Urziceni jud. Ialomita, Urziceni, Județul Ialomița, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-analist-cumparari/749448/1"}