{"body": "\n\n\n\nFor over 100 years, Steelcase has been bringing human insight to business by studying how people work, wherever they work. Those insights can help organizations achieve a higher level of performance, by creating places that unlock the promise of their people. Our goal is to help organizations create spaces that support how they work. Our passion is to help people love how they work.The new Tech Support team that we are building in Cluj GBC will offer support for our technology products (media: scapes, roomwizards, virtual puck, etc) to our end users and dealers. As part of a global team, you will work with people from different locations in EMEA.In order to be successful in this role, we look for someone with excellent customer orientation, technically sound with an IT Network & A/V troubleshooting experience and a positive attitude. Successful candidate will make use of knowledge in web applications, IIS, Exchange, Cloud calendaring administration, Extron, Crestron and codec installations, while helping customers integrate Steelcase products with their IT/AV environment.Mission:• Offer support to end user and dealer for our technology products• Respond to and resolve technical telephone service calls.• Assist with product training on interactive products via phone.• Respond to and resolve e-mail inquiries and service requests• Approve technical product replacements in SAP work flowTo succeed in this role, we need someone with the following profile:Education / Experience• Bachelor’s degree in IT or Technical / Audio Visual field (preferred)• Minimum of 6 months/1 year of technical support or customer service experience• Technical proficiency of commonly used operating systems• Preferred experience with TCP/IP Networking, AV connections and Exchange• Advanced French or German skillsSkills / Abilities:• Strong interpersonal communication skills required. Ability to effectively communicate in a professional manner.• Pleasant and professional phone etiquette.• Strong organizational skills and ability to effectively prioritize work to meet established deadlines.• Ability to work with minimal supervision and ability to handle non-standard events.• Must be a team player, have a positive attitude and be flexible.• Requires independent analysis and judgment skills in using prior experience and knowledge of Steelcase’s Integrated Technology products to successfully resolve standard and non-standard customer support issues.• Ability and willingness to work extended hours, as necessary, to effectively accomplish assigned tasks.• Ability to travel up to 10%, as needed to successfully perform assigned role.Expect a great work experienceSteelcase Inc., the global leader in the office furniture industry, was founded in 1912 by people with a strong commitment to doing the right thing for their customers, employees, business partners, associates and neighbors. Today we’re a global company with fiscal year 2011 revenue of approximately $2.4 billion USD and about 10,000 employees. Our mission is to help create great experiences – wherever work happens. We study the ways people work, then use that knowledge to develop products and services that help people work more effectively and organizations use space more efficiently. Our brand offers a comprehensive portfolio of workplace products, furnishings and services, inspired by nearly 100 years of insight gained serving the world’s leading organizations. And we design for social, economic and environmental sustainability. Operating in a connected world, Steelcase Inc. reinforce its values: we still strive to provide a work environment that enables employee growth, satisfaction and success.Steelcase in ClujOur Global Business Centers in Monterrey (Mexico), Kuala Lumpur (Malaysia) and Cluj provide a wide range of support services for Steelcase Innovation Centers, Manufacturing and Sales Organizations. Supporting Europe and North America, we look for colleagues with English, French, German and Spanish skills. We offer opportunities in: Information Technology, Marketing & Sales Support, Finance, Administrative Support.We are looking for people who are passionate about finding solutions, who do their best work as part of a team, who share our commitment to quality and doing things right. If you are interested in joining our team please send your CV and letter of intent to HR_GBC-CJ@steelcase.com or you can apply directly to this opening. \n\n\n", "title": "Technical Support Specialist with French or German", "company_url": "http://www.bestjobs.ro/firme/steelcase-srl/12898093/1", "career_level": "Middle, Senior", "company": "STEELCASE SRL", "locations": "\nBulvardul 21 Decembrie, Cluj-Napoca, Județul Cluj, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-technical-support-specialist-with-french-or-german/747026/1"}