{"body": "\n\n\n\nAmoma.com offers the best hotel deals worldwide for travelers looking for a reliable and comfortable online experience for their accommodation, always providing maximum guarantees and world-class customer service. As a fast growing company we have multiple software and infrastructure projects running in parallel with teams situated in Romania, France, Switzerland, Barcelona and the UK. We are looking for an Agile Project Manager to help us manage our ever-growing number of IT projects. The person we are looking for must have a strong technical background in IT with proven experience in managing multiple software development projects. S/he will help us manage our projects effectively and meet our project deadlines. Responsibilities:•\tAbility to manage an information technology project plan that communicates tasks, milestone dates, status and resource allocation;•\tCoordinate delivery of development and production releases that meet quality assurance standards;•\tReporting to IT management on project milestones and delivery on a regular basis;•\tHave experience gathering business requirements and documenting business processes;•\tCommunicate effectively with technical associates, development staffs and end users throughout the organisation.Skills / Experience:•\t5+ years of technical Project Management;•\tUnderstand the SDLC (Software Development Life Cycle);•\tAgile Project Management experience (Scrum, Kanban, etc);•\tProven ability to manage multiple work streams and/or projects concurrently, and deliver on-time;•\tJira web-based project management experience is preferred but not essential (as long he/ she is familiar with web-based project management systems).Competencies:•\tStrong analysis and problem resolution skills;•\tStrong planning and organizational skills;•\tExcellent project, task-management skills and partnership focus, able to  collaborate with senior leaders;•\tAbility  to deal with tight deadlines and able to manage multiple high priority requests without sacrificing quality of the deliverable;•\tOutstanding collaborative capabilities, illustrating proficiency in both verbal and written communications;•\tEffectively interacts with all levels of management within the client and internal organization;•\tSelf motivation and function comfortably in an environment that requires ability to deal with multi-tasks, independently and with self-initiative;•\tAbility  to deliver with high sense of urgency and proven willingness to commit the additional time and effort on high impact issues;•\tEnthusiasm, strong work ethic and a positive attitude;•\tAble to fit in and cooperate with a team;•\tFlexible and able to adapt to changes;•\tExcellent verbal and written communication skills in English. What we offer:•\tOpportunity for professional growth due to the multiple new IT projects sustaining development of the on-line hotel booking platform;•\tMotivating compensation;•\tFriendly but also professional environment. \n\n\n", "title": "Agile Project Manager", "company_url": "http://www.bestjobs.ro/firme/amoma/12842251/1", "career_level": "Senior", "company": "AMOMA", "locations": "\nBulevardul Pipera, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-agile-project-manager/749875/1"}