{"body": "\n\n\n\nSmart-x Net Apps maintains and develops a website visited daily by 5-6'000'000 unique users (among top 300 in the world traffic-wise).In our Bucharest office we are growing our team and are seeking talented Software Engineers who thrive in making data driven decisions to move our projects to the next level.With us you can grow your computer science skills, as we do not limit our talent to any specific language; more focus is put instead on technical skills, algorithms, general concepts and the ability to get things done. We also offer great opportunities to:> Work with some of the newest networking technologies and protocols;> Work independently with minimal supervision;> Increase your depth of technical knowledge.\r\nWe’re looking for real team players to join our team.Our new colleagues will have international exposure, so they should be comfortable in English (spoken and written).Problem solving skills and attention to detail are highly appreciated as well.\r\nIn addition, we’re looking for:> 5+ years experience in software development;> University degree in computer science is preferred;> 3+ years of practical experience in developing algorithms and data structures;> Excellent math knowledge applicable to programming skills;> 3+ years of experience of object-oriented programming; > 3+ years of experience developing multithreaded applications;> Programming experience with high traffic / high load environments is a plus;> Knowledge about big data related technologies is appreciated;> Analytical and creative thinking;> Excellent problem solving skills;> Database skills.\r\nYour main responsibilities will involve:> Create algorithms and design software which implements given functionality;> Design and integrate software features for new or existing products, and document new modules/features in large systems;> Develop Internet applications taking in consideration performance and stability criteria;> Contribute to load balancing configurations, distributed servers and replicated databases;> Create server side applications in different languages and/or related technologies;> Define specifications, develop applications and modify existing  applications;> Define objectives by analyzing user requirements;> Ensure adherence to software development methodologies and standards/procedures.\r\nWe compensate your achievements and commitment with:> Very competitive salary;> Private medical plan - Business Plan at MedLife Clinic;> Meal vouchers and well-stocked kitchen in the office;> Performance reviews and compensation based on your results, performance based bonus structure;> Trainings and career development programs – in the country and abroad;> Company events.\r\nOur challenges consist in maintaining high uptime availability, deliver in a fast-paced environment key features for product growth while at the same time keeping an engineering culture based on code-reviews, unit-tests and high hiring standards.We value our staff by investing in their health and good employment practices. We offer a creative workplace and a flat organization, focused on teamwork, product quality, dynamic and fun atmosphere. We have a very nice and comfortable downtown office, with a break area, outside space, fruits and different daily snacks. Flexible working hours are to support work-life balance.\r\nThank you! \n\n\n", "title": "Senior Software Engineer - 3 positions", "company_url": "http://www.bestjobs.ro/firme/smartx-net-apps/13186552/1", "career_level": "Middle, Senior", "company": "SMARTX NET APPS", "locations": "\nStr. Maria Rosetti nr. 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-software-engineer-3-positions/748883/1"}