{"body": "\n\n\n\nVeeam Software helps organizations safeguard their investment in VMware virtual infrastructure by providing innovative systems management software designed to reduce costs, increase productivity and mitigate risk. Veeam is rapidly expanding its presence around the world. The company's U.S. headquarters is in Columbus, Ohio and European headquarters in London, UK and APAC headquarters based in Sydney Australia.\r\nVeeam Software is all about the people. The best people drive the best technologies to help IT organizations all over the world. Do you have a passion for new, cutting-edge technologies? We are always looking for talented, creative and motivated people to join our team. Take a look at the available positions below and apply today.\n\r\nThe Inside Sales Representative is responsible for winning deals for Veeam together with our Channel Partners on the territory of Germany. \n\r\nThis position will be based in Bucharest, Romania.\n\n\r\nResponsibilities: \n\r\n- Receiving and responding to inbound sales leads and converting them to new business.\r\n- Maximizing coverage within the target region and penetrate organizations with Veeam products\r\n- Coordinating sales activities with partners/consultants/distributors and resellers to identify and close new business\r\n- Initiating telephone and email contact with potential prospects from developed web and lead generation lists; cold calling as needed\r\n- Developing a solid working knowledge of Veeam Software products and the benefits they provide to potential customers\r\n- Providing support to qualified prospects and customers including follow up, product information, quotations and closures\r\n- Providing forecasting and account opportunity as needed\r\n- Updating and maintaining the Veeam CRM system \n\r\nQualifications :\n\r\n- 2-4 years of experience in B2B sales\r\n- Fluent in English and German \r\n- Excellent written and verbal communication skills\r\n- Ability to work independently with limited direction in a fast-paced environment; must be a high energy motivated self-starter\r\n- Higher education \n\n\r\nPlease visit our career portal for new and exciting roles at Veeam!\r\nhttp://careers.veeam.com/\r\nhttp://careers.veeam.com/about/core-values \n\n\n", "title": "Inside Sales Representative with German", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Middle", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Germana, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-inside-sales-representative-with-german/209436/5"}