{"body": "\n\n\n\nA software tester must have a deep understanding of computer programming.They must also possess a strong interest in technology and its advancement. In this role, specifically, the tester will not only test new features and functionality, but must also actively use every function and tool of the software solution in order to develop a deep understanding of the product and how it works. Constant use of the application will also allow for proactive identification of bugs, performance and reliability issues, as well as other potential failures. Detailed metrics are recorded and monitored to track the progress and outcomes of the testing process.Communication skills are important as the tester must be able to effectively communicate with other team members and the customer. In order to accomplish this they must be able to communicate using both technical and nontechnical terms depending on the audience they are addressing.Written communication and documentation skills are also essential. As a key member of the product development team in a start-up company, it is essential that the candidate be able to accurately document test procedures and results to allow for continuous process improvement and to institutionalize the knowledge base.As a Software Development Tester you will be responsible for all aspects of software testing. Working within the development team, you will:• Evaluate and test new or modified software development programs according to user requirements and established guidelines.• Participate in feature developments from concept to design and construction to drive quality into software application• Responsible to create effective and automated test cases• Design and develop tools for test management, execution and reporting to enhance the overall software testing process• Write, revise, and verify quality standards and test procedures for program design, product evaluation and quality assurance• Review logs and monitoring/performance metrics to detect error codes or interruption of program and corrects errors.• Identifies differences between established standards and user applications and suggests modifications to conform to standards.• Conduct compatibility tests with vendor-provided programs.• Test implementations/integrations with third party platforms.• Writes documentation to describe program evaluation, testing and correction.Job Requirements:• Three years of software development and/or testing experience is required;• Degree in Computer Science or related field is preferred;• Experience in testing PHP scripting and web-based development;• Experience in testing web-based software, cross-browser and cross-platform;• Experience in reviewing requirements and developing test cases based on those requirements;• Strong communication skills;• Attention to detail and problem-solving attitude;• The ability to work as a team player;Benefits:•    Healthcare for you through private medical subscription•    Attractive salary package according with experience an individual performance •    Fruit days•    Working from home days•    Performance bonuses \n\n\n", "title": "Software Development Tester", "company_url": "http://www.bestjobs.ro/firme/contentspeed-the-ecommerce-agency/13376201/5", "career_level": "Middle, Senior", "company": "ContentSpeed, the eCommerce Agency", "locations": "\nBulevardul Pierre de Coubertin, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-software-development-tester/202487/5"}