{"body": "\n\n\n\nSCOP: Efectuează toate activităţile tehnice de instalare şi întreţinere pentru clienţi, în vederea asigurării infrastructurii tehnice, contribuind astfel la îmbunătăţirea satisfacţiei clienţilor prin reducerea timpului de aşteptare pentru instalarea serviciilor şi a duratei deranjamentelor tehnice.\n\r\nRESPONSABILITĂŢI:\r\n• Instalează şi pune în funcţiune la locaţia clientului toate echipamentele de infrastructură necesare (VPN, Mnet, IPFix, IP Transit, Clear Channel, L2 Connect, DSL, FTTX, ISDN, PABX, circuite închiriate, reţele de interior, etc.) pentru a contribui la furnizarea de servicii clienţilor \r\n• Efectuează toate activităţile de service post-vânzare şi întreţinere preventivă la locaţia clientului,, în vederea asigurării unei funcţionări eficiente a echipamentelor/sistemelor;\r\n• Efectuează întreţinerea corectivă a echipamentelor (VPN, Mnet, IPFix, IP Transit, Clear Channel, L2 Connect, DSL, FTTX, ISDN, PABX, MG, circuite închiriate, reţele de interior, etc.) utilizând dispozitive electronice de testare, măsurare şi monitorizare pentru a identifica problema, a evalua cauza şi a izola şi restabili deranjamentul;\r\n• Asigură legătură permanentă cu clienţii pentru a le rezolva cererile de noi servicii sau remediere a unor deranjamente, a-i informa cu privire la stadiul de soluţionare a acestora şi a le confirmă că la final s-a răspuns în totalitate solicitărilor acestora;\n\n\n\r\nCerinte\r\n• Studii medii tehnice (studiile superioare tehnice, cunoaşterea unei limbi străine, reprezintă un avantaj).\r\n• Certificare tehnică nivel bază ( Suport Tehnic ).\r\n•  Experienţă în domeniul telecomunicaţiilor, preferabil în sfera echipamentelor instalate la sediul clientului (instalare şi întreţinere şi/sau vânzare) - reprezinta un avantaj;\n\r\nCunoştinţe, Aptitudini & Abilităţi:\r\n• Telecomunicaţii — cunoştinţe despre transmisiuni, comutaţie, monitorizare şi operare a echipamentelor de telecomunicaţii;\r\n• Orientare spre client;\r\n• Gândire deductivă – abilitatea de a aplica reguli generale unor probleme concrete pentru a găsi soluţii viabile;\r\n• Identificarea problemelor – abilitatea de a observa când ceva nu funcţionează bine sau este posibil să nu funcţioneze bine;\r\n• Lucru în echipă – cooperează cu colegii în realizarea lucrărilor şi obiectivelor comune;\r\n• Bune abilităţi de comunicare;\r\n• Cunoştinţe de operare pe calculator;\r\n• Integritate – onest, corect;\r\n• Adaptabilitate rapidă la situaţii atipice;\r\n• Disponibilitatea de a-şi îmbunătăţi pregătirea profesională în funcţie de cerinţele locului de muncă prin participarea la cursuri, seminarii, prezentări;\r\n• Carnet de conducere fără incidente; \n\n\n", "title": "Reprezentant Teren Servicii Tehnice Clienti B2B", "company_url": "http://www.bestjobs.ro/firme/telekom-romania-communications-s-a/2564064/1", "career_level": "Entry, Middle", "company": "Telekom Romania Communications S.A.", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reprezentant-teren-servicii-tehnice-clienti-b2b/751412/1"}