{"body": "\n\n\n\nFollow our job advertisements and join the exciting world of automotive industry today; come and meet the challenges and opportunities of a fast paced environment that will excite and develop you as a young professional! Delphi is willing to grow young talents into young professionals! In the same time, we have a deep knowledge to share and we need the expertise of senior professionals! Be smart and we shall use your creativity, be proactive and we shall appreciate your initiatives, be remarkable and we will definitely see you standing out from the crowd.HR Business Partner for Arad Prototype Plant and Engineering CentreMain Duties and Responsibilities:• Identify appropriate recruitment channels to fill in company’s vacancies; advertise the openings based on department manager requirements and job description; • Search and selection activities; scheduling and conducting interviews;• Evaluation of candidates and recruitment process follow up; administrate the candidates’ database• Manage the internal recruitment process• Identify, together with the department manager, the training needs of the organization; draw training plans; organizes and supervises the training processes/ projects• Elaborates training programs and prepares training materials; act as trainer for certain training programs; administrates the training and qualification database• Administrates the induction process for new employees; ensure follow up for the induction period using one to one discussions, activity assessments, 360 degree feedback, etc…• Elaborate and update the job description; collaborate with department manager for validation• Align the job functions with the company’s standards and the Romanian legislation• Draw addendums to working contracts and make sure that the personnel documents flow is completed (file documentation)• Manage administrative HR tasks and certain payroll related activities• Flow management for the travel & expense company program• Business System Responsible for the HR Department (procedures and forms administration);Requirements:•Bachelor's degree•2 years+ experience in HR complex processes•A background in manufacturing multinational companies is a plus•English advanced knowledge is a must•Excellent PC knowledge (MS Office)•Previous experience in working with large teams•Analytical and synthetically thinking, attention to details and problem solving abilities•Solution and people oriented, dynamic and resourcefulIf you think this is the opportunity you have been looking for, please send an application letter stating your career options and an application in English by e-mail to the following e-mail address: ristena.veghes@delphi.com or apply on-line. All information regarding your application will be treated with the utmost confidentiality. Only selected candidates will be contacted for an interview. Delphi Packard Romania www.delphi.com \n\n\n\n\n", "title": "HR Business Partner (Arad)", "company_url": "http://www.bestjobs.ro/firme/delphi-packard-romania-srl/849436/1", "career_level": "Middle, Senior", "company": "Delphi Packard Romania SRL", "locations": "\nArad, Județul Arad, România;Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-hr-business-partner-arad/750051/1"}