{"body": "\n\n\n\nWe are looking for a passionate and talented Tools Developer who would like to manage and enhance Jenkins servers and develope automation scripts.\n\r\nTasks\n\r\n• Administrate Jenkins and develop PluginRun scripts on Bash and Python\r\n• Create automated unit test frameworks (cppunit, junit, selenium, etc.)\r\n• Administrate Linux\n\r\nCompetencies\n\r\n• Basic knowledge of JenkinsGood knowledge of Java language is a plus\r\n• Good knowledge of Python languageGood language of Linux administration is a plus\r\n• Ant and Makefile knowledge is a plus\r\n• Virtualization XEN/KVM knowledge is a plus\r\n• Redmine REST API knowledge is a plus\n\r\nWe are offering\n\r\n• Opportunity to build a career with us\r\n• Exciting Projects to increase your development expertise\r\n• Being part of a great and dynamic team together with other talented Software Professionals\r\n• Saguaro Tech offers top-tier salaries and benefits that currently include merit-based bonuses, employee loan subsidies, a savings plan, education benefits, professional training programs, medical clinic services, dental subsidies, gym and sport activities memberships and more.\r\n• Modern New Facilities. Our roomy, new Timisoara campus provides Saguaro Tech employees with the latest in technology, tools and equipment, modern offices and state-of-the-art labs.\n\r\nIf you are qualified for this position, submit your CV now for immediate consideration. \r\nFor more information you can also contact us at: HR@saguarotech.net or visit our website – and apply online – at www.saguarotech.net .\n\r\nNote that only suitable candidates will be contacted.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\t\t    videojs.autoSetup();\n\t\t    \n\t\t    videojs('videoid-1453910649').ready(function(){\n\t\t\t\n      \n\t\t\t// Store the video object\n\t\t       var myPlayer = this, id = myPlayer.id();\n\t\t       // Make up an aspect ratio\n\t\t       var aspectRatio = 320/640; \n\n\t\t       function resizeVideoJS(){\n\t\t\t var width = document.getElementById(id).parentElement.offsetWidth;\n\t\t\t myPlayer.width(width).height( width * aspectRatio );\n\n\t\t       }\n\n\t\t       // Initialize resizeVideoJS()\n\t\t       resizeVideoJS();\n\t\t       // Then on resize call resizeVideoJS()\n\t\t       window.onresize = resizeVideoJS; \n\t\t    });\n\t\t\n", "title": "Tools/Automation Developer", "company_url": "http://www.bestjobs.ro/firme/saguaro-technology-inc-sucursala-timisoara/36572/1", "career_level": "Middle, Senior", "company": "SAGUARO TECHNOLOGY Inc., Sucursala Timisoara", "locations": "\nStr Venus 33, Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-tools-automation-developer/751091/1"}