{"body": "\n\n\n\n3500$ venit mediu lunar Oferta Noastra:\n\r\n• Salariu garantat primele 3 luni minim 700$;\r\n• Program full time - 8 ore pe zi, 5 zile pe saptamana iti garanteaza procentul de 60%;\r\n• Program part time - minim 6 ore pe zi, minim 4 zile pe saptamana iti garanteaza procentul de 50%;\r\n• Training personalizat non-stop de o echipa de fete bine pregatite;\r\n• Plata bilunara;\r\n• Make-Up profesonal;\r\n• Sedinte foto profesionale;\r\n• Cursuri si seminarii personalizate;\r\n• Confidentialitte100%;\r\n• Bonusuri substantiale, oferite la diferite concursuri speciale de weekend-uri sau sarbatori tematice ce vor imbunatati consderabil incasarile si vor mentine buna dispozitie;\r\n• Oferim sansa de a face imprumuturi pentru nevoie personale, leasing auto, imprumut pentru renovarea casei, imprumut pentru schimbarea de imagine( silicoane, extensii, etc.), imprumut pentru credit cu prima casa si sustinere de a obtine credit pentru prima casa.\r\n• Conditii excelente de lucru, echipamente de ultima generatie, echipa tanara, in permanenta dezvoltare. \n\r\nCerintele Postului:\n\r\n- Varsta de peste 18 ani;\r\n- Limba engleza la nivel conversational;\r\n- Capacitatea de autoperfectionare;\r\n- Aspect fizic placut;\r\n- Seriozitate.\n\n\r\nCine suntem noi?\n\r\n   Lider in domeniul streaming-ului online, AVC Studio este parte a celui mai mare grup de studiouri de acest gen din Romania.\r\n   Experienta de peste 15 ani in domeniu si premiile obtinute la festivalurile de profil din Las Vegas si Praga recomanda echipa formata ca fiind una foarte bine inchegata, profesionista si bine dezvoltata, orientata catre servicii si oameni de calitate.\n\r\nDe ce sa ne alegi pe noi?\n\r\n   Noi, echipa AVC Studio, ne evidentiem prin: profesionalism, punctualitate, motivatie, creativitate, buna dispozitie si perseverenta. Ne-am propus sa demonstram ca munca in videochat poate fi un job normal, ca oricare altul, care poate aduce multe avantaje, atat pe plan financiar si profesional cat si cel personal. De fapt, acest mod de abordare ne-a ajutat sa castigam increderea multor modele si sa schimbam conceptia despre acest job, sa oferim transparenta totala atat fata de ceea ce inseamna societatea in general cu tot ceea ce presupune aceasta, legalitate, fiscalitate, cat si fata de echipa studioului nostru, sa creem pentru modelele noastre un stil de viata decent si cat mai aproape de standardele la care toti aspiram. \r\n   Am reusit sa construim o echipa in care dialogul si necesitatea de a-ti expune punctul de vedere sa fie pe deplin satisfacuta, in care ideile si chiar si nemultumirile sa isi demonstreze caracterul constructive.\r\n   Oferim oportunitati deosebite celor care doresc sa-si imbunatateasca veniturile, sa-si implineasca visurile, ambitiile si sa zambeasca inca din prima zi in care patrund in acest studio de videochat, de unde si sloganul firmei noastre este “We love to see you smile“.\n\r\nPentru mai multe detalii poti sa ne contactezi la:\r\nDiana: 0754 023 290\r\nWhatsApp: 0754 023 290\r\nE-mail: oana@avcmail.ro\r\nsau aplica prin formularul de angajare de pe site-ul nostru www.AvcStudio.Ro  Interviu Online:1.  Ati mai lucrat in acest domeniu ? \n\n\n\n\n", "title": "PR,  Model,  Hostess,  job Bucuresti", "company_url": "http://www.bestjobs.ro/firme/avc-studio/3706760/2", "career_level": "Entry, Middle", "company": "Avc Studio", "locations": "\nPiata Iancului(2 min. metrou), București, Municipiul București, România;Pta Romana, București, Municipiul București, România;Unirii, București, Municipiul București, România;Universitate, București, Municipiul București, România;Victoriei, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-pr-model-hostess-job-bucuresti/230883/2"}