{"body": "\n\n\n\nResponsibilities\n\r\n• Responsible with finding solutions, temporary remedies and/or reparations in order to maintain and improve the functionality of the systems found under his/her administration;\r\n• Promotes new applications/systems in production, applies various technical tests in the systems;\r\n• Assures support for the use of the applications promoted in production;\r\n• Offers assistance to front line support officers in order to prioritize and solve the incidents/problems regarding to his/her area of expertise and also, when a problem does not frame the first line support officers' abilities, he/she takes over that specific problem and tries to find a solution;\r\n• Escalates the incidents/problems to other support lines or to suppliers, if necessary. Registers the solutions, temporary remedies and the steps taken in order to solve the incident/problem in the registered service. Then he/she notifies the user of the front line support when the incident /problem is concluded, offering procedures if necessary;\r\n• Offers technical information for the projects he/she is involved in;\r\n• Covers all the activities below all by himself/herself;\r\n• Furthermore, he/she has coordination and supervision tasks over the other team members and also over the projects initiated by the team that he/she is part of;\r\n• Makes proposals and optimization plans for the team processes;\r\n• Makes up the plan and coordinates the induction of the new team members.\n\n\n\r\nRequirements:\r\n• University degree;\r\n• Knowledge of the insurance business and technical background (IT);\r\n• At least one year similar experience;\r\n• PC knowledge (Microsoft SQL Server,  Microsoft SQL Database Administration) – medium level;\r\n• Conceptual knowledge of programming languages;\r\n• Project management knowledge (medium level);\r\n• Great English skills.\n\n\n\r\nSoft Skills:\r\n• Attention to detail\r\n• Adaptability\r\n• Flexibility\r\n• Integrity\r\n• Stress – resistance\r\n• Analysis capacity\r\n• Results - orientation\n \n\n\n", "title": "System Support Specialist", "company_url": "http://www.bestjobs.ro/firme/nn-asigurari-de-viata/2596055/2", "career_level": "Middle", "company": "NN Asigurari de Viata", "locations": "\nOpera Center 1-5 Costache Negri St. Bucharest 5, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-system-support-specialist/230778/2"}