{"body": "\n\n\n\nEricsson Overview:Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.Description: The role of the Supplier Performance Analyst is to plan, execute and conclude Supplier Relationship Management (SRM) events in cooperation with Ericsson Sourcing Managers and /or Supplier Responsible Managers and their targeted suppliers. These events are supplier performance evaluations (SPE) and requests for information (RFI). Successful candidates will be responsible for:Creating in the online system various SRM specific events (different types of evaluations across different geographies), propose timeline and confirm with the Driver. Liaise with suppliers during the event from inviting them to participate to training them on how to use the online system. Clarify for the suppliers the objectives of the evaluation project. Escalate no response from suppliers/stakeholders on RFIs & SPEs. Providing updates to the Sourcing Managers and /or Supplier Responsible Managers on the progress of the evaluation. Analyzing and summarizing data from the online system at the closure of the evaluation and build a report for the Sourcing Managers and /or Supplier Responsible Managers to make a decision in terms of suppliers’ selection and governance. Upload Supplier Status and Risk Cards /Supplier Performance Cards/Minutes of Meetings to Supplier Information Portal (SIP). Activities/Duties:Secures evaluation phases (plan, create, monitor and analyze of each event) happen as per expected timelines and service levels; Escalates issues and concerns related to evaluations success to Sourcing Managers and /or Supplier Responsible Managers;  Manages suppliers complains to mutual benefit; if needed, escalates to Sourcing Managers and /or Supplier Responsible Managers, SRM Driver, Team Leader etc.; Analyze evaluations outcomes and provide recommendations for supplier selection; Serve as the liaison to the Sourcing Managers and /or Supplier Responsible Managers as well as Suppliers; Collaborate with internal teams to ensure sourcing project objectives are met. Skills:Negotiation and Communication skills (background: vendor management, customer service); Strong written and oral communication skills are essential, as presenting findings and supporting service delivery is an important part of the job; Accuracy and attention to details; Ability to work effectively in teams as well as independently, within tight deadlines; Advanced Excel and medium PowerPoint skills; 2+ years’ experience in customer and/or supplier facing roles;  be able to interact with the 3rd parties (e-mails, phone calls) independently;  be able to handle a request end-to-end (from receiving the request to closure of the evaluation). \n\n\n", "title": "Supplier Performance Analyst", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Entry, Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-supplier-performance-analyst/749561/1"}