{"body": "\n\n\n\nIdeal Candidate: Are you a passionate developer of web sites or mobile applications? Tired of the small web sites and wanting to work on big projects alongside a great team? Are you looking to master the art of code writing? Then you might be a good fit for working at Clarisoft :-) What are we looking for?• Software developers for web sites (mostly PHP or ASP.NET) or for mobile (iOS or Android) that enjoy challenges, ask questions and pay attention to details, learn new things or technologies and apply them creatively to solve the problems at hand.• Do you know other languages but want to learn something new? Are you at the start of your career and highly motivated? You can still apply.• We hire for attitude and train for skills.• And if you are at or finished an IT university you are lucky in-deed: you do not need a mandatory experience, you will be like in kindergarten taking care of you and doing what you want and you are also being paid to do it.Knowledge some of the following is a plus:• jQuery, AJAX• MySQL, MS-SQL• JSON/XML handling, communications with web services (HTTP, SOAP, REST)Your responsibilities:• Include everything related to code: write it, debug it, test it before sent it to QA.• We like you to challenge us, think of better solutions or designs, and tell us how can we improve our environment, participate in multiple projects, share your knowledge with the others, and be an excellent team player.Company details:• A team of 70 people in USA and Romania that like to build great software platforms• We enjoyed tremendous success and growth in recent years. MIT, NASA, and some of the biggest companies in the world used the software we created. We want to keep this going and need your help for it.• Centrally located offices at Victoriei Square, flexible hours, creative environment, soccer & beer nights, team-building on your birthday, budget allowances for things you want to learn, unexpected bonuses … and you might have some ideas too.• We already hired over 20 people in the last 6 months, we are growing each day and being one of us from the beginning gives you the opportunity to learn and even become a team lead.• You can benefit from the tax incentive (no income tax) offered by the Romanian government.• Opportunity to learn emerging technologies.• We value the team concept and foster an environment where people can grow together. If you have other people in mind that fit the profile, just send them the link to apply. We might hire your friends too and give you a nice bonus! Here are some cool things you can read about us http://www.clarisoft.com \n\n\n", "title": "WEB PHP / ASP.NET Developers", "company_url": "http://www.bestjobs.ro/firme/clarisoft-technologies-rom-s-r-l/1890106/1", "career_level": "Entry, Senior", "company": "Clarisoft Technologies Rom S.R.L.", "locations": "\nCalea Victoriei 155, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-web-php-asp-net-developers/747724/1"}