{"body": "\n\n\n\nResponsabilitati: Identifica oportunitatile de pe piata in scopul atragerii de noi clienti in cadrul segmentului vizat (persoane juridice cu cifra de afaceri pana la 5 Mil. Eur); Participa la cresterea vanzarilor de produse si servicii si initiaza vanzari incrucisate ale produselor bancii pentru clientii din cadrul segmentului vizat; Identifica nevoile clientilor si ofera consiliera financiara, propune solutia optima pentru nevoile identificate in urma analizei financiare si calitative a clientului, in conformitate cu specificul activitatii acestuia si cu respectarea normelor si procedurilor interne in vigoare; Negociaza si structureaza ofertele pentru clienti si preia de la acestia cererea de credit impreuna cu documentele necesare pentru analiza completa (financiara si non-financiara), intocmeste referatul si propunerea de credit; Inainteaza dosarul spre aprobare catre factorii competenti, asigurand comunicarea permanenta cu departamentele interne din cadrul Bancii in vederea indeplinirii nevoii clientilor; Participa in proiectele si activitatile departamentului repartizate de superiorul direct. Cerinte: Studii superioare/ Master in domeniul economic si/sau juridic; Experienta anterioara de cel putin 3 ani in domeniul financiar-bancar, in aria vanzarilor IMM si/sau Corporate; Cunostinte bune de analiza financiara; Bun cunoscator al legislatiei bancare; Cunostinte avansate MS Office; Limba engleza -avansat (vorbit, scris, citit); Competente specifice interpersonale, abilitati de vanzare si negociere avansate; Integritatea, Curajul, Excelenta, Responsabilitatea individuala si Grija fata de ceilalti insumeaza valorile noastre si sunt mandatorii; Capabil sa lucreze sub presiune; Foarte bun coechipier.  Interviu Online:1.  Ca si segment de clienti, cu ce cifra de afaceri ati lucrat pana acum?2.  Ati lucrat referate de credit in limba engleza?3.  Care este nivelul de cunostinte de analiza financiara?4.  Care este experienta dvs totala in domeniul vanzarii si creditarii persoanelor juridice?5.  De ce ati fi interesat de o schimbare in momentul de fata?6.  De ce OTP Bank? \n\n\n", "title": "MANAGER RELATII CLIENTI SME", "company_url": "http://www.bestjobs.ro/firme/otp-bank-romania-sa/2209442/1", "career_level": "Middle, Senior", "company": "OTP Bank Romania SA", "locations": "\nBd. Eroilor nr. 3A, Brașov, Județul Brașov, România;Panu, Iași, Județul Iași, România;Piaţa Sfântu Gheorghe, Timișoara, Județul Timiș, România;Piaţa Unirii, Cluj-Napoca, Județul Cluj, România;Stirbei Voda nr.6 bl.M2, Călărași, Județul Călărași, România;Str. 1 Decembrie 1918, Târgu Mureș, Județul Mureș, România;Str. Buzesti nr. 66-68, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-manager-relatii-clienti-sme/749019/1"}