{"body": "\n\n\n\nThe ideal candidate:Are you sociable, easily interact with those around you, are you oriented for performance, and the sales process attracts you?Language Search:EnglishRussianWant to work in a young and dynamic team, in which to make a career? We have exactly what you need! You can win with your own power net monthly income that can reach 5,000 RON.RESPONSIBILITIES:All you have to do is to call potential clients of the company to promote our servicesReceive training and support, call and win!Apply now and we can provide the following benefits:Salary package composed of:motivating fixed salaryfee depending on individual performanceStable job and interactiveReal possibilities of promotionInvolvement in our organizational projectsYoung working environment, pleasant and motivatingTraining for “Sales Agent“ supported by specialized trainersRelaxation: team building, public and individual assessment results etc.Personal and professional development courses.COMPANY:KeyStock is providing the latest global investment management and trading services. As its core objective at Keystock we firmly believe that traders of all experience levels should be able to trade on their platform successfully. Clients enjoy exceptional privileges that include analysis, expertise and technology from the world`s most robust sources, for all international financial instruments. Individual or institutional investors, all seek a reliable partner to inspire them in making investment decisions. Keystock provides multiple advanced trading platforms, outstanding support and customer service in multiple languages making sure that our clients have the ability and constant access to profit from trading on the financial markets. At Keystock, we place the highest importance on security making sure that all client details and funds are secured by the latest and most demanding safety practices in the industry. \n\n\n", "title": "Junior/Senior Account Manager", "company_url": "", "career_level": "Entry", "company": "", "locations": "\nStrada Scărlătescu, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-junior-senior-account-manager/205655/5"}