{"body": "\n\n\n\nQA Software Engineer iRewind is looking for a QA engineer with Java development experience.At iRewind, we are building a platform designed to let millions of people enjoy and share their personal videos. Our product relies on a scalable Java solution spanning multiple layers going from the automated generation of personalized videos to content delivery. We are using a complex stack bringing together many state-of-the art components from distributed databases to computer vision libraries.  Our new teammate should play a leading role in the development of our content delivery platform. We are looking  for someone with existing experience in developing large scale Java applications, who is passionate about continuous improvement. You should be comfortable working in a very dynamic environment, requiring constant learning of new tools and rapid delivery of new features.  RequirementsExperience (min 3 years) with the Java unit testing frameworks (JUnit, TestNG) Proficiency with Selenium testing Working knowledge of front-end technologies  Working knowledge of Linux Experience working with Continuous Integration and Continuous Delivery concepts and tools (in particular Jenkins);  BSc in Computer Science or related Nice to have:Spock testing framework and Geb (these 2 frameworks would be a significant advantage) Experience with NoSQL databases (in particular Cassandra) Experience with Solr/Lucene, HAProxy, Kafka  ResponsibilitiesWrites functional and integration tests Performance and load testing of irewind services (JMeter and/or related) Hands-on software testing Hand testing critical flows Explore new, innovative technologies and find solutions to bottleneck problems Provide estimates and benchmarks for different technical testing solutions About iRewindWe are a Swiss tech start-up founded in December 2013. We began commercial operations in February 2015 in the sports market, with expansion plans to Leisure and Travel segments such as amusement parks, castles, resorts, museums, cruises, etc.Our technology matches camera meta-data with user positioning information to identify and make you the star of your personalized video memory. We disrupt the memories market by eliminating the need to carry a camera.Accolades received:1st place winner Swiss ICT “Newcomer“ (2014) 1st place winner Grand Prix Geneva International Inventions Salon (2014) “Top 17 Disruptors“ at START Global Web Summit (Oct 2014) “Top 8 Recommended“ promising Swiss start-ups ( Bilan, Feb 2015) 1st place winner “Creative Integration of Technology“ (Axis Communication, 2015)  \n\n\n", "title": "QA Software Engineer", "company_url": "http://www.bestjobs.ro/firme/i-rewind-srl/13370165/5", "career_level": "Middle", "company": "I-Rewind SRL", "locations": "\nStrada Eugen Lovinescu nr. 29, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-qa-software-engineer/205678/5"}