{"body": "\n\n\n\nEricsson Overview:Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.Job Summary:The Services Consultant is a development role for business engagements and solution for a given service line; the Consultant is responsible to generate models to implement to meet customer expectations and generate tangible business value.He or she is responsible for driving projects/programs and customer initiatives targeting: process improvement and control, service portfolio expansion, scope development. He or she is accountable to communicate their progress both to the internal and the external community.The Consultant reports to the Head of Analytics & eSourcing and supports GSSO regular operations, non-standard projects and development initiatives.Key Responsibilities:Customer-related ResponsibilitiesUnderstand customer needs, expectations and requirements of services stated and non-stated;Identify process status and determine addressable gaps; Recommend safety nets for risk mitigation; Design solution flows and document proposals.Process-related Responsibilities Identify quality and adherence to process indicators and define controls for the processes; Define templates, work instructions and instruments and ensures they are up-to-date; Plays a driver role in process definition and maintenance: work instructions creation and updates, process documentation management etc.; Drives best practices across the Ericsson Sourcing Community through day-to-day work and  also by contributing to unit communication programs; Drives and executes the GSSO strategy and liaises with other GSSO team to ensure this strategy gets implemented timely; Represents GSSO and respective Team in various forums; Contributes to GSSO growth and development by engaging in cross-functional projects. Performance-related Responsibilities Controls and reposts the customer facing performance parameters and initiates corrective and preventive measures from the identified malfunctions in the process or way of working. Main Interfaces: GSSO Cluster team members and Coordinators; Team Lead/Head; GSSO Teams; GSSO Management.Ericsson Sourcing All Ericsson Sourcing Units members; Non-Sourcing Units.Competence profile: People skills Skilled in coordinating teams and projects; Strong communication and presentation skills; Strong customer orientation and ability to work under pressure; Proficient in facilitating and delivering business solutions. Process skills Strong knowledge in business process management, statistics and business models; Excellent knowledge in Sourcing area and common industry practices.Performance skills Strong analytical and reporting skills, synthetic and documenting skills; Strong level knowledge of MS Office Pack; Proven track record of outstanding performance.Education & Language:Bachelor Degree within Finance / Economics / Mathematics / Computer Science / Computer Engineering or alternate; Fluency in written and spoken English required is essential.Interpersonal skills:Pro-activity towards customer service is essential; Flexible and responsive to changing work patterns and demands; A thorough and methodical approach to work;Well-developed interpersonal communication and people orientation; Willing to share knowledge, experiences and skills to create a learning culture; Excellent ambassador of company culture and values; Good leadership & networking skill; Persuasion and influencing; Coaching and facilitation. \n\n\n", "title": "Sourcing Solutions Senior Consultant", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-sourcing-solutions-senior-consultant/749162/1"}