{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. Honeywell Aerospace is looking for a Direct Buyer to join the Romanian office in Bucharest!Responsibilities:•\tResponds to MRP (material requirements planning) messages to procure material in order to support production requirements. Responsible for maintenance of purchase orders, monthly forecasting for suppliers, maintenance of key planning parameters, and reconciliation of invoice and purchase order issues.•\tObtains the best value for material. Best value is defined as a combination of: price, delivery, quality and service. Considers total cost of acquisition when making procurement decisions. •\tManages supplier performance to ensure that Honeywell Aerospace Olomouc is working with the right strategic suppliers to support short and long term objectives. Takes assertive position with suppliers who are past due to ensure that every alternative is explored in able to improve past due delivery schedules.•\tCreates commodity based sourcing strategies to ensure that Honeywell Aerospace Olomouc is working with the appropriate vendors. Buyers should be able to weigh the sourcing strategies of the commodity team in Phoenix as well as the specific needs of Honeywell Aerospace Olomouc and total cost of acquisition principles. •\tSupports transition team to ensure project plans are updated and requirements on purchase of parts are defined and ordered so that support of the transition and follow-on schedules is secured. •\tProcures material according to ordering policies designed to minimize inventory costs and being left with inactive, obsolete and surplus inventory. Identifies and manages measures to reduce inactive, obsolete and surplus inventory when such do exist. •\tMust be able to work in a team environment and understand all purchase part issues. On a rotational basis will be responsible for reporting on all purchasing issues at the daily production meetings. •\tNeeds excellent organizational and planning skills. Must possess negotiation skills and be able to communicate clearly over the telephone. •\tParticipation in Projects \tEnsures active participation in company’s projects, company’s development, and identification of possible cost lowering measures, improves yield and productivity. •\tHealth, Safety, Environment\tSecures observance of rules pertaining to health protection and safety at work, work safety in the factory and rules of environment protection.\tResponsible for tidiness of work place and for participating in 5S activities. \tResponsible for ensuring tasks and responsibilities in the Health and Safety field duty specified for respective post in Labor Code and internal instructions.•\tInterpersonal Relationships\tResponsible for supporting good interpersonal relations at work, to use his/her interpersonal skills to get sound cooperation among colleagues at all levels.\tResponsible for the provision of information to other employees needed for proper performance of their work, to share information and experience with other colleagues. \tResponsible for ensuring Honeywell company culture standards. •\tMaterial master data maintenance. \tResponsible to maintain material master data for purchased parts. Required skills and experience:•\tExperience in Purchasing, preferably in a production company•\tGood knowledge of MS office package (Word, Excel, PowerPoint)•\tGood knowledge of SAP•\tGood communication skills•\tEnglish is required \n\n\n", "title": "Direct Buyer (job no. 00305765)", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Middle", "company": "Honeywell", "locations": "\nGeorge constantinescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-direct-buyer-job-no-00305765/748333/1"}