{"body": "\n\n\n\nOur company provides Internet development services to a group of customers that run some of the largest, most successful websites in the world. One of our main projects consists in maintaining and developing a website visited daily by 5-6'000'000 unique users (among top 300 in the world traffic-wise).\n\r\nOur key objective is to make Smartx Net Apps the best workplace in Bucharest. Talent and culture are the key drivers of our future success.\r\nWe value our staff by investing in their development, health and good employment practices.\r\nWe offer a creative workplace and a flat organization, focused on teamwork, product quality, dynamic and fun atmosphere. We have a very nice and comfortable downtown office, providing break area, fruits and different daily snacks. Flexible working hours are to support work-life balance.\n\r\nWe compensate your achievements and commitment with:\r\n> Very competitive salary;\r\n> Private medical plan - Business Plan at MedLife Clinic;\r\n> Meal vouchers and well-stocked kitchen in the office;\r\n> Performance reviews and compensation based on your results, performance based bonus structure;\r\n> Trainings and career development programs;\r\n> Company events.\n\r\nIn order to become our colleague, you should be a real team player, flexible and highly responsible.\r\nYou will have international exposure, so you should be comfortable in English (spoken and written).\r\nProblem solving skills and attention to detail are highly appreciated as well.\n\r\nIn addition, we're looking for:\r\n> Experience supporting Linux Systems (6 months – 1 year);\r\n> Familiar with CentOS, RHEL or Debian;\r\n> Previous experience with high availability and failover clustering from different perspectives (OS, application, hardware);\r\n> Experience troubleshooting application servers (at least one from Tomcat, Jboss or Glassfish);\r\n> Familiar with JAVA based environments;\r\n> Knowledge of debugging network problems;\r\n> Familiar with Bash, PERL, PYTHON or PHP;\r\n> Familiar with capacity planning;\r\n> Knowledge of system performance monitoring and tuning;\r\n> MySQL database knowledge would be a plus;\r\n> Familiar with service transition and service operation (preferable).\n\r\nWhat you should do:\r\n> Maintain and monitor environments on a daily basis;\r\n> Define, improve, document standard operational procedures where needed;\r\n> Troubleshoot environments and correct issues;\r\n> Work on documenting areas that need to be addressed;\r\n> Provide support services for production systems when critical issues arise outside business hours;\r\n> Ensure systems are running smoothly;\r\n> Contribute to and maintain system standards;\r\n> Research and recommend technologies and tools for systems administration tasks;\r\n> Consult on new system requirements;\r\n> Install and document new systems;\r\n> Deploy new and updated applications;\r\n> Write automation and monitoring scripts;\r\n> Perform periodic reporting of performance and tuning actions for assigned systems;\r\n> Perform, monitor and test system backups;\r\n> Configure application servers;\r\n> Working closely with programming and testing teams to ensure the smooth launch of new code updates or additions;\r\n> Create, change and delete user accounts per request.\n\r\nPlease submit your CV in English to hr@smart-x.net\r\nThank you! \n\n\n", "title": "LINUX SYSTEM ENGINEER (JUNIOR)", "company_url": "http://www.bestjobs.ro/firme/smartx-net-apps/13186552/1", "career_level": "Entry, Middle", "company": "SMARTX NET APPS", "locations": "\nStr. Maria Rosetti nr. 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-linux-system-engineer-junior/750097/1"}