{"body": "\n\n\n\nPrimul client al grupului msg a fost BMW. 30 de ani mai târziu, departamentul Automotive numără aproximativ 500 de persoane  în peste 25 de locaţii. Proiectele Automotive au dat startul şi echipelor Java în msg systems România. O caracteristică importantă a departamentului este diversitatea. În Cluj, diversitatea se regăseşte în:Cele 13 proiecte Java:sunt destinate celor mai mari producători auto din Germaniaabordează procese de business precum Achiziţii & Logistică, After Sales, Product Lifecycle Management etcsusţin învăţarea şi interacţiunea cu noi tehnologiiconsolidează know-how-ul tehnicCombinaţiile de tehnologii din proiectele Java:Spring combinat cu JavaFXAngular cu servicii RESTExtJS cu Java Enterprise etc.Responsabilităţi:Task-urile specifice proiectului se atribuie fiecărui membru al echipei în funcţie de propriul stil de programare, competenţe şi motivaţie. Astfel există posibilitatea de a realiza:task-uri de development, estimări, code review, build management, documente de specialitate, mentoringdecizii de arhitectură, modelarea aplicaţiilor, concepere de prototipuri, proof of concept, susţinere interviuri tehnice, coordonare (în funcţie de nivelul de experienţă)Projects’ lifestyle:două modalităţi de lucru: în echipe distribuite (RO&DE) sau dezvoltarea proiectelor doar în Româniasusţinere din partea colegilor cu experienţa în domeniul Automotiveacces la know-how specific prin intermediul evenimentelor departamentului (workshopuri, seminarii)delegaţii la sediul clientuluiEşti o persoană care preferă imaginile în locul textului? Accesează albumul echipei: https://www.facebook.com/media/set/?set=a.1083766018302773.1073741963.180999248579459&type=3Pentru informaţii suplimentare şi aplicaţii ne puteţi contacta pe adresa de e-mail: stefania.deac@msg-systems.com  \n\n\n", "title": "Java Developer -automotive enterprise applications", "company_url": "http://www.bestjobs.ro/firme/msg-systems-romania/11260030/5", "career_level": "Middle, Senior", "company": "msg systems Romania", "locations": "\nStr. Brassai Samuel nr. 9 Cluj Napoca, Cluj-Napoca, Județul Cluj, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer-automotive-enterprise-applications/206225/5"}