{"body": "\n\n\n\nSofting is a successful, independent provider of hardware and software for industrial automation and automotive electronics. SoftingRom has been founded early in 2005 as an R&D center of Softing AG Munich, with offices both in Cluj-Napoca and Miercurea Ciuc. We provide mature competences in product and project development for both Industrial Automation and Automotive Electronics business segments. It's not just software but a high level of expertise and quality in total integration with the other partners inside Softing group. •\tControl unit communication and vehicle diagnostics•\tFieldbus communication technologies (wired and wireless)•\tNetworking of automation systems•\tFieldbus configuration and diagnostics•\tMiddleware(data integration) products (OPC related)•\tProduct Support and MaintenanceNow we are looking for .Net and C++ developers for our subsidiary from Miercurea Ciuc. Main responsibilitiesThe area covered by your responsibility is authoring (specification, engineering, test, integration, maintenance) software for real-time, multithreaded, highly deterministic and fail safe object oriented applications used throughout the lifecycle of the car production.Necessary skillsYou can help us with yours•\tProven experience in OOP•\tPrevious experience in C++ or .NET, WPF, WCF•\tTechnical background and experience in software design and development (architecting, design patterns, best practices)•\tKnowledge in building modern, productive and ergonomic UI for desktop applications•\tPassion for software applied in engineering•\tEnglish language (both reading and writing)•\tFurthermore we expect motivation, creativity and team working capabilitiesas well as systematic and responsible working methodsWhat you could benefit of•\tAttractive salary, medical services, fidelity bonus•\tHighly qualified team•\tComprehensive technical trainings on our expertise area•\tPositive and informal working environment•\tChallenging projects for well-known customers in the industry•\tThe opportunity to actively contribute at the design and success of our solutionsFor more details, feel free to contact us at jobs_ro@softing.com. \n\n\n", "title": "Automotive Software Developers", "company_url": "http://www.bestjobs.ro/firme/softingrom/1119941/1", "career_level": "Entry, Middle", "company": "SOFTINGROM", "locations": "\nHarghita 41, Miercurea Ciuc, Județul Harghita, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-automotive-software-developers/750064/1"}