{"body": "\n\n\n\nThe Customer Behavior team is recruiting for a Senior Software Development Manager to lead our Analytics group. As a Senior Software Development Manager, you will be responsible for leading a team of engineers in design, development, test, and deployment of these services. A successful candidate will have an established background in developing customer-facing experiences, a strong technical ability, excellent project management skills, great communication skills, and a motivation to achieve results in a fast paced environment.\r\nKey Responsibilities:\r\n• Responsible for the overall systems development life cycle\r\n• Develop the long-term strategy for your programs and translate that into an achievable road map/action plan\r\n• Management and execution against project plans and delivery commitments\r\n• Manage the day-to-day activities of the engineering team within an Agile/Scrum environment\r\n• Management of departmental resources, staffing, mentoring, and enhancing and maintaining a best-of-class engineering team\r\n• Work closely with the engineers to architect and develop the best technical design and approach\r\n• Report on status of development, quality, operations, and system performance to management\r\nProfessional traits that are not unique to this position, but necessary for Amazon leaders:\r\n• Exhibits excellent judgment\r\n• Hires and develops great people\r\n• Has relentlessly high standards (is never satisfied with the status quo)\r\n• Is able to dive deep and is never out of touch with the details of the business or the technology\r\n• Expects and requires innovation of her/his team\r\n• Has passion and convictions and the innate ability to inspire passion in others\r\n• Strong results orientation\r\n• Thinks big\r\n• Bachelor’s degree in Computer Science, Computer Engineering or related technical discipline\r\n• 5+ years of experience as a software developer\r\n• 5+ years of experience managing people\n\r\n• Deep hands-on technical expertise\r\n• Excellent verbal and written communication skills\r\n• Strong business and technical vision\r\n• Ability to handle multiple competing priorities in a fast-paced environment\r\n• A deep understanding of software development in a team, and a track record of shipping software on time\r\n• Exceptional customer relationship skills including the ability to discover the true requirements underlying feature requests, recommend alternative technical and business approaches, and lead engineering efforts to meet aggressive timelines with optimal solutions\n \n\n\n", "title": "Senior Software Development Manager", "company_url": "http://www.bestjobs.ro/firme/amazon-development-center-romania-srl/1339336/1", "career_level": "Middle, Senior", "company": "Amazon Development Center (Romania) SRL", "locations": "\nStr. Palat 3E, Iași, Județul Iași, România;Iași, Județul Iași, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-software-development-manager/752278/1"}