{"body": "\n\n\n\nFirma de Automatizari si Proiectare Industriala selecteaza in vederea angajarii inginer automatist\r\nDescriere post\r\n- Proiectare si executie sisteme de automatizare industriale bazate pe actionari electro-pneumatice, roboti, alte echipamente.\r\n- Asigurarea mentenantei pentru utilajele dotate cu PLC deja existente \r\n- Prevenirea/ Solutionarea problemelor tehnice aparute pe parte de PLC\r\n- Participarea la montajul utilajelor noi\r\n- programare roboti industriali - constituie un avantaj.\n\r\n-cunostinte solide automatizari industriale si programare PLC; -proiectare si executie sisteme de automatizare industriale bazate pe actionari electro-pneumatice, roboti, alte echipamente.\r\n- Asigurarea mentenantei pentru utilajele dotate cu PLC deja existente \r\n- Prevenirea/ Solutionarea problemelor tehnice aparute pe parte de PLC\r\n- Participarea la montajul utilajelor noi\r\n- programare roboti industriali - constituie un avantaj.\n\r\nCerinte\n\r\n- Absolventi studii superioare tehnice (preferabil absolventi ai facultatii de Automatica - specializarea roboti industriali sau absolvent de Inginerie electrica specializarea actionari sau sisteme electrice)\r\n- Cunostinte solide automatizari industriale si programare PLC        ( Allen Bradley/ Omron/ Siemens)\r\n- Limba engleza (scris, vorbit nivel avansat)\r\n- Persoana cu bune abilitati de comunicare si relationare \r\n- Persoana dinamica, atenta la detalii, cu gandire analitica\r\n- Cunostinte de limba Engleza nivel avansat\r\n- Experienta in domeniu actionarilor pneumatice si electrice, roboti (constituie un avantaj)\r\n- Capacitate de comunicare si lucru in echipa\r\n- Permis de conducere, categoria B.\n\r\nOferta (bonusuri, beneficii)\n\r\n- Pachet salarial motivant\r\n- Bonus pe proiecte\r\n- Training in domeniul programarii robotilor industriali, marca ABB. \n\n\n", "title": "Inginer automatist", "company_url": "http://www.bestjobs.ro/firme/mach-foreign-trade-distribution-srl/30168/1", "career_level": "Middle, Executive", "company": "MACH FOREIGN TRADE DISTRIBUTION SRL", "locations": "\nStr. Ion Voda Viteazul nr. 28, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-inginer-automatist/751874/1"}