{"body": "\n\n\n\nDescrierea Postului\r\nSuntem în căutarea unei persoane entuziaste pentru o poziție nouă la Books Express. Dacă ești pasionat(ă) de interacțiunea cu ceilalți și mai ales ești dornic să înveți, ai putea să devii un membru important în echipa noastră. Nu ne-am dori nimic mai mult decât să ne devii indispensabil. Responsabilitățile postului sunt următoarele:\r\n - efectuarea comenzilor la furnizorii de carte din România și întreținerea relațiilor cu editurile;\r\n - efectuarea comenzilor de consumabile necesare bunei funcționări a biroului;\r\n - menținerea relației cu firmele de curierat și logistică pentru expediții și recepții;\r\n - pregătirea dosarului de contabilitate (facturi, intrări, bancă, plăți etc);\r\n - menținerea relației cu firma de HR și siguranța muncii;\r\n - activități secretariale.\n\r\nCandidatul ideal\r\nCandidatul ideal este absolvent de studii superioare profil economic, experiența anterioară de lucru reprezintă un avantaj, dar nu este necesară, vorbește bine limba engleză, alte limbi (în special germană, franceză sau spaniolă) reprezintă un avantaj, este o persoană sociabilă, dornică să învețe și să se dezvolte. Exprimarea și scrierea corectă în limba română este un criteriu eliminatoriu.\n\r\nBeneficii\r\nVei lucra într-un mediu plăcut și relaxat, alături de oameni pasionați de ceea ce fac, care caută să îmbunătățească în permanență rezultatele muncii lor și pentru care jumătățile de măsură nu sunt o opțiune. Colegii și colegele sunt sociabili și prietenoși, biroul este confortabil și primitor, într-o zonă centrală. Salariul este motivant și evoluează în funcție de rezultate. \n\n\n", "title": "Executive Assistant", "company_url": "http://www.bestjobs.ro/firme/books-express-ist-ultra-srl/740297/1", "career_level": "Entry", "company": "Books Express (IST Ultra SRL)", "locations": "\nGradistea florestilor nr. 17, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-executive-assistant/750886/1"}