{"body": "\n\n\n\nWe’re EA—the world’s largest video game publisher. You’re probably familiar with many of our titles—Madden, FIFA, The Sims, Need for Speed, Dead Space, Battlefield and Star Wars, to name a few. But maybe you don’t know how we’re committed to creating games for every platform—from social to mobile to console—to give our consumers that anytime, anywhere access they demand. What does that mean for you? It means more opportunities to unleash your creative genius, be inspired by those around you and ignite your path in any direction you choose.\n\r\nChallenge the unexpected:\r\nThe role requires the candidate to work in a larger ad planning and deployment team dedicated to the creation, optimization, and reporting of digital advertising and cross promotion campaigns. \n\r\nThe internship will comprise of two areas.\r\n1. Training and execution of in-game advertising, push notifications, and cross-promotion. As part of the program, a senior member of the team will coach you in a variety of areas ranging from designing and building campaigns to QA, and the interpretation of data to assess campaign performance.\r\n2. An individual research assignment that you will prepare over the course of the internship. At the end of the internship, you will present your findings to the Player Engagement team.\n\r\nWhat we seek: \r\n• Student pursuing a diploma in Marketing/Communications except final years\r\n• Curiosity, enthusiasm, and initiative\r\n• Fast learner and driven to action \r\n• Proactive in contributing with ideas and improvements\r\n• Passion for technology and marketing\r\n• Detail oriented\r\n• Analytical thinking \r\n• Team player\r\n• Strong command of English language\r\n• Proficient Microsoft Word, Outlook, Excel and PowerPoint skills\n\r\nNice to have: \r\n• A broad understanding of the mobile landscape is a plus\r\n• Gaming aficionado \n\r\nWhat you’ll be responsible for:\r\n• In-game life cycle marketing in a number of our mobile titles.\r\n• Developing key insights into consumer experiences across various game titles\r\n• Campaign execution and optimization \r\n• Reporting weekly campaign performance metrics\r\n• Managing a marketing calendar to reflect key promotional activities across games\r\n• A competitive analysis report to be presented to the Player Engagement team at the end of the internship.\n\r\nWe thought you might also want to know more about:\r\n• Work schedule: Monday to Friday 2:00 p.m to 10:30 p.m \r\n• More about our Location: Office building AFI Park 2, Vasile Milea 4F, Bucharest\r\n• Contact us on EA’s career site: www.careers.ea.com & Facebook Page.\n  Interviu Online:1.  What is your current year of study?2.  Why did you apply for the Marketing Internship @ EA? \n\n\n\n\n", "title": "Marketing Intern - Students Wanted!", "company_url": "http://www.bestjobs.ro/firme/electronic-arts-romania/1243351/1", "career_level": "Entry", "company": "Electronic Arts Romania", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-marketing-intern-students-wanted/751321/1"}