{"body": "\n\n\n\nDIVA HAIR COSMETICS recruteaza Reprezentant de vanzari atat pentru Bucuresti, cat si pentru Iasi!\n\r\nActivitatea presupune promovarea si vanzarea produselor profesionale pentru ingrijirea parului, tenului si corpului in saloanele de infrumusetare.\n\n\r\nCANDIDATUL IDEAL:\n\r\n- are permis de conducere categoria B;\r\n- este o persoana carismatica, cu putere de convingere, greu de descurajat;\r\n- reuseste sa se plieze si sa se faca placut oricarui tip de persoana cu care intra in contact;\r\n- este o persoana ambitioasa, orientata spre rezultat si cauta sa se perfectioneze din punct de vedere profesional;\r\n- este in cautarea unui job dinamic, care presupune deplasari frecvente la clienti.\n\r\n* Experienta in vanzari reprezinta un avantaj, in special experienta in vanzari B2B, insa nu este obligatorie!\n\n\r\nRESPONSABILITATI:\n\r\n- prospectarea continua a pietei in zonele alocate;\r\n- mentinerea si dezvoltarea relatiilor de afaceri cu clientii existenti (exista deja un portofoliu de clienti);\r\n- identificarea noilor clienti si incheierea contractelor cu acestia;\r\n- realizarea de oferte bazate pe necesitatile si cerintele clientilor si participarea la negocieri;\r\n- prezentarea de rapoarte de vanzari catre superiorul direct in termenul de timp alocat;\r\n- atingerea planului lunar de vanzari.\n\r\nBENEFICII:\n\r\n- pachet salarial atractiv format din parte fixa si bonusuri in functie de vanzarile efectuate;\r\n- masina, telefon si laptop;\r\n- abonament privat de sanatate;\r\n- reduceri pentru angajati la achizitionarea produselor din gama DIVA HAIR COSMETICS;\r\n- desfasurarea activitatii in cadrul unei echipe tinere si orientate catre performanta profesionala;\r\n- training de vanzari.\n\r\nDESCRIEREA COMPANIEI:\n\r\nUnic importator de cosmetice profesionale, DIVA HAIR COSMETICS va pune la dispozitie un portofoliu bogat de produse pentru ingrijirea parului (brandul Oyster Professional, Italia si brandul Hair Shine, Brazilia) si solutii inovative pentru un ten sanatos (brandul Anubis, Spania).\n\r\nInfiintata in vara anului 2011, DIVA HAIR COSMETICS a reusit sa devina cunoscuta pe piata beauty din Romania prin serviciile de inalta calitate oferite clientilor sai.\n\r\nPortofoliul nostru cuprinde o gama variata de produse ce inglobeaza tehnologii de ultima generatie, care raspund tuturor necesitatilor, atat ale hair stylistilor si cosmeticienelor, cat si ale clientului final!\n\r\nMai multe informatii puteti gasi pe site-ul nostru: www.divahaircosmetics.ro! \n\n\n", "title": "Reprezentant Vanzari pentru Bucuresti si Iasi", "company_url": "http://www.bestjobs.ro/firme/diva-interactive/4869537/5", "career_level": "Entry, Middle", "company": "Diva Interactive", "locations": "\nBucurești, Municipiul București, România;Iași, Județul Iași, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reprezentant-vanzari-pentru-bucuresti-si-iasi/211903/5"}