{"body": "\n\n\n\nCandidatul ideal\n\r\nCerinte obligatorii:\r\nPermis de conducere categoria C + E, card tahograf și teste medicale și psihologice curente\r\nComunicare cunoștințele de limba engleză pentru a permite o conversație cu o persoană vorbitor de limba engleză. \r\nExperiența minim 1 an în transportul internațional, susținute de recomandari sau certificate de angajare. \r\nAbilitatea de a lucra sub presiunea timpului, diligență și responsabilitate.\n\r\nDescrierea jobului\n\r\nLocurile de munca sunt disponibile pe tot teritoriul Angliei, iar detaliile cu privire la locația curentă vi se va transmite în timpul procesului de recrutare, care, pentru comoditatea dumnevoastra, se poate face si la distanță (on-line).\r\nNe asiguram tot timpul ca soferii nostrii:\r\nSa lucreze pentru companii cu branduri de renume,\r\nPrimeasca asistență în completarea formalităților necesare pentru a lucra în Anglia,\r\nFormare profesională pentru muncă și cazare gratuită pe durata executării acestuia,\r\nSalariu atractiv, în intervalul £ 9 - £ 16 pe ora in functie de forma de angajare, precum și schimburile plătite la timp.\r\nBeneficii oferite pentru angajați:\r\nIntoarcerea zilnica la reședința după finalizarea programului de munca, \r\nOferta de muncă temporară. Posibilitatea de locuri de muncă permanente direct la client, după finalizarea cu succes a formării.\r\nCerințele noastre pentru candidati sunt simple și transparente.\n\r\nCandidații interesați vă rugăm să trimiteți CV-ul pe adresa de email romania@transline.co.uk sau sa aplicati la acest anunt.\r\nPuteți vizita, de asemenea, biroul nostru de la Brasov, situat in strada Mihail Kogalniceanu, nr 17, etaj 9, Cladirea C4, cod postal 500090.\r\nNe rezervam dreptul de a contacta candidații selectați.\r\nNumar de telefon de contact: +40 316 301 619\n\r\nDescrierea companiei\n\r\nTransline Group o agentie de recrutare britanica specializata in furnizarea de forta de munca, fondată în 1989, în Marea Britanie. Avem birouri în Canada, Thailanda, Polonia, Romania și în special în Anglia, unde suntem prezenti in mai mult de 80 de locații, oferind locuri de muncă pentru peste 15 mii de angajați! Clientii nostri sunt unele dintre cele mai prestigioase companii in sectorul de logistica si distributie, IT, vânzări și lanțuri mari de supermarketuri in Marea Britanie.\n\n\n \n\n\n", "title": "SOFER TIR - ANGLIA - FARA COMISION", "company_url": "http://www.bestjobs.ro/firme/transline-recruitment-group-s-r-l/14246539/5", "career_level": "Middle", "company": "TRANSLINE RECRUITMENT GROUP S.R.L.", "locations": "\nBrașov, Județul Brașov, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-sofer-tir-anglia-fara-comision/211135/5"}