{"body": "\n\n\n\nFollow our job advertisements and join the exciting world of automotive industry today; come and meet the challenges and opportunities of a fast paced environment that will excite and develop you as a young professional!\r\n Delphi is willing to grow young talents into young professionals!\r\n In the same time, we have a deep knowledge to share and we need the expertise of senior professionals!\r\n Be smart and we shall use your creativity, be proactive and we shall appreciate your initiatives, be remarkable and we will definitely see you standing out from the crowd.\n\n\r\nSUPPLIER QUALITY ENGINEER (SQE)  for Sannicolau Mare Plant\n\n\r\nRequirements:\n\r\n• Bachelor's degree, technical profile is a must;\r\n• 1/2 years of experience; a background in automotive industry is a plus;\r\n• Previous experience in working in large teams is an advantage;\r\n• English advanced knowledge is a must.\r\n• PC knowledge (MS Office);\r\n• Analytical thinking, attention to details and problem solving abilities; \r\n• Willing to travel to Sannicolau Mare (daily commute).\n\r\n Main Duties and Responsibilities:\n\r\n- Supports Delphi plant/ quality/ purchasing management regarding to supplier quality issues with standardized action;\r\n - Planning, execution and rating of system and process audits at suppliers on request;\r\n - Initialize and execute project reviews with suppliers, in case in coordination with other purchasing and engineering functions. Monitor supplier performance; develop and publish data reports;\r\n - Central contact for APQP activities of dedicated suppliers;\r\n - Support project teams at customer audits / reviews. Contribute in internal project reviews\r\n- Support the SQE team in case of quality complaints during serial phase (perform Process Audits, judge 8D reports and 5 Why analysis, mentor improvement workshops…);\r\n- Manage supplier performance deficiencies with e.g. Controlled shipping and NBH;\r\n- Support and push under performing suppliers in their improvement activities;\r\n- Support Cost Recovery activities between Supplier and Delphi;\r\n- Lead Regional SPDP Planning & Analysis and Administration Activities;\r\n- Perform audits at suppliers concerning manufacturing & Problem solving capabilities;\r\n- Coordinate with/ support Supplier Management in: Scorecard and Performance activities / QFS, NBH, Major disruption activities / Customer requirements related to suppliers.\n\n\r\n  If you think this is the opportunity you have been looking for, please send an application letter stating your career options and an application in English by e-mail to the following e-mail address: andrada.sitaru@delphi.com or apply on-line.\r\n All information regarding your application will be treated with the utmost confidentiality. Only selected candidates will be contacted for an interview.\r\n Delphi Packard Romania, 305600, Sannicolau Mare, Str.Garii, nr.11 \r\n tel: +40 (256)-309 300/ 0799513131\r\n www.delphi.com \n\n\n\n\n", "title": "SUPPLIER QUALITY ENGINEER (SQE)", "company_url": "http://www.bestjobs.ro/firme/delphi-packard-romania-srl/849436/1", "career_level": "Entry, Middle", "company": "Delphi Packard Romania SRL", "locations": "\nPiata unirii, Timișoara, Județul Timiș, România;Stadionului, Sânnicolau Mare, Județul Timiș, România;Str. Campurilor nr. 2B, Arad, Județul Arad, România;Timisorii, Sânnicolau Mare, Județul Timiș, România;Zona industriala, Arad, Județul Arad, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-supplier-quality-engineer-sqe/750446/1"}