{"body": "\n\n\n\nCONSIGNOR Description \n\r\nAt Consignor, we aim to support large as well as small companies in their Delivery Management making it easier, less time consuming and cheaper for them to deliver parcels to their customers. By developing and providing smart Delivery Management software, which includes all stages of shipment and delivery on just one platform, our customers get an integrated and sustainable delivery solution. \n\r\nAs the leading provider of Delivery Management solutions in the Nordic, Consignor combine in-depth knowledge of transportation and logistics with outstanding software architecture and design. We provide our customers with the world's largest carrier library containing both national and international carriers.\n\r\nOur multi carrier platform creates more than 100 million shipments per year and makes it possible for more than 10,000 customers to choose the best solution for producing shipments, regardless of the carriers, ERP-system or E-commerce solution. We serve small web shop start-ups as well as group storage facilities handling more than 6,000 packages per hour. \n\r\nConsignor operates in Norway, Sweden, Denmark, Finland, China and Romania. Employing more than 110 staff and revenues of NOK 100 million in 2014, we have grown to be the largest provider of Delivery Management systems in the Nordic region.\n\n\r\nWe are looking for a passionate Linux and Windows System Administrator to join our growing company.\n\r\nDuties and responsibilities\r\n•\tServer and storage management, configuration, troubleshooting and performance tuning\r\n•\tInstalling/upgrading/patching and maintaining servers based on Red Hat/CentOS (Apache, Tomcat, MariaDB, etc.) and Microsoft Windows (AD/DS, DHCP, IIS, SCCM, SQL, etc.)\r\n•\tMonitor and manage system resources in order to maintain operational efficiency\r\n•\tPerform system security checks and adjustments as necessary\r\n•\tCapacity planning and performance management\r\n•\tImplement and administer security features\r\n•\tAutomation and batch scripting\r\n•\tDevelop and maintain backup and restore procedures\n\r\nIdeal candidate:\r\n•\tExtensive knowledge in installing, configuring and supporting RedHat/Centos/Windows servers \r\n•\tExperience with public cloud providers (AWS/Azure/Google Cloud Platform) is preferred\r\n•\tGood understanding of distributed file systems - Linux (Gluster FS)\r\n•\tBasic knowledge of LANs/WANs (firewall, load balancers, network devices)\r\n•\tStrong problem solving skills\r\n•\tCustomer oriented\r\n•\tAdvanced English skills\n \n\n\n", "title": "System Administrator", "company_url": "http://www.bestjobs.ro/firme/consignor/12726647/1", "career_level": "Middle, Senior", "company": "CONSIGNOR", "locations": "\nCalea Victoriei 145, București, Municipiul București, România;Calea Victoriei nr.145 etaj 5 Cladirea Victoria Center, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-system-administrator/750750/1"}