{"body": "\n\n\n\nWho we are\n\r\nAbout TotalStay Group\n\r\nThe TotalStay Group (part of JacTravel) launched in the UK in 1999 and has steadily grown into one of the largest and most successful accommodation providers today, used by thousands of tour operators, travel agencies and technology platforms across the globe. Head office is in London with regional offices in Romania and Sweden and a team of consultants based throughout Europe, The Americas, Africa and the Middle-East. \n\r\nThe company has a staff of over 240 and an annual turnover in 2014 in excess of £160m. Exclusively Hotels is the company’s established trade brand providing thousands of travel agents worldwide with an easy to use, password protected hotel booking website as well as a simple XML connection for hundreds of online travel agents, technology platforms and tour operators. Hotel Pronto is the affiliate solution and direct to customer website offering a simple booking tool available in 14 currencies and across 14 languages. The TotalStay Group product range comprises an inventory of 100,000 hotels in over 10,000 destinations worldwide. \n\r\nIn recent times the company has been recognized for its financial performance by both the Sunday Times (2013 and 2015 “Profit Track 100” listing) and the London Stock Exchange (2013 “Top 1,000 companies to Inspire Britain”) as well as winning the Melia Hotels “Most Supportive Partner” award in 2014.\n\r\nThe position: Nightshift Spanish Call Centre Advisor in Cluj Napoca \n\r\nThe duties of a Call Centre Advisor include:\n\r\n• Receive non-group enquiries and booking requests on a daily basis from the agents, affiliates and sales offices via in-house computer system, telephone, email or fax\r\n• Prioritize the work load according to deadlines, arrival dates specified service standard requirements\r\n• Acknowledge all enquires and requests however received within specified service standard requirements\r\n• Update the IT system with bookings and other information \r\n• Research appropriate suppliers including the utilization of non-contracted suppliers (hotels) wherever appropriate\r\n• Contact suppliers according to the sales requirements either by e-mail, fax or telephone to make a reservation \r\n• Negotiate the best possible rates and conditions\r\n• Provide suitable alternatives when required \r\n• Keep agents and affiliate customers updated on a daily basis as to the activities being undertaken in relation to the specific enquiry or booking\r\n• Provide the customer with detailed information including prices that meet their requirement \r\n• Ensure that all enquiries and requests however received are managed to a successful conclusion within specified service standard requirements\n\n\r\nWho you are\n\r\n• Travel industry and/or Call Centre experience (desirable)\r\n• Experience working in a customer facing role (required)\r\n• Fluency in spoken and written English and Spanish (required)\r\n• A graduate\r\n• Strong communication, interpersonal and client relationship management skills\r\n• Good negotiating and influencing skills\r\n• Accuracy, research skills and attention to detail \r\n• Ability to anticipate and solve problems\r\n• Team working skills\r\n• Stamina and persistence\r\n• A “can do” approach\r\n• Ability to work under pressure and to tight deadlines\r\n• Willingness and ability to take ownership for decisions\r\n• Initiative to achieve the best result\r\n• Computer literate \n\n\r\nWhat we offer \n\r\nIn return we offer:\n\r\n• Opportunity to build a long term career within a stable multinational company\r\n• Great team spirit\r\n• Training and coaching \r\n• Development and career progression \r\n• Professional, vibrant and growing team \r\n• Competitive base salary, plus nightshift bonus and language bonus \r\n• Meal tickets\r\n• Active social committee \n\r\nThe next step is yours!\n\r\nPlease send your CV in English setting out why you think you have the qualities we are looking for.  Interviu Online:1.  What interests you about working in the travel industry?2.  Are you fluent in English?3.  What is your level of Spanish? \n\n\n", "title": "Spanish Call Centre", "company_url": "http://www.bestjobs.ro/firme/flame-srl/1604681/1", "career_level": "Entry", "company": "Flame SRL", "locations": "\nStrada Voltaire nr. 11, Cluj-Napoca, Județul Cluj, România\n", "languages": " Spaniola", "url": "http://www.bestjobs.ro/locuri-de-munca-spanish-call-centre/751038/1"}