{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a long term basis, offering at the same time a wide variety of features such as expertise, challenging development opportunities in an international environment and the joy of a strong spirit.\n\r\nMission\n\r\nWithin the team QA, the scope of the job concerns the application MULTIPASS which is the interface between electronic Markets place (EMPs) and the SG information system for the market FOREX.\n\r\nResponsibilities:\n\r\nYou will be involved in :\n\r\n1) Testing activity - (80 % of the activity) \r\n•\tCoordination of the services delivered by the team including schedules, reporting (roadmap, indicator, alert);\r\n•\tDesign and implementation of manual tests cases in Quality center, tests plans driven by the strategy of tests (representing the requests as well as functional tests and regression testing (manual / automatic) before deployments);\r\n•\tRun manuals tests cases (regression, functional evolutions and End to end testing)\r\n•\tReport and follow the defects / request on JIRA;\r\n•\tMaintenance and improvement of the referential of tests in Quality Center according to the deliveries and the functional evolutions;\r\n•\tImplementation of the tests of new features (manuals) and regression testing before deployments;\r\n•\tsupervision of the tests between applications (follow up end to end testing).\n\r\n2) Automation Activity - (20 % of the activity)\r\nCurrently, automated tests are realized by a team based in Bangalore (India). The QA engineer could :\r\nLead a part of automation “off sourced” with India team\r\n•\tFollow and manage request of automation (scripted in India);\r\n•\tProposal of automation extension (manuals tests cases to automate);\r\n•\tReport automation advancement;\r\nScript and execute a part of automated tests cases;\r\n•\tExecution: run and supervise automated tests cases processing; \r\n•\tFix : Script modification to assure the compatibility of changes of functional versions;\r\n•\tExtension: Script extension of the functional regression automaton to take into account new functional features, proposal of improvement, feasibility study (Analyze profitability, advice…).\n\r\n3) Team Leader Activity\r\n•\tOpportunity to lead the future team in Bucharest.\n\r\nTechnical profile:\n\r\nA candidate used with the following environment:\n\r\n•\tTechnical context: Java, tibco, FIX, Oracle, Unix\r\n•\tTools:  Quality center, UFT / QTP, JIRA\r\n• \tFunctional Environments: Financial - FOREX \n\r\n•\tNice to have : Financial / FOREX knowledge, Tibco, FIX, ISTQB certification, French.\n\r\nWe will also value :\n\r\n•\tAdaptability \r\n•\tSuppleness, Sense of the risk \r\n•\tOrientation quality, rigor, cooperation and team spirit are key elements of QA engineer function. \r\n•\tA responsible attitude and ambition in achieving your mission;\r\n•\tA good combination of rigor, creativity and communication skills;\r\n•\tGood command of English, both written and spoken with the ability to participate in English-only meetings. — French knowledge is an advantage;\r\n•\tGeographical Mobility : 4 weeks for onboarding in Paris QA team.\n\n\r\nBenefits:\n\r\n    • Competitive remuneration and benefits package, based on qualifications and experience;\r\n    • Possibilities of promotion and development of a career plan;\r\n    • A modern working environment: open, informal, fun and start-up atmosphere;\r\n    • Meal tickets;\r\n    • Private health insurance;\r\n    • Yearly bonus per company policy;\r\n    • Permanent employment contract.\n\r\nThe Company\n\r\nSociété Générale European Business Services is a player in the shared service center market and delivers high added value services in various fields of activity for worldwide entities of the Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20 countries mostly across Europe for all major business lines of the Société Générale Group.\n\r\nThe Shared Service Center for IT (SSC-IT) of SG EBS is a new organization that started early in 2015 to provide Société Générale Group IT Services. The mission of SSC IT is to contribute to SG Group transformation by proposing advanced high quality IT services along with innovative operating models.\n\r\nSSC-IT has today over 100 employees, and ambitions to grow beyond 300 in the next before end of 2017.\n\n \n\n\n", "title": "QA Engineer", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-qa-engineer/751338/1"}