{"body": "\n\n\n\nWe Are Looking for:\n\r\nA senior QA Automation Engineer/Lead to join our company for a new Adobe AEM development project team.\n\n\r\nOur Partner:\n\r\nA leading Adobe Solution Partner based in Munich.\n\r\nOur partner is an integrated marketing and technology services company that develops highly personalized web experiences in order to:\r\n• Help their end-customers make the business grow faster\r\n• Build B2B/B2E platforms to improve the collaboration with business partners or employees using the Adobe Marketing Cloud\n\n\r\nThe Platform:\n\n\r\nThe Adobe Experience Manager (formerly known as CQ5) is a 100% Java-based, platform-independent content management software solution.\n\r\nAEM is currently the worldwide market leader in the field of web experience management.\n\r\nAt present, more than 3,000 companies are using AEM – and the trend continues rapidly upward.\n\r\nAEM is a combination of the industry’s leading WCM platform Adobe CQ, Digital Asset Management (DAM), Social Communities (SoCo) and AEM Forms. This platform is designed to help you create a specifically tailored customer experience across channels.\n\r\nAEM’s performance relies especially on its unique architecture, the core of which consists of the Content Bus, which is used to create a virtual repository. The Content Bus allows content from all back-end systems to be standardized and also provides standardized management and access.\n\n\r\nResponsibilities:\n\r\n• Start an automation process for the project from scratch\r\n• Evaluate tools and define an automation strategy for the QA team together with the QA Manager\r\n• Implement a robust QA automation framework\r\n• Create and mentor an automation team\r\n• Work together with the manual testing team to assure successful releases\n\n\r\nRequired Competencies:\n\r\n• Experience in software testing web applications\r\n• Basic understanding of software architectures and concepts\r\n• Technical background (databases, client-server architecture, programming skills)\r\n• Knowledge of QA concepts and process\r\n• Experience in QA Automation\r\n• Adobe AEM / WEM foundation concepts (Plus)\r\n• Proficiency in English\n\n\r\nWe Value:\n\r\n• Respect\r\n• Reliability\r\n• Strive for excellence\n\n\n\r\nNotes:\n\r\n• Only candidates selected after the CV screening phase will be contacted.\r\n• The position is in Cluj-Napoca, but we also recruit non-Cluj residents willing to relocate.\n\r\n Fortech’s Offer\n\r\n At Fortech we enhance the value of each individual, encourage personal evolution and create an appropriate environment, in order to facilitate know-how transfer and to assure access to the cutting-edge technology.\n\r\n Working @ Fortech\n\r\n # Yearly training plan ~ designed to suit individual needs, comprising both hard and soft skills development and improvement\r\n # Career growth opportunities ~ working on international projects with global teams and working on-site at clients’ headquarters in Western Europe and the USA\r\n Varying professional activities ~ job rotation, coaching and mentoring activities\r\n Company-sponsored technical certification program ~ Microsoft, Oracle, Sitecore, ISTQB\r\n # Supportive working environment ~ separate office rooms for up to 10-12 people\r\n # Company-sponsored events ~ parties, team-buildings and sporting activities and competitions (football, basketball, volleyball, tennis, ping-pong, marathons, biking)\r\n # Premium subscription to medical services at a private health center\r\n # Motivating recognition and rewarding salary package (our company policy is to exclude PFA contracts)\n\n\n \n\n\n\n\n\n\t\t\t    $(document).ready(function() { \n\t\t\t    var allVideos = $('.job-video-container object, .job-video-container embed, .job-video-container iframe'); \n\t\t\t    var oldWidth = allVideos.width();\n\t\t\t    var oldHeight =  allVideos.height();\n\t\t\t    var aspectRatioOS = oldHeight/oldWidth; \n\t\t\t    allVideos.removeAttr('height').removeAttr('width');\n\t\t\t    function resizeVideoOSJS(){\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%;');\n\t\t\t\tvar widthInit = allVideos.width();\n\t\t\t\tvar heightInit = widthInit * aspectRatioOS;\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%; min-height: 220px; height: '+ heightInit +'px;');\n\t\t\t\t//.attr('width',  widthInit).attr('height', allVideos.height())    \n\t\t\t    }\n\t\t\t    resizeVideoOSJS();\n\t\t\t\t    window.onresize = resizeVideoOSJS; \n\t\t\t    });\n\t\t\t\n", "title": "Senior QA Automation Engineer", "company_url": "http://www.bestjobs.ro/firme/fortech-srl/36348/1", "career_level": "Middle, Senior", "company": "Fortech SRL", "locations": "\nStrada Frunzisului 106, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-qa-automation-engineer/751111/1"}