{"body": "\n\n\n\nSofting is a successful, independent provider of hardware and software for industrial automation and automotive electronics. SoftingRom has been founded early in 2005 as an R&D center of Softing AG Munich, with offices both in Cluj-Napoca and Miercurea-Ciuc. \r\nWe’re hiring C++ Developers for our Industrial Automation department in Cluj-Napoca.   As part of most modern industrial control solution, the central part (middleware) consists on architectures based on the OPC standards (see OPC Foundation - www.opcfoundation.org) which offer secure and reliable connectivity between different layers of the control solution (like the real time protocols and control processors) respectively other enterprise resources (Management Information systems, ERP, various databases, SCADA systems, other).\r\nBased on more than 20 years of experience, Softing is the most complete worldwide provider of OPC expertise (see http://industrial.softing.com/en/expertise/opc.html). Our R&D center in Cluj-Napoca is proud to contribute in a determinant way to the success ofthe OPC middleware and servers product ranges.\r\nWe have exciting plans to enhance our products for cloud computing, wide inter-connectivity, IoT and other modern technologies and therefore we are eager to get active contributions from good professionals like you.\r\nRequired skills/Experience\r\nOOP, C++Qt (optional)Technical background and experience in software design and development (architecture, design patterns, best practices)Communication abilitiesPassion for software applied in engineeringEnglish language (both reading and writing)\r\n What you could benefit of\r\nAttractive salary, medical services, fidelity bonus, lunch ticketsHighly qualified teamComprehensive technical trainings on our expertise areaPositive and informal working environmentChallenging projects for well-known customers in the industryThe opportunity to actively contribute at the design and success of our solutions \r\nIf this sounds interesting for you, please send your CV (in English/ Romanian language) at jobs_ro@softing.com and let's talk more about this role, about the projects and about our great team. \n\n\n", "title": "C++ Developer (Mid-Level/Senior)", "company_url": "http://www.bestjobs.ro/firme/softingrom/1119941/1", "career_level": "Middle, Senior", "company": "SOFTINGROM", "locations": "\nBuftea 1, Cluj-Napoca, Județul Cluj, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-c-developer-mid-level-senior/752393/1"}