{"body": "\n\n\n\nAre you a skilled C/C++ programmer? - Saguaro is Hiring! \n\r\nWe are looking for a talented C/C++ Software Developer, \r\n• who is interested in Using the latest technologies for color imaging and digital printing, with high-speed, multi-functional printing equipment, \r\n• who wants to Apply the latest technologies in an energetic, team-based culture,\r\n• who would like to Work in modern labs with state-of-the-art tools and equipment, and in a constantly developing environment designed especially for Software professionals! \n\r\nYou can become an active member of a highly energetic software development team! This team designs, develops and maintains software applications for complex, high-performance printing and document processing and finishing environments, designed for Linux operating systems, using C/C++ programming languages.\n\r\nOur Requirements:\r\n•\tUniversity Degree - Computer Science or related;\r\n•\tGood C/C++ programming skills;\r\n•\tFamiliar with applications designed for Linux environment (make, gcc, shell);\r\n•\tProcess/Threads synchronization and Network programming experience is a plus;\r\n•\tStrong team orientation.\n\n\r\nOur Offer\r\n• Opportunity to build a career with us\r\n• Exciting Projects to increase your development expertise\r\n• Being part of a great and dynamic team together with other talented Software Professionals\r\n• Top-Tier Salaries and Benefits! - Saguaro Tech offers top-tier salaries and benefits that currently include merit-based bonuses, employee loan subsidies, a savings plan, education benefits, professional training programs, medical clinic services, dental subsidies, gym and sport activities memberships and more.\r\n• Modern New Facilities! - Our roomy, new Timisoara campus provides Saguaro Tech employees with the latest in technology, tools and equipment, modern offices and state-of-the-art labs.\n\r\nIf you are qualified for this position, submit your CV now for immediate consideration. \r\nFor more information you can also contact us at: HR@saguarotech.net or visit our website at www.saguarotech.net.\n\r\nNote that only suitable candidates will be contacted.\r\nThank you! \n\n\n\n\n\n\n\n\n\n\n\n\t\t    videojs.autoSetup();\n\t\t    \n\t\t    videojs('videoid-1439975601').ready(function(){\n\t\t\t\n      \n\t\t\t// Store the video object\n\t\t       var myPlayer = this, id = myPlayer.id();\n\t\t       // Make up an aspect ratio\n\t\t       var aspectRatio = 320/640; \n\n\t\t       function resizeVideoJS(){\n\t\t\t var width = document.getElementById(id).parentElement.offsetWidth;\n\t\t\t myPlayer.width(width).height( width * aspectRatio );\n\n\t\t       }\n\n\t\t       // Initialize resizeVideoJS()\n\t\t       resizeVideoJS();\n\t\t       // Then on resize call resizeVideoJS()\n\t\t       window.onresize = resizeVideoJS; \n\t\t    });\n\t\t\n", "title": "C/C++ Software Developer", "company_url": "http://www.bestjobs.ro/firme/saguaro-technology-inc-sucursala-timisoara/36572/1", "career_level": "Middle, Senior", "company": "SAGUARO TECHNOLOGY Inc., Sucursala Timisoara", "locations": "\nSiemens nr. 5, Timișoara, Județul Timiș, România;Str Venus 33, Timișoara, Județul Timiș, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-c-c-software-developer/751662/1"}