{"body": "\n\n\n\nHigh demanding assistant manager position in the Romanian branch of the largest American videochat company. This job involves following the administrative procedures of the company as well as constant learning and improving of personal skills. \r\nWe are looking for a person who wishes to progress. \r\nThis job involves actively participating in the managing, supervising and training a staff of up to 400 models. Needless to say that the perfect candidate understands that videochat is a solid business and that we expect the highest ethical and professional standards both in dealing with the models and with the outside contractors and/or suppliers.\n\r\nCerinte:\r\n- English both spoken and written fluently. \r\n- Positive attitude focused on problem-solving instead of on the problem itself.\r\n- Multitasking, communication skills, intuition, ability to get a certain desired message across to any type of individual\r\n- Leadership skills, organized, open-minded, emphatic, ambitious, responsible, reliable.\r\n- Availability all weekdays, and all shifts (morning, evening, night).\n\r\nThis position represents a great opportunity to learn and be a part of an American management structure. We are focused on constant optimization and improvement both of the workplace and of the personnel. We understand that the employees make a company what it is, so we take special care in selecting them.\n\r\nIn order to maintain a stress-free work environment for our models, we have a female-only staff, therefore we are looking exclusively for female applicants.  Interviu Online:1.  If a news television would like to present our company in a show, would you have any problem in being included in this material and talking about the business in an interview?2.  If your best friend told you that she wanted to become a videochat model and wanted your advice, what would you tell her?3.  How do you define the perfect job?4.  Do you consider that the fact that you were born in Romania and not someplace else is a disadvantage for achieving your desired career? Please explain your answer.5.  If one of the models that you manage would have a negative attitude and would constantly complain to other models and to you about the poor response of her activity in terms of earnings, what would be your reaction? \n\n\n\n\n", "title": "ASSISTANT MANAGER PR office job secretara", "company_url": "http://www.bestjobs.ro/firme/standard-studio-srl/12705390/1", "career_level": "Entry, Middle", "company": "STANDARD STUDIO SRL", "locations": "\nBulevardul General Gheorghe Magheru, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-assistant-manager-pr-office-job-secretara/752387/1"}