{"body": "\n\n\n\nNordea will shape the future digital banking. For Northern Europe's largest digital project we arehiring highly skilled and motivated developers who with dedication and experience can securegreat digital solutions. Do you have development experience within one or more of the following areas: Mobile - iOS (Objective-C, Swift, adaptive UI, REST, JSON APIs, Git, Java Script, Python,Ruby, unit testing and open source projects etc) -  Android (REST, JSON APIs, Git, Java Script, Python, Ruby, unit testing and opensource projects etc)Web (HTML5, CSS3, Sass, Less, Flexbox, Bootstrap, TypeScript, CoffeeScript, JSlibraries, Angular JS, React JS, Backbone, Knockout, Jasmine, Qunit, Mocha, Karma, Gitetc)Test (Junit, NUnit, Jasmine, QUnit, Mocha, Karma, Java Script, Ruby, Java, C#, Scala,Java 8 Spring, RX Java, RESTful API, Play, Scalatra, Spring Boot, WebAPI, Maven,Gradle, Git, Linux, Jenkins etc)Integration (Java 8, Spring, RX Java, RESTful API, Play, Scalatra, Spring Boot, WebAPI,Maven, Gradle, Git, Linux, Jenkins, Java Script, Ruby etc) Security (Java, ObjC, Java Script, OWASP Top Ten, app development, RESTful API, Play,Scalatra, Spring Boot, Git, Linux etc)Nordea offers:You will become an important part of Nordea's strategic task force, which aims to develop thefuture digital platform  You will be working agile in a scaled environment; in small teams and in close cooperation witha Product Owner in Copenhagen  You will grow along with sharp minded and dedicated colleagues.Together we will create the future digital platform for bank customers.The recruitment process The recruitment process is handled by Speedrecruiters. This means that you do NOT have to writea time-consuming written application. Simply answer the detailed questions, which you can find byclicking here to go to our advertisement in Speedrecruiters. It usually takes only 10 minutes toapply for a job - and you know, shortly thereafter, whether you have the opportunity to go forward.It's quick and easy! \n\n\n", "title": "Developers at Nordea", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nCopenhaga, Regiunea Hovedstaden, Danemarca\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-developers-at-nordea/746428/1"}