{"body": "\n\n\n\nCăutăm oameni entuziaști și responsabili cărora le place să muncească. \r\nOferim un mediu de muncă excelent într-o echipă cu adevărat dedicată și motivată în care poți să te formezi și să câștigi experiență profesională. \r\nRespectăm cu strictețe toate normele legale și tratăm cu respect fiecare angajat.\n\r\nResponsabilități:\r\n- întâmpinarea clienților\r\n- vânzarea de produse de cofetărie\r\n- preluare comenzi- operarea casei de marcat\r\n- aranjarea produselor în vitrină\r\n- curățenia și ordinea în magazin\n\r\nBeneficii:\r\n- contract de muncă cu normă întreagă\r\n- program pe 2 ture, 5 zile pe săptămână\r\n- mediu de lucru plăcut\n\r\nDescrierea companiei\n\r\nFrench Revolution s-a înființat în 2013 și este singura cofetărie din România dedicata producerii de ecleruri de cea mai înaltă calitate.\r\nFrench Revolution are în prezent peste 20 de angajați care lucrează într-un laborator ultra modern și în 2 magazine situate în centrul Bucureștiului.\r\nFrench Revolution înseamnă o revoluție în calitatea si rafinamentul produselor de cofetărie franțuzești în România. Tot ceea ce facem se supune următoarelor 5 valori:\n\r\n1. Autenticitate si creativitate - suntem originali, surprinzători și folosim mereu ingrediente, rețete și metode de preparare autentic franțuzești;\n\r\n2. Onestitate - respectam angajații și clienții în tot ceea ce facem;\n\r\n3. Excelenta în produse și servicii - produse de o calitate excepțională și servicii care sa ofere clienților o experienta desăvârșita;\n\r\n4. Siguranță alimentara - aplicam cele mai înalte standarde de igiena, calitate a ingredientelor, condiții de păstrare a materiei prime si de prezentare a produselor;\n\r\n5. Pasiune - facem lucrurile cu dedicare pentru a oferi experiente gastronomice cat mai rafinate.\n\r\nwww.frenchrevolution.ro\r\nwww.facebook.com/frenchrevolution.ro\n \n\n\n", "title": "Reprezentant pentru magazinele Ateneu și Floreasca", "company_url": "http://www.bestjobs.ro/firme/french-revolution/13766894/5", "career_level": "Entry, Middle", "company": "French Revolution", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reprezentant-pentru-magazinele-ateneu-si-floreasca/211218/5"}