{"body": "\n\n\n\nInnovative Mobile Endeavors (IME), develops and supports massive infrastructure for mobile apps and games. We get billions of requests per month from millions of installed users, with the largest concentration on Android devices.\n\r\nOur infrastructure and development teams are located in the USA, Eastern Europe and Japan, with data centers in each region.\n\r\nWe pay generous salaries with the possibility of advancement. We work hard and play hard, with several BBQs and team events every year and the possibility to travel.\n\r\nWe primarily work from home, although we can offer an office allowance, for those who work best in a more structured environment. We develop Rockstar engineers, and allow people to own and run their own projects.\n\r\n---\n\r\nWe primarily practice a “dev-ops“ philosophy, where teams are responsible for deploying their own code, but we need a dedicated expert for things like MySQL tuning, firewall maintenance, hardware inventory management and selection, etc. You'll be the interface between data center operations and development teams. Ideally, our candidate will have some experience with PHP and programming as well as solid sysadmin skills.\n\r\nTechnologies:\r\n- Linux (RHEL, CentOS and some ubuntu)\r\n- MySQL / MariaDB\r\n- Redis\r\n- Automated deployment via ansible (but don't worry if you only know puppet or chef -- we'll train you on our tools)\r\n- Elastic and Kibana\r\n- HHVM / PHP-FPM, Java, Python\r\n- Nginx and HAProxy\r\n- Ceph\n\r\nSkills:\r\n- Strong skills with shell scripting and PERL or Python or PHP scripting.\r\n- Some PHP experience preferred, to help development teams analyze performance bottlenecks in production.\r\n- Strong focus on automated monitoring and failure detection.\r\n- Strong focus on clustering and setting up systems with no single point of failure.\r\n- Knowledge of low level networking (TCP/IP, DNS, BGP, Anycast, etc) a plus.  Interviu Online:1.  Please take a few minutes to tell me the pros and cons of running a particular application on bare metal vs on a cloud type environment.2.  Pros and cons of Docker vs. just using linux cgroups.3.  Why use a separate domain name for content delivery?4.  A service pings slow/down. You log into the server. If you know nothing else about the application, what are the first several things you look at? \n\n\n", "title": "Linux DevOps & Web Engineering Liason", "company_url": "http://www.bestjobs.ro/firme/ime-llc/13605003/5", "career_level": "Middle, Senior", "company": "IME, LLC", "locations": "\nCentru Vic, București, Municipiul București, România;Centru Vic, Timișoara, Județul Timiș, România;Salonta, Bihor County, Romania\n", "url": "http://www.bestjobs.ro/locuri-de-munca-linux-devops-web-engineering-liason/210492/5"}