{"body": "\n\n\n\nAngajam pentru sediul central din Bucuresti:\n\r\n- Coordonator Marketing \r\n- Asistent Marketing\n\r\nCum arata candidatul ideal:\n\r\n- Creativ si cu o imaginatie debordanta\r\n- Inteligent si inclinat spre publicitate si copywriting\r\n- Inovativ si curios\r\n- Pasionat si muncitor\r\n- Perfectionist\r\n- Abilitati excelente de comunicare si scriere\n\r\nExperienta anterioara in elaborarea de strategii de marketing offline si online pentru agentii de turism reprezinta un MARE PLUS!\n\r\nCe trebuie sa faca:\n\r\n-Elaboreaza si implementeaza strategia de marketing a agentiei\r\n-Elaboreaza si implementeaza strategia de retentie si fidelizare \r\nclienti existenti\r\n-Administrezaza paginile web \r\n-Gestioneaza conturile de Social Media \r\n-Realizeaza campaniile de E-mail Marketing\r\n-Administreaza Blogul agentiei\r\n-Mentine strans legatura cu agentia de publicitate care realizeaza campaniile de promovare online\r\n-Dezvolta campanii de comunicare si parteneriate strategice cu scopul de a creste vizibilitatea brandului si de a consolida reputatia agentiei \r\n-Studiaza atent competitia si propune metode de diferentiere \r\n-Inoveaza si imbunatateste permanent toate sistemele si instrumentele de lucru din agentie\n\r\nAtributiile sunt mentionate la comun pentru cele 2 posturi, se va lucra strans in echipa. Coordonatorul de Marketing va stabili distributia sarcinilor si va lua cele mai multe decizii.\n\r\nCe ii oferim noi:\n\r\n- Salariu foarte bun, corespunzator nivelului sau de pregatire si experienta\r\n- Birou de lux, calculator NOU, de lux (iMAC I5)\r\n- Conditii ft bune de lucru\r\n- Suport ,sprijin si feedback in derularea activitatii\r\n- Cursuri de perfectionare profesionala pe parcurs\n\r\nCv-urile se trimit pe adresa de mail manager@terratourism.ro impreuna cu strategia de marketing pe care o propuneti pentru promovarea agentiei.\n\r\nCea mai buna strategie va fi selectata castigatoare si va primi job-ul!  \n\n\n", "title": "Coordonator Marketing Agentie de Turism", "company_url": "http://www.bestjobs.ro/firme/terra-tourism-srl/11837352/1", "career_level": "Middle, Senior", "company": "TERRA TOURISM SRL", "locations": "\nStrada Emanoil Porumbaru, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-coordonator-marketing-agentie-de-turism/751168/1"}