{"body": "\n\n\n\n80% dintre băncile din Germania utilizează cel puţin o aplicaţie dezvoltată de msg. Colaborarea cu clienţii din domeniul financiar-bancar se realizează de peste 20 de ani.Business side:aplicaţia software oferă o previziune a tranzacţiilor financiare pentru următorii 10-20 de aniprin intermediul aplicaţiei, se facilitează luarea deciziilor de business referitoare la serviciile oferite: împrumuturi, refinanţări, oferte de creditare, rata dobânzii etc.utilizând un model de agregare a datelor, utilizatorii aplicaţiei pot să stabilească nivelul de detaliu atunci când are loc vizualizarea datelorTech side:Java 7, JavaEE, Spring, Hibernate, OSGi, RAP, Eclipse, DB2, OracleMercurial, Jenkins, Sonar, Jira, Teste FitNessScrumTask-urile specifice proiectului se atribuie fiecărui membru al echipei în funcţie de propriul stil de programare, competenţe şi motivaţie. Astfel există posibilitatea de a realiza:task-uri de development, estimări, code review, build management, documente de specialitate, mentoringdecizii de arhitectură, modelarea aplicaţiilor, concepere de prototipuri, proof of concept, susţinere interviuri tehnice, coordonare (în funcţie de nivelul de experienţă)Team & Travel side:colaborarea în echipe distribuite (RO&DE)aproximativ 25 de persoane care se regsesc în 3 locaţii: Cluj, Bretten, Eschborndelegaţii periodice în BrettenEşti o persoană care preferă imaginile în locul textului? Accesează albumul echipei: https://www.facebook.com/media/set/?set=a.1083762134969828.1073741962.180999248579459&type=3Pentru informaţii suplimentare şi aplicaţii ne puteţi contacta pe adresa de e-mail: stefania.deac@msg-systems.com  \n\n\n", "title": "Java Developer -banking software products", "company_url": "http://www.bestjobs.ro/firme/msg-systems-romania/11260030/5", "career_level": "Middle, Senior", "company": "msg systems Romania", "locations": "\nStr. Brassai Samuel nr. 9 Cluj Napoca, Cluj-Napoca, Județul Cluj, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer-banking-software-products/206227/5"}