{"body": "\n\n\n\nSociété GénéraleEuropean Business Services is looking for high standard professionals ready to commit on a long term basis, offering at the same time a wide variety of features such as expertise, challenging development opportunities in an international environment and the joy of a strong spirit.Mission :In order to ensure the orderly growth of the Service Center, EBS SSC-IT is looking for an Operations Manager that will take charge for the support functions and transversal activities across the center. This function acts as an enabler to the center growth and operations by providing critical services to the rest of the management team. Example of services include:•    Budget creation and follow up•    Management of our invoicing process, both on our provider, and client side•    Monitoring of our Headcount•    Developing and executing the Quality plan and the Continuous Improvement plan•    Reporting to the rest of SG EBS and the groupResponsabilities :The candidate will join EBS SSC-IT as the Operations Manager will be responsible for (non exhaustive):•    Financials follow-up of SSC IT in coordination with the corporate finance team, the line managers, as well as the team leaders.•    Resources tracking and resource plan •    Quality plan •    Risk and compliance•    ReportingThe Operations Manager will report to the Head of  SSC-IT.Main roles will be to:•    The regular follow-up of financial aspects of the center, in coordination with the corporate finance team, the line managers, as well as the team leaders. That includes (non exhaustive):o    working with Corporate Finance on budget creation as well as budget follow-upo    monitoring the production of the invoices for our clients (being produced by corp. Finance),o    producing and monitoring the invoices from our providers. o    monitoring our major financial KPIs•    The follow-up of our current resource, and the staff plan (based on upcoming activities). Report on various aspects of the resources. Continuously improve our Resource Tracker Tool. •    Define and implement Quality measures of our processes and deliverables, and their continuous improvement.•    Risk and compliance: Ensure all the staff is well aware of the risk and compliance framework, and ensuring the center is compliant on all aspects.•    Defining, and developing our reports for various stakeholders, work on their automation.Required Profile : •    Previous experience in IT application development/maintenance projects ;•    Previous experience in budgeting/finance follow-up;•    Previous experience in the field of near/off shore activity and financial models is considered a plus;•    B.S degree in computer science;•    A master degree or equivalent  would be a plus;•    Mastering of XL – mandatory;•    Strong understanding of  basic financial concepts  - mandatory;•    French would be a key differentiator ;•    Project Management skill;•    Analytical skills;•    Good written & verbal communication skills;•    Change management;•    Rigorous;•    Aptitude to multitask;Benefits:• Competitive remuneration and benefits package, based on qualifications and experience;• Possibilities of promotion and development of a career plan;• A modern working environment: open, informal, fun and start-up atmosphere;• Meal tickets;• Private health insurance;• Yearly bonus per company policy;• Permanent employment contract.Company:Société Générale European Business Services is a player in the shared service center market and delivers high added value services in various fields of activity for worldwide entities of the Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20 countries mostly across Europe for all major business lines of the Société Générale Group.The Shared Service Center for IT (SSC-IT) of SG EBS is a new organization that started early in 2015 to provide Société Générale Group IT Services. The mission of SSC IT is to contribute to SG Group transformation by proposing advanced high quality IT services along with innovative operating models.SSC-IT has today over 100 employees, and ambitions to grow beyond 300 in the next before end of 2017. \n\n\n", "title": "IT Operations Manager", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza, Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-it-operations-manager/746796/1"}