{"body": "\n\n\n\nWith presence in 100 countries and serving over 2,000 clients and over 1 million end-users, Basware is the leading provider of purchase-to-pay automation software and solutions.  Praised by industry analysts such as Gartner, AMR, Forrester, and PayStream, Basware’s products range from procurement and invoice automation to electronic invoicing and billing.  Basware’s clients include global multinationals and prestigious domestic organizations.  Basware’s Romanian operations have grown rapidly over the past few years. Find out more at www.basware.com.Basware is seeking a Presales Demo Master, to be part of the global Basware presales team, and to support Basware global sales to achieve the planned growth. While Basware solution demonstrations are the main sales tool, you will be an integral part of the “Basware Demo Excellence Team” within presales to manage Basware demonstration environment set-ups, version upgrades and environment maintenance. In addition, after a proper learning phase, you will participate in largest opportunities globally, whenever demo set-up and testing support or customization are needed. In addition to working closely with the other members of Demo Excellence Team in Finland, you will join the newly established Romanian presales team and work also closely with Presales Consultants in different countries. You will be located in Iasi, Romania and report to a Global Business Advisor, Presales in Finland.Responsibilities include:•    Basware Purchase-to-Pay (P2P) and Travel and Expense Management (TEM)  online demo environment set-up, version upgrades and environment maintenance•    Virtual Machine environments maintenance•    Demo scenario testing in all demos•    Demo customizations and documentation•    Demo supportTo be successful in this position we would like you to have:•    3-6 years of experience in a position with similar responsibilities•    Bachelor Degree (Business or Computer Science), MSc, or similar•    Good relationship management skills•    Be solution oriented, structured and analytical•    Enjoy learning and becoming an expert in Basware solutions and their technical environments•    Possess good IT skills•    Knowledge of Purchase-to-Pay and ERP processes and integrations is an advantage•    Fluency in English  Basware solution technical environment functions around the following:•    MS SQL DB maintenance (knowledge required)•    Windows 2008/2012 server maintenance (knowledge required)•    Windows workstations 7, 8, 10 (knowledge required)•    SQL, XML, HTML language (knowledge is an advantage)•    Azure (knowledge is an advantage)•    HyperV (knowledge is an advantage)•    Tableau (knowledge is an advantage)Travelling is required for the induction phase to join Basware global training programs and for possible global presales meetings. The main work itself does not require travelling.At Basware you will be part of a profitably growing, dynamic and forward looking company. We have an open working atmosphere and great Basware spirit. We offer you competitive compensation aligned with your competences and performance, a supportive team and an opportunity to build your career in an international environment that drives you to succeed. This position is available immediately. For further information, please send an email to: iasi@basware.com \n\n\n", "title": "Presales Demo Master", "company_url": "http://www.bestjobs.ro/firme/basware/10997390/5", "career_level": "Middle", "company": "Basware", "locations": "\nPalas 7E, Iași, Județul Iași, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-presales-demo-master/201187/5"}