{"body": "\n\n\n\nWe have vacancies for experienced heatlthcare candidates who have previously worked wiht the eldelrey and other sick people as well as candidates with no experience to work in care home settings by the seaside. \n\r\nYou will be working as a support worker, therefore mainly lokoing after one person at any time, often with very challenegibg needs such as Dementia , Alhtezmirs for example. They may also have other illneses where they require extra help and support.\n\r\nDuties will include:\r\n- Working in care / nursing home\r\n- Looking after one person on a daily basis, 1-2-1 support due to their challenging needs\r\n- Assisting with day to day living tasks such as washing and bathing, getting up in the morning and settling in to bed\r\n- Giving medicine ( after training)\r\n- Gaining trust with the person you care for so you can calm and relax them\r\n- Taking out on trips , doctors appointments, assisting with activities\r\n- Working with medical team to ensure well being of the patients\n\r\nCandidate:\r\n- Ideally experience or qualifications in care or medical or nursing\r\n- Full training for non-experienced candidates\r\n- Good level of English\r\n- Hardworking and trustworthy\r\n- Friendly and caring\n\r\nOn offer\r\n- Great rates of pay , depending on experience and qualifications and also whether it’s a night / day / weekend shift , from £7ph-£9.25ph depending on experience\r\n- Ongoing training and support, to build career \r\n- Uniform provided\r\n- Overtime and extra work available\r\n- Assistance with relocation and accommodation\r\n- Help with initial costs to move depending on experience\n\r\nNormal week will be 32 hour contract, earning £970 a month , if working 39 hours a week would be £1156 a month, 48 hours a week £1456 a month. This is a long term career with training and chance to become nurse / manager in the future. \n\r\nWe re interviewing in Bucharest end of Feb 2016 and also on Skype. Please apply for more details and interview. \n\n\n", "title": "Care Support Worker Jobs Uk - ££'s&Relocation Help", "company_url": "http://www.bestjobs.ro/firme/alexandra-sydney-associates-limited/13729329/5", "career_level": "Entry, Middle", "company": "Alexandra Sydney Associates Limited", "locations": "\nE60 Recea, Târgu Mureș, Județul Mureș, România;Old city centre, București, Municipiul București, România;Siderurgistilor St, Galați, Județul Galați, România;Strada Aeroport, Timișoara, Județul Timiș, România;Strada napoca, Cluj-Napoca, Județul Cluj, România;Strada Timiș 70, Brașov, Județul Brașov, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-care-support-worker-jobs-uk-s-relocation-help/212528/5"}