{"body": "\n\n\n\nE-securities: We are one of the biggest players in the global online trading industry. We own multiple prestigious brands, capable of offering our clients a variety of financial instruments on all the relevant capital markets worldwide. We guide our conduct to offer excellence through a safe, regulated trading environment. The perfect candidate for this job should have:•\tAdvanced conversational English (another foreign language is a major plus)•\tGood communication and social skills•\tConfidence and strong determination•\tThe ability to perform individually and also as part of the team•\tAn interest in sales tactics and influencing strategies•\tThe ability to acquire in-depth knowledge about our products and servicesAs daily tasks, you will be required to:•\tAssist the customers that have shown interest in using our services by helping them register with our platforms and activate their trading accounts •\tDevelop and maintain good relationships with the clients •\tAdjust the sales approaches and presentations with regard to our marketing campaigns•\tUse our internal CRM system to efficiently plan your activity and follow-up your prospects•\tContribute to the team effort in accomplishing the targeted results We are providing the following:1.\tThe Money•\tWe will show you how to generate at least twice the Romanian average monthly income (we’re paying everything on time, through a working contract, with full legitimacy)2. The knowledge & the skills•\tProfessional Sales Trainings (with highly experienced personnel from both inside and outside the company)•\tProfessional Sales Coaching and Mentoring (as an ongoing, organic process with private or group sessions, tailored to fit each individual’s professional and personal development needs and expectations)•\tUp to date financial and economic education + daily news and customized updates, ready to use in your daily activity.3. The vibe•\tMore than 50% of your awake time is spent at the office, so we set up the whole environment to accommodate everyone as in our second home; we like to call it “The Active Home”•\tThe dynamic of our workflow is “powered” by the exciting atmosphere and background music (Shouldn’t this be a part of any “perfect workplace” description?)•\tOur team values loyalty, commitment and real effort above anything – the reward is priceless: good comrades, respect and growth (financial, professional and personal)•\tWe believe that only when being provided with the optimum working context, you can really make a choice between true commitment and compromise.*Please note that we are the original authors of the above recruitment advertisement. If it happens for you to find it copy-pasted elsewhere, we let you draw the conclusion. Last but not least, we would be very happy to have the chance of meeting you! \n\n\n", "title": "ACCOUNT EXECUTIVE", "company_url": "http://www.bestjobs.ro/firme/ics-agency/13366006/5", "career_level": "Entry, Middle", "company": "ICS Agency", "locations": "\nStrada Scărlătescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-account-executive/201910/5"}