{"body": "\n\n\n\nJava Developer for an innovative application\r\nCome and develop solutions for Siemens in Brasov and Cluj at Siemens Convergence Creators!\n\r\nCompany profile:\r\nWe are a Siemens entity, providing internally to other units and externally to our direct customers solutions and services in the fields of communication networks, service and customer management, public safety and security, multimedia infotainment, as well as aerospace technology.\r\nBased in Brasov and Cluj our company Siemens Convergence Creators SRL offers true experiences in international and local end-customer projects in the domains of: IT Process Orchestration, Voice networks, Product Configuration applications, Public Security and Space.\n\r\nProject description: \r\nThe target project consists of developing a brand new web-based CPQ – Configure, Price, and Quote – tool that has as main capabilities 1) fast offer creation, 2) dynamic contract generation and 3) rule based configuration of offer elements. An initial set of features have already been implemented and, after a very positive feedback from the international market, we have the urge to continue development and deliver a high quality product that lives up to its promises.\n\r\nYou will become part of the dynamic evolution of this spectacular product and have the chance to contribute substantially to it. We work agile, we focus on quality and we encourage active involvement from the team members. And we have a lot of fun. \r\nCome join us and make your contribution worth!\n\r\nEstimated Project duration: April- September 2016\n\r\nTechnical skills required:\r\n•\tExpert in Java EE, Spring, JPA, Hibernate, JSP/JSF, Servlets, Web Services\r\n•\tSolid Experience with client-server based technologies and SW architecture practices\r\n•\tGood understanding of various Databases, UI frameworks, deployment environments \r\n•\tPractitioner of Unit Testing , Continuous Integration, Build Automation and Agile Methodologies\r\n•\tAble to analyze and synthesize complex technical information\r\n•\tExperience with Vaadin is a big plus\n\r\nSocial skills:\r\n•\thave good interpersonal and communication skills\r\n•\thave creativity, promoter of new ideas\r\n•\tgood team player\r\n•\tspoken languages: English at a very good level\n\r\nWork experience: 5-7 years in SW Development\n\r\nBenefits:\r\n•\tWork within both a professional and a friendly team;\r\n•\tFlexible work schedule and work from home policy;\r\n•\tCompetitive remuneration; \r\n•\tThe chance to contribute substantially to an innovative product.\n \n\n\n", "title": "Java Developer - Project based assignment", "company_url": "http://www.bestjobs.ro/firme/siemens-convergence-creators-srl/3757579/2", "career_level": "Middle, Senior", "company": "SIEMENS Convergence Creators SRL", "locations": "\nB-dul Mihail Kogalniceanu nr.21 Bl.C6, Brașov, Județul Brașov, România;Calea Turzii 76, Cluj-Napoca, Județul Cluj, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-developer-project-based-assignment/231132/2"}