{"body": "\n\n\n\nReady to make $30,000 USD while working for a fortune 500 company from the comfort of your home? Eager to join a network of the most talented remote workers in the world? If so, this role is for you. Work for Crossover, and you’ll earn the most competitive wages on the market, collaborate with the most skilled teams in your field, and work for the most elite companies in the world. Sound too good to be true? Take a closer look... What to Expect as an iOS Developer at CrossoverJoin Crossover and you’ll be part of a team responsible for designing, coding, testing, debugging and maintaining various digital media applications. We strive to keep current on the latest trends in mobile technologies, so you’ll be expected to effectively lead team members and act as a technical reference. We’ll want you to clearly explain various technologies and solutions to both technical and nontechnical stakeholders. During any events and games, you will provide phenomenal support for live products. You will develop and support front-end, online mobile product initiatives. You will be responsible for creating and iterating excellent software applications with top quality user experience. On a bigger scale, you will work together with other developers, engineers, and production groups to design and implement new applications, systems, and tools that are unparalleled in the market.Qualifications for this OpportunityIf you want to work with the best, you have to be the best. A successful iOS Developer at Crossover will demonstrate the following qualifications:- 3+ years of experience building high traffic and large scale iOS apps- Committed to producing code that follows the best practice’s of the industry- Previous experience with other mobile platforms (not required but desired)- Proficiency in the following skills and technologies is mandatory:- xCode- Objective-C, JSON, XML, SOAP, REST- OO programming and design patterns- HTML5, JavaScript, jQuery, Ajax and PHP- APIs and Web Services- Video playback in iOS (not required but desired)- Server-side technologies such as PHP and Java- Proficiency in Android SDK is desired but not mandatoryCompensationAt Crossover, you’ll earn extremely competitive wages while enjoying the flexibility of working from virtually anywhere on the face of the earth:Salary: 15 USD/hrPosition type: Full time (40 hours per week)Location: GlobalThe Type of iOS Developer We’re Looking ForCrossover values a culture of excellence. We need developers who are not only technically proficient, but also demonstrate the following qualities:- An ability to quickly and eagerly learn new technologies- A Willingness to take responsibility for projects and determine their trajectory- An ability to consistently meet deadlines even while running multiple projects- Excellent communication skills with a wide range of individuals (in English)- A collaborative approach to team projectsNext StepsReady to join? Start the process now by applying through our application link. If you meet the qualifications, we will proceed with a series of tests and interviews. Crossover is eager to see what you have to offer our cutting edge global workforce. \n\n\n\n\n", "title": "iOS Mobile Apps Developer - $2500/month", "company_url": "http://www.bestjobs.ro/firme/crossover/13728342/5", "career_level": "Entry, Middle", "company": "Crossover", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-ios-mobile-apps-developer-2500-month/198920/5"}