{"body": "\n\n\n\nWe are a Live video streaming company in the capital of Luxembourg and our main productsare http://jasmin.com and http://livejasmin.com (check alexa.com) with 35 million daily users.We are the #1 in the live streaming industry. Over the past 15 years our company has seenexponential growth with over 1000 employees across 3 continents with offices in Luxembourg,Los Angeles, Budapest  and Hong Kong.Are you excited by the thought of challenging the limits of your knowledge? Do you enjoyovercoming obstacles? Do you push yourself to learn and do more each day? If the answer is yesto any (or all) of the above questions, then we have an open position just for you! Come workwith us on the largest webcam site in the world, where every day offers a new opportunity toshow just how good you are at what you do. We are currently looking for talented individuals tojoin us at our office Luxembourg.TechnologiesWork with multiple technologies: PHP, NodeJS, NoSQL, Distibuted systemsHigh availability systemsHigh traffic systems (35 million daily visitors)2000 servers on 4 nodes worldwideTake part in the research of new technologies and solutionsCodingModular MVC system development OOP principles (Design patterns, SOLID, DRY, Yagni)Clean code, covered by unit, integration and UI tests.(incl. TDD)Long life-cycle application development (evolution of applications)Design, develop and test softwareDevelopment methodologyAgile development process in ScrumContinuous IntegrationSystem for daily based deployments, Git WorkflowContribute OpenSource projectsWhat we offerOutstanding salary packageRelocation packageAdditional benefits: meal voucher, private health insurance, Sympass cardConferences, certifications, technical workshops, trainings, and language coursesPossibility to evolve in the company (career development, opportunity to work on new projects)Newest hardware, multiple monitorsChill rooms, LAN parties and fun events (check pictures)Safe and multicultural capital in the heart of Europe (check video) ranked as #14 best place to live on the planet EarthMulti-cultural environment, 30 different nations, English being the official languageExpectation3 years of software development experience (PHP is an advantage)OOP skills and knowledge of design patternsClean Coding is your most important principleExperience with Relational Databases and NoSQL technologiesFollow current technology improvementsPassionate about self improvement and Web TechnologiesUpper intermediate English knowledge (B2) or higherAdvantagesExperience in any other Web Development technologyKnowledge of Unit Testing and Test Driven DevelopmentExperience that involved working with high-availability, high-performance, scalable systemsExperience with Live Streaming and Stream Encoding technologiesFamiliarity with Extreme Programming (XP)Knowledge of Agile methodologies \n\n\n", "title": "Senior Software Engineer PHP (based in Luxembourg)", "company_url": "http://www.bestjobs.ro/firme/docler-holding/13900811/5", "career_level": "Senior", "company": "Docler Holding", "locations": "\nLuxemburg, Luxemburg, Luxemburg\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-software-engineer-php-based-in-luxembourg/201421/5"}