{"body": "\n\n\n\nSwiss based company focused on online business opportunities that recently opened a branch office right in the middle of Bucharest is working on an ambitious and innovative online application from scratch. This is a great opportunity for any serious web programmer to prove their talent in a fast paced multicultural and open-minded environment. We are looking for talented people to complete our team in Bucharest !\n\r\nWhat would you do ? \n\r\n•\tDesign, code and test technical solutions while seeking optimal performance and structure; \r\n•\tWork with Project Managers to build project plans and estimations;\r\n•\tPropose ideas to improve the applications, procedures and technologies used;\r\n•\tWrite tests and internal documentation to improve the consistency and reliability of the application;\n\r\n[ Your profile ]\n\r\nEssential skills:\n\r\n•\tTechnical Bachelor’s degree or documented project references/experience;\r\n•\t3+ years of experience as a PHP developer;\r\n•\tStrong proficiency in PHP5 and MySQL;\r\n•\tExperience and proficiency in modern, extensible server-side web framework;\r\n•\tProven experience in working with REST APIs;\r\n•\tVery good communication skills, analytical thinking, and motivated;\r\n•\tProficient in English. Knowledge of French and/or German is a plus;\n\r\nAdditional Preferred Skills (it’s a plus):\r\n•\tKnowledge of AngularJS, jQuery;\n\r\nDesirable personal skills:\n\r\n•\tMust have a sense of humor, positive approach and work well within a team;\r\n•\tProactive, autonomous and self-motivated;\r\n•\tEnthusiasm for learning new and emergent technologies;\r\n•\tStrong analytical skills, attention to details; ability to understand user needs;\r\n•\tCreative and easily adaptable to change;\n\r\nWhat we offer:\n\r\nBased in the city center in a pleasant neighborhood in Sector 1, we provide :\r\n• Full time employment contract\r\n• Attractive salary\r\n• Challenging job in a professional and multicultural environment.\r\n• Being part of a young and dynamic team...\n\r\nContact  : \r\nJoseph Gurau \r\njobs@dynsee.com\r\n0737 892 042\n\n\n  Interviu Online:1.  Please list a portfolio of all the applications you worked on, and let us know your contribution to them.2.  Assuming that you've been assigned to develop a web application in a new technology, how would you get started?3.  What is your approach in regard to documentation and testing of an application you develop?4.  Are Interfaces and Abstract classes important to you?5.  What's so great about Laravel 5 and AngularJS ?6.  What source control do you use for your projects?7.  What is your favourite design pattern and why?8.  What do you do when you get stuck with a problem you can't solve?9.  What do you do to stay aligned with the latest technologies and tools?10.  Describe, in as much detail as you think is relevant, what happens when you type an url into a browser and press Go. \n\n\n", "title": "Full-time PHP Developer / Backend Engineer", "company_url": "http://www.bestjobs.ro/firme/dynsee-ag/14204671/5", "career_level": "Middle, Senior", "company": "Dynsee AG", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-full-time-php-developer-backend-engineer/203077/5"}