{"body": "\n\n\n\nGrupul Viking este unul din liderii mondiali in furnizarea de sisteme si echipamente pentru protecția împotriva incendiilor, cu peste 7.000 de angajati in intreaga lume. Suntem un grup care oferă o gama extinsa de produse si sisteme pe bază de apă și non-apă, oferind distribuție și suport tehnic clientilor nostri.Datorită creșterii continue și dezvoltarii pieței, pentru locația noastră din Otopeni, Ilfov cautam: CUSTOMER SERVICE REPRESENTATIVEÎn acest rol variat și interesant, vei fi responsabil cu mentinerea contactului cu clienții, astfel încât e necesar să ai abilitatea de a raspunde prompt si eficient solicitarilor acestora. Tu oferi clientilor nostri suport și asistență prin telefon si gestionezi cotatiile de pret și comenzile in mod eficient până la livrarea materialelor. Vei ajuta, de asemenea, la pregatirea comenzilor clientilor în depozitul nostru (ambalarea produselor pentru transport, receptie marfa).Vei lucra în strânsă colaborare cu Directorul de Vanzari si Coordonatorul de logistică din locația noastră și cu alte departamente centrale.Responsabilitati:•\tsa comunici cu clientii cu privire la termenele de livrare, informații despre produs, etc.•\tsa procesezi și sa urmăresti ofertele și comenzile primite, de la alegerea produsului pana la livrarea finală.•\tsa informezi clientii în caz de modificări ale termenelor de livrare.•\tsa verifici confirmarile de comanda.•\tsă colaborezi îndeaproape cu Directorul de Vanzari pentru preturi, creanțe etc.•\tsa pregătesti documentele tehnice pentru clienți•\tsa ajuti, daca e necesar, la descărcarea produselor primite de la operatorii de transport.•\tsa ajuti la pregatirea comenzilor clienților.Profil:•\texperiență de minim 3 ani intr-un mediu comercial și servicii pentru clienți.•\tdisponibilitate pentru activitati fizice, precum pregatirea comenzilor și alte activități de depozitare.•\tabilități administrative excelente și cunoștințe tehnice - experienta in domeniul construcții sau instalații reprezinta un avantaj.•\tcunostinte excelente de Lb. română și engleză; Limba germana reprezinta un avantaj•\tcunostinte de operare PC•\tabilitati de comunicare verbala si scrisa, gandire pozitiva.•\tpersoana foarte bine organizata, care sa poata prioritiza mai multe sarcini în mod eficient si careia sa ii placa lucrul in echipa \n\n\n", "title": "CUSTOMER SERVICE REPRESENTATIVE", "company_url": "http://www.bestjobs.ro/firme/viking/14260648/5", "career_level": "Middle", "company": "Viking", "locations": "\nBucurești, Municipiul București, România;Otopeni, Județul Ilfov, România\n", "languages": " Engleza, Romana, Germana", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-service-representative/201890/5"}