{"body": "\n\n\n\nVeeam's Global Campaigns and Digital Marketing team is now hiring. We are utilizing innovative digital and offline marketing techniques for engagement creation, contextual marketing and lifecycle marketing to connect with our audience in 70+ countries.\n\r\nThe Web Content Specialist is responsible for keeping Veeam corporate portals and websites up to date and in perfect condition.\n\r\nResponsibilities\n\r\nPrimarily responsible for content modifications, additions, deletions and implementing approved digital enhancements within a web-based content management system.\r\nContinually monitor the website in a proactive manner to ensure that information is accurate, content is current and pages are free of errors.\r\nKeep up to date on all web guidelines and standards. Work with Creative and Front-end teams to make certain that the proper guidelines are followed across all digital channels.\r\nPerform image manipulation tasks such as creating thumbnails, image resize, file format conversion and simple image edits.\r\nCreate and maintain multimedia, including photo galleries, slideshows, and videos embedded in Web pages.\r\nManage all work request within a tracking system\r\nDistribute posting notification to the appropriate stakeholders.\r\nVerify that all content is approved through proper channels and systems prior to posting.\n\r\nQualifications\n\r\nMust be able to work effectively both as a team member and independently.\r\nDemonstrate ability to prioritize, multi-task, and work with minimal supervision in a team environment\r\nStrong organization skills with emphasis on being conscientious and detail-oriented\r\nMust be able to create and edit images using software tools such as Adobe Photoshop, Adobe Illustrator or Adobe InDesign.\r\nExcellent computer skills and proficiency in Word, Excel, Outlook, Internet Explorer and PowerPoint\r\nBe conversant in web basics.\r\nMust possess excellent written and oral communication skills in order to effectively communicate with a wide variety of staff regarding the publication of information on the web.\r\nKnowledge of multimedia/creative: e.g., interactive/web content, digital graphics/optimization\n\r\nAdditional skills\n\r\nWorking knowledge of computer software such as Windows, Microsoft Office, Adobe Creative Suite, as well as experience with social networking websites\r\nMust have excellent skills in editing various types of web content ranging from general text content to specialized digital content\r\nAbility to manage time and workload effectively, which includes planning, organizing, and prioritizing with attention to details\r\nKnowledge and/or experience with HTML, CSS, web analytics, and content management systems is a strong plus\n\r\nWe offer\n\r\nModern, energetic working environment\r\nOpportunities for professional growth and promotion\r\nSalary ranges depending on skills and expertise\r\nFlexible working hours \n\n\n", "title": "WEB CONTENT SPECIALIST", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Entry, Middle", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-web-content-specialist/208219/5"}