{"body": "\n\n\n\nJob purpose:The IT Technical Support Specialist works closely and collaboratively with various internal stakeholder groups including the HR, Training,  IT Teams and LMS vendors in order to support the implementation and day-to-day operations/administration of the new Learning Management System (LMS). He/she assists LMS end users, backend administrators, instructional designers / course developers and HR / L&D management with content set up and loading, system monitoring, maintenance and troubleshooting, reporting and training. This role will also be focused on creating and publishing to the LMS online learning content utilizing e-learning authoring tools and technologies.Job Description:•\tManages learning content in all Learning Management Systems (LMS) that education team uses•\tProactively monitors LMS for technical issues•\tProvides Tier-2 (main contact point on technical issues for Tier-1 support, and other internal teams when needed) technical support (adjusting settings, , escalation to platform’s vendor; investigate and seek solutions to complex issues, refer to Level 3 as necessary; and perform diagnostic testing, and the utilization of remote control tools)•\tDevelops “how to” procedures and fixes bugs in LMS in urgent cases•\tProactively manages knowledge base of feedback, issues and feature requests•\tWrites specifications and test cases for the new features in LMS according to department’s business needs•\tGive individual or group instruction to users or make arrangements for instruction of software or systems.•\tConfigure software, and provide technical assistance. Assist in software needs and upgrades•\tTrack escalated user problems and inform the user of the status. Log all client problems and solutions.Technical Skills:•\t1+ years of PHP, JavaScript, CSS and HTML development experience (.NET is a strong advantage)•\tStrong technical proficiency and the ability to learn complex systems quicklyExperience and education:•\tFluency in English and French is required, Polish is a plus•\tBachelor’s Degree in Technology or Computer Science (Politehnica, ASE Cybernetics etc.)•\t3+ years of Support, Testing or similar experience, which includes writing specifications and managing external development•\tAble to install and maintain web servers and application servers•\tGood understanding of web based systems, •\tKnowledge of monitoring tools (deploy and use): Nagios, Cacti, HPOV, Universe, NetBackup, BMC products•\tBasic understanding of multiple operating systems such as AIX, Linux, and Windows.•\tKnowledge of Web and application servers: Tomcat, Apache, Websphere, Weblogic, Jonas, etc.•\tStrong organization skills with the ability to manage many projects simultaneously•\tExcellent organizational, written, and verbal communication skills•\tAbility to perform comfortably in a fast-paced, deadline-oriented work environment•\tAbility to work as a team member, as well as independently•\tExperience in a quality assurance role, preferably in a contact center or customer service environment•\tAbility to conduct and manage project reviews and communicate process improvement recommendations.Thank you for applying! \n\n\n", "title": "IT Technical (LMS) Support Specialist with French", "company_url": "http://www.bestjobs.ro/firme/orange-romania-sa/885505/1", "career_level": "Entry, Middle", "company": "Orange Romania SA", "locations": "\nBulevardul Lascar Catargiu Nr.51-53 sector 1, București, Municipiul București, România\n", "languages": " Engleza, Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-it-technical-lms-support-specialist-with-french/749063/1"}