{"body": "\n\n\n\nWorking within the Web platform development team, the Senior FE Developer role is crucial to ensure Fortuna delivers high-quality products and services to our customers. The main focus of this position will be on new products using Liferay portal framework and Fortuna Web Platform. This is a great opportunity for professional who is looking for challenge and very interesting position.Key Accountabilities:- Design, code and debug core platform components- Working at all stages of the product lifecycle from requirements capture, through design and implementation to system testing and integration. - Increase efficiency through automation, workflow streamlining, and system optimization- Keeping current with new technologies and making recommendations to the team - Maintaining and enhancing existing product code. - Working with members of the QA and delivery teams to ensure products are tested, installed and maintained to a high standard. - Maintaining high quality coding standards within the team Qualifications:- BSC/MS  in either Software Engineering or Computer Science- Experience working  with JavaScript, AJAX, jQuery- Experience working with CSS3, XHTML, HTML5          - Experience of cross-browser projects development          - Experience in mobile development cross devices and browsers- Excellent knowledge of web technologies in general- Excellent knowledge of core JavaScript- Understanding of the principles of the OOP-  Caching strategies           \t   - Cache manifest           - LocalStorage           -  WebSQL/IndexedDB(optional)- Ability to maintain good quality of work tasks- Strong team player with good communication skills- Fluent English \n\n\n\n\n", "title": "Senior Frontend Developer", "company_url": "http://www.bestjobs.ro/firme/sc-bet-active-concept-srl/14203803/5", "career_level": "Senior", "company": "SC BET ACTIVE CONCEPT SRL", "locations": "\nCalea 13 septembrie, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-frontend-developer/198733/5"}