{"body": "\n\n\n\nJob Description:\n\r\nThe position is located in Bucharest, Romania \r\nWe are looking for a technical person who will:\n\r\n• be part of a team developing network management system for managing Ceragon's devices.\r\n• be responsible for the design and development of different features of the NMS product.\r\n•\ttake active role in discussions regarding the NMS product future architecture.\n\r\nBy joining our team, you will enrich your experience and become a technical professional in the telecommunications field, specifically to the NMS system of such a customer.\n\r\nJob Requirements: \n\r\nThe ideal candidate has the following:\n\r\nMust:\n\r\n•\tBSc/BA Computer Science or equivalent.\r\n•\tVery good Java knowledge of at least 3 years of experience as Java software engineer\r\n•\tProven experience of OO software design and multithreading programming.\r\n•\tProven experience in SQL and relational DB concepts.\n\r\nAdvantage: \n\r\n•\tExperience with J2EE application servers (JBoss is preferred).\r\n•\tExperience with Spring environment.\r\n•\tExperience with JPA and Hibernate.\r\n•\tExperience with network management systems (NMS/EMS) and SNMP.\r\n•\tFamiliarity with Eclipse RCP / Swing.\r\n•\tFamiliarity with PostgreSQL / Oracle DB / MySQL.\r\n•\tFamiliarity with JUnit testing and continues integration environments.\r\n•\tFamiliarity with Maven.\r\n•\tFamiliarity with JMS and messaging-based solutions.\r\n•\tExperience of working in multi-site projects.\r\n•\tExperience of working in a Scrum / Agile project.\r\nWe are looking for candidates with excellent communication skills, capable of self-learning and working in a challenging environment, who is highly motivated and willing to work as a team player. \n\n\n", "title": "Experienced Java Software Engineer", "company_url": "http://www.bestjobs.ro/firme/ceragon-networks-srl/13228347/1", "career_level": "Middle", "company": "Ceragon Networks SRL", "locations": "\n5 Gheorghe Manu Street Floor 2 and 4 District 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-experienced-java-software-engineer/751368/1"}