{"body": "\n\n\n\nLa Vodafone, vei gasi echipa, informatiile si resursele care te vor stimula sa-ti pui in valoare cunostintele si talentul. Astfel, zi de zi iti vei depasi limitele si te vei transforma intr-un supererou capabil sa isi foloseasca puterile in slujba clientilor. De asemenea, vei gasi in Vodafone o echipa pentru care satisfactia clientilor, ultimele descoperiri tehnologice sau lansarile de cele mai avansate modele de telefoane, accesorii sau tablete sunt tot atatea oportunitati de invatare si de dezvoltare. Te regasesti in aceasta descriere? Inseamna ca esti pe drumul cel bun pentru a deveni urmatorul Consultant de Vanzari Vodafone pentru clientii business in cadrul magazinului Vodafone din orasul Constanta. Ce vei face in rolul de Consultant Vanzari Vodafone pentru clientii business? -\tVei crea o experienta de cumparare excelenta clientilor Vodafone din segmentul business – iti vei putea pune amprenta personala in intelegerea nevoilor, consilierea si comunicarea cu acestia, depasindu-le asteptarile si facandu-i sa  isi doreasca sa revina;-\tVei dezvolta relatii cu clientii business cu care interactionezi si iti vei crea un networking personal. Vei gestiona bazele de clienti business alocati  si vei urmari evolutia fiecarui cont in sensul de a propune in permanenta cele mai potrivite solutii de comunicare;-\tVei testa impreuna cu clientii si le vei furniza informatiile necesare despre functionarea si utilizarea  produselor  si serviciilor Vodafone;-\tVei avea o serie de activitati aditionale in magazin ca: verificarea integritatii, completarea contractului si a actelor aditionale, facturarea si completarea certificatului de garantie, preluarea si trimiterea in service a echipamentelor;-\tVei face analize de vanzari si vei completa rapoarte regulate;-\tVei crea o atmosfera de lucru propice unei bune desfasurari a activitatii din magazin, contribuind astfel la a face viata clientilor mult mai usoara.Ce cautam la urmatorul Consultant de Vanzari Vodafone pentru clientii business? -       Nevoia de a fi la curent cu ultimele noutati in tehnologie-       Cunostinte specifice despre industria telecom-       Foarte bune abilitati de ascultare si comunicare-       Placere autentica de a intelege nevoile clientului si a-i propune cele mai potrivite solutii -       Minim studii liceale (studiile universitare finalizate reprezinta un avantaj)-       Engleza nivel avansat-       Foarte bune abilitati de lucru cu calculatorul (Outlook, MS Office) Si ca sa fii si mai pregatit pentru aceasta provocare, poti merge in orice magazin Vodafone pentru a urmari mai atent activitatea celorlalti colegi. \n\n\n", "title": "Consultant vanzari Business Vodafone Constanta", "company_url": "http://www.bestjobs.ro/firme/vodafone-romania/2935259/2", "career_level": "Entry, Middle", "company": "Vodafone Romania", "locations": "\nStrada Stefan cel Mare, Constanța, Județul Constanța, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-consultant-vanzari-business-vodafone-constanta/229999/2"}