{"body": "\n\n\n\nFor our division of Applications Development Center, we have an exciting opportunity for Recruiters willing to learn and develop their skills in IT recruitment. \r\nDoes Java, .Net, PHP, QA and Mobile sound familiar to you? Than this is your place!\r\nYour role will be to perform end-to-end recruitment and selection processes for various IT projects.\n\r\nKey responsibilities:\r\n•\tYou will evaluate applicants by discussing job requirements and applicant qualifications with managers; \r\n•\tYou’ll perform active search throughout the main recruitment channels as well as identifying new ones;\r\n•\tYou’ll interview applicants on a consistent set of qualifications and compare their qualifications to the job requirements;\r\n•\tYou will assess the project needs and you’ll build a suitable recruitment strategy;\r\n•\tYou will refer applicants to the hiring managers in the organization, making hiring recommendations when appropriate;\r\n•\tYou will work closely with the Development, Management and Support teams to deliver high quality recruitment services to our customers.\n\r\nRequirements:\r\n•\tBachelor or Master Degree in Psychology or Human Resources;\r\n•\t2+ years of professional experience in actively recruiting technical profiles (Software Developers, QA Engineers, Software Architects, Support Engineers, etc.);\r\n•\t3+ years of experience in HR/Recruitment;\r\n•\tFluency in English and/or other European language is a must.\n\r\nIdeal profile:\r\n•\tAbility to openly present her/his own ideas;\r\n•\tIndependent and highly self-motivated with a strong customer focus;\r\n•\tAble to work both independently and as part of a team;\r\n•\tWilling and able to be part of international projects and initiatives;\r\n•\tAction and results orientated, ability to manage multiple priorities is also expected;\r\n•\tHe/she should also have strong analytical skills, good organization skills and attention to details.\n \n\n\n", "title": "IT Recruiter", "company_url": "http://www.bestjobs.ro/firme/stefanini/3482/1", "career_level": "Middle", "company": "Stefanini", "locations": "\nDimitrie Pompei nr 6A, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-it-recruiter/751289/1"}