{"body": "\n\n\n\nVeeam's Global Campaigns and Digital Marketing team is now hiring. We are utilizing innovative digital and offline marketing techniques for engagement creation, contextual marketing and lifecycle marketing to connect with our audience in 70+ countries.\n\r\nAt Veeam we are selling 100% with and through channel partners and we are empowering our partners with multichannel campaigns and the necessary marketing infrastructure.\n\r\nLanguage Required: English\n\r\nResponsibilities\n\r\nThe Senior Manager Global Partner Marketing Campaigns will be accountable for all partner marketing campaign creation and execution. The outcomes will be campaigns which target the right segments (SMB, midmarket, enterprise), communities (VMware, Hyper-V, NetApp, EMC, Cisco, HP) and audiences (persona we sell to) through the utilization of the most effective engagement engines (e-mail, display ads, social media, Google ads etc.).\n\r\nIn addition Veeam is empowering its partners through a partner marketing platform which supports the execution of the campaigns. This role will be responsible for creating and managing all campaign assets on the platform and driving channel partners to utilize, adopt and execute campaigns with those assets.\n\r\nSuccess will be measured through the partner adoption of campaigns, the effectiveness of our campaigns and the ability to support broad demand generation creation. \r\nThe specific set of KPIs will need to be developed for each campaign, including the impact on awareness, demand generation / leads, revenue and the utilization of campaign assets.\n\r\nIn order to be successful this person will need to collaborate with segment marketing, product marketing, field marketing and channel sales teams. \r\nWhile subject matter experts will support the bill of material creation, this person will also need to have the ability to create relevant partner marketing assets on their own.\n\r\nQualifications\n\r\nBachelor’s degree in marketing or equivalent, a Master’s degree preferred\r\nMinimum of 6 to 8 years of (global) marketing experience in complex, technology based industries\r\nMinimum of 3 years of proven experience in integrated campaign management with and through channel partners\r\nAbility to produce theme based relevant partner campaign content for different media and channels through synthesizing information from various sources and through the inclusion of subject matter experts\r\nStrong collaboration and management skills with the ability to work across many functions\r\nComfortable with executing yet capable of also influencing others for joint results\r\nExceptional English communication skills: must be able to articulate a clear, persuasive argument orally and in writing\r\nModern sales and marketing technology & tools understanding like the use of CRM systems, marketing automation systems, google analytics and techniques to create SEM, SEO, retargeting, banner, display advertisement and landing pages a plus\r\nExperience in (campaign) budget management and in developing a set of (campaign) success criteria`s preferred\n\r\nWe offer\n\r\nModern, energetic working environment\r\nOpportunities for professional growth and promotion\r\nCompetitive salary \n\n\n", "title": "SENIOR MANAGER,  GLOBAL PARTNER MARKETING CAMPAIGNS", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Middle, Senior", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-manager-global-partner-marketing-campaigns/208222/5"}