{"body": "\n\n\n\nBring your talent and passion to Accenture – sharpen your skills, build an extraordinary career and play a key role in creating solutions that transform organizations and communities around the world.We are a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations.We work at the intersection of business and technology to help clients improve their performance and create sustainable value. With more than 358,000 people serving clients in more than 120 countries, we drive innovation to improve the way the world works and lives.We focus equally on employees’ development by creating a culture of excellence and offering extensive training programs that support professional growth.To find more about Accenture and how you can use and improve your skills visit our careers website http://accenture.ro/cariere and like our Facebook pages https://www.facebook.com/accentureinromania and https://www.facebook.com/Accenture.Industrial.Software.Solutions.Romania.ContextThe mission of this team is to maintain and develop new tactical tools dedicated to post-processing of capital market transactions. The Excel VBA / Access tools will support the business with automation of back office processes, automating business dashboards, etc.Responsibilities•    Designing, coding and testing software modules that meet design specifications•    Maintaining, tuning and repairing applications in order to keep them performing according to technical and functional specifications; performing preventive maintenance activities; providing user support•    Document the deliverables (technical specifications)•    Support the User Acceptance Testing•    Perform regular reportingThe developments will be realized in VBA in Excel 2007 and Access + SQL 2002/2007Ideal profile•    VBA programming skills in Excel and Access•    SQL skills•    Project: the classic phases of a project (V model) knowledge•    Ability to analyze and formalize needs•    Responsiveness, availability, ability to move quickly from one topic to another•    Verbal and written communication skills, listening skills•    English languageNice to have•    Financial knowledge and related back-office business in investment banking•    French languageOur offer:•\tPermanent employment contract.•\tAttractive benefits package: meal vouchers, public transportation, medical services, private pension, life insurance, gym (optional);•\tChallenging job in a professional and multinational environment.•\tOpportunity to gain skills, knowledge and experience, together with highly marketable specialists.•\tOpportunity to work with Global TOP Clients on large projects.•\tDynamic, international working environmentYou have a great opportunity to join Technology Solutions part of Accenture and become part of the global leader! \n\n\n", "title": "VBA Developer", "company_url": "http://www.bestjobs.ro/firme/accenture/13535269/5", "career_level": "Middle, Senior", "company": "Accenture", "locations": "\nBucharest Romania Bd. Preciziei nr. 24 Westgate Park Cladirea H1 Etaj 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-vba-developer/201369/5"}