{"body": "\n\n\n\nThe MissionData is a game-changer. It’s all around us. Implementing a uniform approach as to how we manage data throughout the bank allows us to enhance the customer experience, lower IT operational costs, and swiftly and correctly report to external regulators. Data management can help our customers and our organization unlock new potential and realize our shared vision of becoming a next generation digital bank. Your Day-to-DayContributing to strategy and development of large scale Business Intelligence solutions:Interacting with international business stakeholders to gather requirements and to set priorities and expectationsDevelop department goals which support corporate objectives. Direct the assignment of projects and distribution of workload to support the achievement of goalsManage the research of technical solutions to meet strategic business objectivesDevelop and create business intelligence solutions Keep up to date with the latest industry standards and trends in the area of business intelligence in order to determine improvements to application solutionsDaily management of a new formed team of Microsoft BI Developers located in Bucharest. Provide vision and direction as well as continuous coaching and mentoring by clarifying job responsibilities, setting performance expectations through the establishment of goals and job competencies, identifying skill gaps, creating development plans and evaluating performance.Occasional travelling to Amsterdam, Netherlands, might be required.What you bring to the teamExperience in business intelligenceExperience in a technical management roleExperience with Microsoft SQLThorough understanding of Agile – Scrum methodology and Project Management principlesEmbraces and drives cultural changes through continuous improvement & learningAdvanced ability to build relationships with business and technical partners to improve customer service and continuously improve project deliveryHighly self-motivated and directed, can direct othersExperience working in a team-oriented, collaborative environment.Why ING ING is a frontrunner in the transformation of banking and a company that puts technology at its heart.Our mission it to empower people to stay a step ahead in life and in business and provide products services that make our customers’ life easier.What enables us to deliver best banking experience is Technology mastered by best IT specialists in the market.Hence, with up to 9,000 IT professionals worldwide, we are constantly striving for innovation, using not only top-notch technologies but also the latest methodologies in software development. In  addition to developing products and services aimed at offering best client experience, the IT experience at ING Romania goes beyond local borders. Therefore, in recognition of the high standards of IT engineers in Romania, in 2014, ING opened a Center of Excellence that develops banking software solutions for several countries in Europe.The IT community in ING Romania gathers more than 300 IT specialists and it’s expanding fast.If we caught your eye, let’s chat and see how we can build the bank of the future together! \n\n\n", "title": "Microsoft BI Team Leader", "company_url": "http://www.bestjobs.ro/firme/ing-bank-romania/36692/1", "career_level": "Senior", "company": "ING Bank Romania", "locations": "\nTipografilor, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-microsoft-bi-team-leader/749344/1"}