{"body": "\n\n\n\nWe are Steve Madden's Customer Service Team and have been in Romania for the past 10 years. If you would like to take the opportunity to come work for us, please keep in mind the following requirements: The job is in English, therefore proficient verbal and written communication skills in English are a must. Customer Care orientation and excellent customer service ethic.Conflict resolution skills.Initiative and creativity.Good computer skills.Ability to work in a team and individually with minimal supervision.Previous Customer Service experience would be a strong advantage.The Customer Service Representative's responsibilities are:Answer customer questions via phone, live chat and e-mail regarding product details and availability, prices, current/past promotions, delivery times and the status of orders in general, ensuring that inquiries are dealt promptly and accurately according to the internal company policy and procedures.Assist potential customers that contact us with inquiries regarding our products and are looking to place orders.Our operations are conducted in two shifts: 9am to 5pm US&Canada EST (16pm-00am RO) and 5pm to 10pm US&Canada EST (00am-05am RO). We are also required to work in the weekend however, in that situation employees will benefit 2 consecutive days off during the week. We are working on a weekly rotation between shifts. Shift exchanges with colleagues are allowed as well. Overtime is possible when our work volume requires it and is paid.We offer:Entry level salary is 1600 RON - wired to your debit card once a month, no later than the 25th of each month, for the previous month. Opportunity to receive a salary raise may be taken after 3 months from employment. Opportunity of personal development within an International Company - we only promote from within our company, we do not hire on higher positions.Two weeks paid training package where you are presented the company policy and procedures according to which you will be assisting our customers. At the end of the training session you will be evaluated.Monthly special bonuses based on individual performanceAnnual performance based bonusesDue to working after US time zone, we cover transport expenses. We refund cab money twice a month. You are required to keep the cab invoices and present them back to us. If you own a personal car, we may refund you gas money based on distance traveled from your home to our headquarters.We have a strong relationship with Medlife and provide our employees membership cards that cover basic medical services. \n\n\n", "title": "Steve Madden - Customer Service Representative", "company_url": "http://www.bestjobs.ro/firme/steve-madden-romania-tr-it-team/11630700/1", "career_level": "Entry, Middle", "company": "Steve Madden Romania - TR IT TEAM", "locations": "\nStrada Barbu Urleanu nr. 20, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-steve-madden-customer-service-representative/737550/1"}