{"body": "\n\n\n\nTuplex Romania este o companie multinationala, lider european in domeniul distributiei de materiale pentru productie publicitara, constructii si industrie ( www.tuplex.pl/ www.tuplex.ro )\n\r\nAngajarile se fac in:\r\n- Popesti Leordeni, jud. Ilfov (sediul central Tuplex Romania) - preferam colegi cu domiciliul in sector 3,4,5 sau chiar din Popesti Leordeni\r\n- Cluj Napoca, Parc Logistic ROXER, Calea Baciului nr. 1-3 (filiala Cluj Tuplex Romania)\r\n- Timisoara, Parc Logistic Eurorent, Strada Polona nr. 2 (filiala Timisoara Tuplex Romania)\n\r\nCERINTE POST:\r\n- cunoasterea limbii romane la un nivel avansat;\r\n- minim studii medii finalizate;\r\n- cunostinte solide de operare PC: WORD, EXCEL, Outlook;\r\n- capacitatea de a acumula rapid cunostinte aprofundate despre produse, piata, concurenta, politici comerciale, proceduri;\r\n- experienta in vanzari B2B;\r\n- experienta in vanzari pe teren;\r\n- experienta in vanzari de materiale de constructii sau materiale destinate productiei/ prelucrarii de orice tip reprezinta avantaj.\n\r\nCARACTERISTICI PERSONALE:\r\n- persoana comunicativa, sociabila, serioasa si responsabila;\r\n- persoana dedicata activitatii pe care o desfasoara, orientata catre rezultate si clienti.\n\r\nDESCRIEREA POSTULUI:\r\n- promovarea constanta si consecventa a produselor comercializate de Tuplex;\r\n- activitate de vanzari pe teren;\r\n- gestionarea clientilor activi si dezvoltarea activa a portofoliului de clienti din zona arondata\r\n- acordarea de suport tehnic clientilor\r\n- negocierea preturilor, conditiilor de livrare, modalitatilor si termenelor de plata, respectand politica comerciala Tuplex;\r\n- indeplinirea obiectivelor de vanzari.\n\r\nAVANTAJE:\r\n- oportunitatea de a lucra si a se dezvolta intr-o echipa tanara de profesionisti;\r\n- reale sanse de colaborare pe termen lung;\r\n- contract de munca legal, din prima zi, cu taxele platite la zi;\r\n- salariu fix, bonuri de masa si bonusuri de performanta.\n\n\r\nVa rugam sa trimiteti CV-ul Dumneavoastra la adresa de mail info@tuplex.ro, mentionand pozitia si filiala (Bucuresti, Cluj sau Timisoara) pentru care aplicati, salariul minim solicitat, precum si disponibilitatea de angajare. \n\n\n", "title": "REPREZENTANT ZONAL (Bucuresti,  Cluj si Timisoara)", "company_url": "http://www.bestjobs.ro/firme/tuplex-plastic-romania/137394/1", "career_level": "Middle, Senior", "company": "Tuplex Plastic Romania", "locations": "\nBucurești, Municipiul București, România;Cluj-Napoca, Județul Cluj, România;Pavel Ceamur 14, Popești-Leordeni, Județul Ilfov, România;Strada Polona 2, Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-reprezentant-zonal-bucuresti-cluj-si-timisoara/752178/1"}