{"body": "\n\n\n\nVino la noi sa practici medicina asa cum ai sperat in prima zi!Începe planificarea relocarii tale in  Marea Britanie de azi!  Stim ca vrei conditii mai bune la locul de munca si stim ca vrei sa fii respectat pentru efortul pe care il depui. Noi respectam oamenii care s-au pregatit intens pentru a ajuta alti oameni sa duca o viata sanatoasa. Noi iti oferim acum oportunitatea sa iti arati adevaratul potential si sa fii rasplatit cu un venit la adevaratele standarde europene. Cei peste 70 de colegi romani angajati deja te asteapta in Scotia sa te alaturi echipei! La Meallmore vei putea sa iti pui in practica pregatirea folosindu-te de echipamente de ultima generatie reusind astfel sa inveti mai multe intr-un ritm mai accelerat devenind si mai bun pe zi ce trece. Sa nu uitam ca vei avea posibilitatea sa cunosti si sa te integrezi intr-o alta cultura plina oameni mult mai prietenosi, respectuosi si mai civilizati. Meallmore a devenit optiunea numarul 1 pentru asistentii care doresc sa se relocheze in Marea Britanie si care planuiesc sa isi aduca si familiile in cel mai scurt timp posibil.Vrei sa iti povesteasca altii care au facut deja acest pas inaintea ta?Vrei șansa de a vorbi cu potențialii tăi colegi noi, astfel încât acestia să vă povesteasca experiența lor în Marea Britanie?Va rugam sa ne contactati pentru a va da detaliile lor!Ei vor reveni în România pentru a recruta asistenti medicali generalisti pe 22 și 23 februarie 2016. Dacă planificati sa aplicati pentru un loc de munca acum PCQ și Meallmore va ajuta să începeți inregistrarea la NMC(Ordinul Asistentilor din Marea Britanie) din acest an, pentru a evita testarea de engleză care se introduce din ianuarie 2016 și vom plăti pentru fiecare candidat potrivit taxa de aplicare la NMC de £ 110!Despre angajatorAceastă companie are deja în jur de 70 de asistenți medicali romani. Clientul nostru este unul dintre cei mai respectati furnizori din Marea Britanie de asistență medicală și de ingrijire in centre rezidentiale. Avand centre de ingrijire in intreaga Scotie,acesta este specializat în îngrijirea persoanelor vârstnice cu o gama larga de afectiuni medicale, inclusiv demență.Oferta noastra:\tZborul catre UK este asigurat de Meallmore. Evident, cu bagajele facute fara sa iti faci probleme ce ar trebui sa lasi acasa. Ai 2 bagaje incluse(unul de mana si altul de cala ), dar nu in ultimul rand, va fi cineva care sa te primeasca la aeroport.\tSalariul pentru asistentii medicali inregistrati la NMC: 13 £/ ora (aprox. 18.5 euro/ora), respectiv 18 £ (aprox. 25.5 euro/ora) pentru orele suplimentare\tSalariul asistenti medicalii in curs de inregistrare: 8.50 £/ ora (aprox. 12 euro/ora), respectiv 11.67 £/ora pentru orele suplimentare\tPosibilitatea accesarii unui avans din salariu de cel mult 1.000 £ pentru ca tu sa te poti instala si acomoda.\tIn plus fata de cele mentionate, mai primesti inca 300 £ bonus la sosire ca prima de instalare pentru a te ajuta sa acoperi din costurile initiale de relocare. Cazarea va fi pregatita in localitate, ori intr-o locuita la comun sau o unitate de cazare cu mic dejun inclus pentru care Meallmore iti va asigura costurile in valoare de maxim 300 £, ramanand ca doar eventualele diferente sa fie achitate pe cont propriu.\tClinica Meallmore te va ajuta sa iti gasesti casa potrivita pentru tine! Vei primi toate recomandarile si sugestiile despre ce ar fi indicat sa ai in vedere cand vei cauta o locuinta, pentru ca tu sa nu platesti o chirie supraevaluata.\tDaca chiria initala(din perioada de acomodare) e mai ieftina, diferenta nu o vei pierde! Aceasta plus inca 100 de lire se vor aduna pentru prima plata a chiriei. Te poti folosi de aceasta suma inclusiv pentru plata utilitatilor si intretinerii care vor intra in responsabilitatea ta.\tTe vom ajuta sa iti deschizi un cont bancar si in obtinerea numarului de asigurare sociala (NINO).Beneficii:Meallmore iti va oferi urmatoarele beneficii:•\tPlata corecta a orelor suplimentare prestate•\tPosibilitati reale de dezvoltare•\tConcediu medical platit•\tContributia la sistemul de pensii •\tUniforma personalizata Meallmore gratuita•\tTraininguri gratuite- Instruirea personalului pentru ultilizarea PC și eLearning cu ‘Learn Pro“•\tMediu de lucru excelentAplica acum CV-ul tau pentru a stabili un interviu! \n\n\n", "title": "Alatura-te asistentilor medicali de la Meallmore!", "company_url": "http://www.bestjobs.ro/firme/pcq-recruitment/13534939/1", "career_level": "Entry, Middle", "company": "PCQ Recruitment", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-alatura-te-asistentilor-medicali-de-la-meallmore/742086/1"}