{"body": "\n\n\n\nDespre rolul de Corporate Account Manager:\n\n\n\r\nGestioneaza relatii tip win/win cu clientii corporate ( conturi medii si mari) cu scopul de a creste vanzarile Vodafone si profitabilitatea clientilor din baza alocata.\r\nDobandeste cota de piata si aduce valoare prin depasirea targeturilor, sustinuta de  asigurarera unei experiente bazata pe incredere si parteneriat.\r\nResponsabilitati principale:\n\n\n\r\nVinde solutii de afaceri potrivite conditiilor de piata si obiectivelor companiei prin abordare de vanzare consultativa  \r\nProtejeaza/creste profitabilitatea clientilor prin angajamente pe termen lung in cadrul segmentului deservit\r\nIdentifica oportunitati de business prin invatarea si intelegerea nevoilor de comunicatii si de afaceri ale clientilor\r\nDezvolta si mentine relatii win/win cu clientii existenti cu scopul de a creste valoarea portofoliului\r\nAtinge targeturile individuale comunicate, adresand intreaga gama de produse/servicii in cadrul conturilor alocate\r\nGenereaza lead-uri de vanzari altor segmente/arii/canale de vanzare din companie\r\nCunoasterea excelenta a produselor si serviciilor companiei, business management, propunerilor financiare, produselor , serviciilor si portifoliilor competitorilor directi.\r\nAbilitatea de a dezvolta un caz solid contra competitorilor bazat pe produsele si serviciile, pe valoarea serviciilor,  politica de pret si diferentiatorii Vodafone\r\nActualizarea permanenta si respectand standardele de calitate a informatiilor din Sales Force Automation/Wallet Sizing/Forecast\r\nCrearea unui plan de business pentru fiecare cont/client\r\nPrintr-o raportare acurata si continua ajuta in planificarea strategiei de produse, preturi si servicii\n\r\nConditii de munca:\n\n\n\r\nFoloseste masina de companie\r\nCalatoreste intensiv in zonele: Timis, Arad si Hunedoara\r\nRolul este locat in Timisoara\r\nActivitate de birou\n\n\r\nEducatie si alte certificari:\n\n\r\nDiploma universitara\r\nPermis de conducere categoria B\n\n\r\nExperienta profesionala:\n\r\n1-2 ani experienta in vanzari\r\nAbilitati de PC: Word, Excel, Power Point, E-mail\r\nFluenta in vorbirea limbii engleze\r\nPreferabil 1 an experienta in vanzari directe, B2B ( experienta IT&C si Telecom, reprezinta un avantaj)\n \n\n\n", "title": "Corporate Account Manager", "company_url": "http://www.bestjobs.ro/firme/vodafone-romania/2935259/2", "career_level": "Senior", "company": "Vodafone Romania", "locations": "\nHunedoara, Județul Hunedoara, România;Arad, Județul Arad, România;Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-corporate-account-manager/230720/2"}