{"body": "\n\n\n\nWe are a comprehensive global provider of cloud-based Human Capital Management (HCM) solutions that unite HR, payroll, talent, time, tax and benefits administration, and a leader in business outsourcing services, analytics and compliance expertise. Our unmatched experience, deep insights, and cutting-edge technology have transformed human resources from a back-office administrative function to a strategic business advantage. ADP serves more than 610,000 clients around the world today and helps organizations of all types and sizes unlock their business potential. For 60 years, we’ve led the way in defining the future of business outsourcing solutions and we remain one of the world’s most innovative, diverse and admired companies to work for today.Job DescriptionMain tasks:•\tAdvising clients, installation, maintenance and adaptation of PAISY installations•\tRecording and clarification of customers' requests•\tConfiguration of time and wage types for our software customers•\tImplementation of HR projects PAISY environment, e.g. Optimization of wage Types and time frame stylesTechnical requirements: •\tExperience in PAISY parameterization desirable•\tData processing experience•\tKnowledge of Payroll and Time Management•\tKnowledge of the German income tax, social Security and labor •\tExperience in the parameterization of wage and salary systems•\tKnowledge of HR processes in a company•\tGeneral IT know-how; technical understanding•\tHuman Resources KnowledgePersonal requirements: •\tPersuasive personality•\tAssertiveness•\tCustomer oriented•\tDetermined and independent working•\tExcellent communication skills, able to work under pressure•\tLanguage –German and EnglishEducation:•\tUniversity degree. \n\n\n", "title": "German Functional Consultant", "company_url": "http://www.bestjobs.ro/firme/automatic-data-processing-adp-romania-srl/13796474/5", "career_level": "Middle", "company": "Automatic Data Processing (ADP) Romania SRL", "locations": "\nGeorge Constantinescu 3, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-german-functional-consultant/206214/5"}