{"body": "\n\n\n\nJob PurposePerform Finance review and Balance Sheet reviews as per the annual plan of Outstation Finance & Risk Management (OF&RM) by either desktop reviews or visiting the station in partnership with Regional Finance Manager Outstations (RFMO) and evaluate the sufficiency of the internal controls to cover financial risks at the station.Validate quality, accuracy and timeliness of financial accounting, reporting and efficient usage of accounting and operational systems by identifying areas of risk and recommending controls where necessary. Ensure stations are in compliance with Group policies and procedures as well as the procedures laid down in Finance & Accounting Procedures Manual for Overseas Stations (FAMOVS).  KEY ACCOUNTABILITIES Independently conduct finance review of stations to confirm transactions are recorded correctly in the financial system and reflect a true and fair view. Highlight deviations from the agreed finance procedures while performing the process review during the station visit.Perform the required analysis (using appropriate analysis and data mining techniques) to ensure that the finance review conducted is of high quality. Suggest and implement improvements to the review procedures so that they are performed effectively and efficiently.Ensure finance review observations are validated and discussed with the Finance staff/ Finance & Administration Manager (FAM) before the findings and observations are reported in the finance review draft.Provide a Finance review draft report in the agreed format capturing the findings in an appropriate manner. Maintain the Finance review documentation for retrieval when required as well as demonstrate a comprehensive coverage of the finance activity reviewed.Ensure that all issues identified by the finance review are captured in the relevant Issue Repository (AIMS).Support stations with follow-up of recommendations and other improvement actions and projects.Monitor and follow up with local management on all issues identified in the finance review and obtain appropriate evidence for/of closing of recommendations in a timely fashionProvide support to Manager Financein active corporate projects. Qualifications & Experience Finance Accounting: 3+ YearsDegree or Honours (12+3 or equivalent) : In Commerce, Finance or Accounting Qualified accountants (CPA, CIMA, CA) - preferred.Experience in a Finance or AuditKnowledge/skills: Sound Accounting knowledge Adequate ERP skills (Oracle / SAP or similar) to perform the role efficientlySalary and BenefitsWe offer an attractive tax-free salary, paid in Dirhams, the local currency of the UAE, besides generous travel benefits normally associated with an airline.About Emirates Tomorrow you could be living in dynamic Dubai and earning a tax-free salary with global benefits. Starting with two aircraft and a handful of enthusiastic people, we have grown at a phenomenal rate. We are now one of the fastest growing airlines in the world, flying to over 125 destinations across 6 continents. We are looking for people to join our global family of over 55,000 people from 160 nationalities across a diverse range of disciplines. If you are a high performer, seeking unparalleled career opportunities, join the Emirates team and help us create the future of travel To ApplyPlease submit your application before 24-Feb-16, 23:59 GMT + 4 hours \n\n\n", "title": "Finance Officer (Outstations Review)", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nDubai, Dubai, Emiratele Arabe Unite\n", "url": "http://www.bestjobs.ro/locuri-de-munca-finance-officer-outstations-review/749850/1"}