{"body": "\n\n\n\nDESCRIEREA COMPANIEI:Telekom Romania este un brand de telecomunicaţii nou și dinamic, care oferă servicii de telecomunicaţii fixe şi mobile complete, inovatoare, simplificate și personalizate pentru o comunitate vastă de clienți, cu peste 10 de milioane de contracte de servicii. Prin cei doi operatori, Telekom Romania Mobile Communications şi Telekom Romania Communications, Telekom Romania oferă servicii integrate de telecomunicații, astfel încât clienţii să beneficieze de o experiență completă şi plină de satisfacţii: servicii de voce și date mobile 3G și 4G mobile, telefonie fixă tradițională, internet de mare viteză și televiziune pe mai multe tehnologii, inclusiv IPTV precum și conținut de înaltă calitate și exclusivități. Pentru clienţii business, noul brand este promisiunea unor soluții IT & C la cheie, care să sprijine companiile să devină mai competitive și mai agile. Telekom Romania este un brand din familia Deutsche Telekom, prezent în 51 de țări de pe cinci continente, cu peste  143 de milioane de clienţi de telefonie mobilă, 31 de milioane de clienţi de servicii fixe şi peste 17 milioane de linii de broadband din întreaga lume. Brandul este prezent pe piaţa românească din 2014, după rebranding-ul comun al COSMOTE România și Romtelecom. RESPONSABILITATI: Contacteaza clienţii sau este contactat de catre clientii care îşi declară intenţia de a rezilia contractul de servicii încheiat cu Telekom, respectând termenul si procedurile de lucru în vigoare; Pregăteşte informaţiile necesare procesului de negociere, în vederea reţinerii clienţilor, utilizând bazele de date disponibile în sistemele IT; Identifică motivul solicitării de reziliere. Găseşte soluţii pentru a păstra clienţii în reţea, potrivite atat pentru clienti cat si pentru Companie; Identifică corect solicitările clienţilor, oferă răspunsuri profesioniste, se implică activ în rezolvarea problemelor semnalate de clienţi, păstrând un ton amabil şi profesionist pe toată durata apelului; Promovează produsele şi serviciile Telekom în toate apelurile eligibile; Foloseşte corect aplicaţiile cu care lucrează, astfel încât să ofere informaţii complete despre solicitarile clientilor. CERINTELE POSTULUI:Educatie: Studii medii/superioareExperienta: In vanzari, retentie si relatii cu clientii Cunostinte PC: MS Office Competente / Abilitati:  Abilităţi de negociere şi vânzare, Abilităţi de comunicare, Abilităţi de ascultare activa, Abilitatea şi disponibilitatea de a lucra în echipă, Capacitatea de a crea un climat de lucru în echipă, Autocontrol, Stabilitate emoţională, Capacitatea de a se adapta cu uşurinţă la schimbările metodelor de lucru Capacitate de a lucra în condiţii de stres; Dedicare pentru rezolvarea solicitarilor clienţilor; Nume de contact: HR Shared Service CenterAdresa de e-mail: myhr_recruitment@telekom.com \n\n\n", "title": "Specialist servicii clienti Save Desk Mobil", "company_url": "http://www.bestjobs.ro/firme/telekom-romania-mobile-communications-s-a/2066958/1", "career_level": "Entry, Middle", "company": "Telekom Romania Mobile Communications S.A.", "locations": "\nUnirii, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-specialist-servicii-clienti-save-desk-mobil/747881/1"}