{"body": "\n\n\n\nThe JAVA Software Developer is responsible for Software Development of the Telecom Expense Management Web application based on Java and Oracle PL-SQL.\t\t\t\t\t\t\t\r\nThe ideal candidate should have a strong aptitude for comprehending technical concepts and seek out answers even when given minimal instruction and guidance. Excellent interpersonal and communication skills are required.\r\nUse Agile/Scrum project management methodologyWork close with QA providing quality code Develop new code and also perform code refactoringContinuous upgrading the software technologies used, keeping the product up to date.Stepping up when necessary to help team with other duties and responsibilities\r\nIn the development process , Asentinel uses the latest technologies/frameworks, this being an advantage for candidates wishing to improve/develop their programming skills:-Agile SCRUM-Spring Framework (Spring JDBC, Spring MVC, Spring REST, Spring WS) -Junit, EasyMock or other testing/mocking frameworks-End to end automated testing using Selenium, Continuous Integration (Jenkins),Security Testing, etc.The company will ensure adequate training if the selected candidate doesn’t have advanced knowledge of the above.\r\nRequirements-Minimum 1 year JAVA and SQL programming experience-Spring Tool Suite knowledge -Experience in working with web application servers (example: Tomcat, WebSphere, Weblogic, etc.)-Good command of the English language\r\nThe following are considered advantages:-Knowledge of Linux commands, shell scripting-Working with Oracle database, PL/SQL\r\nEducation-Bachelor degree in Computer Science, Mathematics and Informatics, Economic Informatics or equivalent\r\nAdvantages and Benefits-Permanent Labor Contract, motivating salary based on the skills and performance.-Medical Insurance-The opportunity to develop a career within a stable multinational environment;-Access to the last software technologies. Training and certification supported by Asentinel.-American standard, non-stressful working conditions, excellent green environment, free parking space-American management and company culture-Monthly Parties, Halloween Party, Christmas Party \n\n\n", "title": "JAVA Software Developer (Middle)", "company_url": "http://www.bestjobs.ro/firme/asentinel-international-srl/2845216/2", "career_level": "Entry, Middle", "company": "Asentinel International SRL", "locations": "\nStrada Aleea Lacul Morii Nr.3 Sector 6, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-java-software-developer-middle/230025/2"}