{"body": "\n\n\n\nCompany description:Bring your talent and passion to Accenture – sharpen your skills, build an extraordinary career and play a key role in creating solutions that transform organizations and communities around the world.We are a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. We work at the intersection of business and technology to help clients improve their performance and create sustainable value. With more than 358,000 people serving clients in more than 120 countries, we drive innovation to improve the way the world works and lives.We focus equally on employees’ development by creating a culture of excellence and offering extensive training programs that support professional growth.To find more about Accenture and how you can use and improve your skills visit our careers website http://accenture.ro/cariere and like our Facebook pages https://www.facebook.com/accentureinromania and https://www.facebook.com/Accenture.Industrial.Software.Solutions.Romania.Responsibilities•\tParticipate in ABAP development of the business solutions based on functional and technical requirements•\tPerform complex ABAP programming, testing and debugging functions related to the implementation of SAP modules•\tClosely communicate with functional teams  and solution designers•\tUnderstand the requirements from provided functional designs and transform these requirements into the technical designs•\tContribute to increased productivity and motivation of the team•\tBuild professional relationships with clients, management and team members to ensure delivery of proposed solutionsIdeal profile•\tOver 5 years of experience of SAP ABAP development•\tDegree in computer science, engineering science or equal education•\tBasic knowledge of ERP systems in any kind of industry•\tPassion about ABAP development•\tTeam player attitude•\tFluency in English•\tUniversity degreeWould be an advantage to have: •\tExperience in full life cycle implementation projects  Interviu Online:1.  What are your salary expectations for this position? \n\n\n", "title": "Senior SAP ABAP Developer", "company_url": "http://www.bestjobs.ro/firme/accenture/13535269/5", "career_level": "Entry, Middle", "company": "Accenture", "locations": "\nBucharest Romania Bd. Preciziei nr. 24 Westgate Park Cladirea H1 Etaj 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-sap-abap-developer/200984/5"}