{"body": "\n\n\n\nDo you want to fundamentally improve the everyday workflow of your fellow software developers? Builder Tools is looking for passionate software developers for a new team that will transform the developer experience at Amazon. On this team you will play a role in the definition, vision, design, roadmap and development of a new product from the beginning to the end. You will:\r\n· work with internal developers as your core customers\r\n· iterate and test new ideas\r\n· learn and use core AWS technologies to design and then build available and scalable backend web services and customer-facing APIs\r\n· create from the ground up a new, world-class user experience\r\n· deeply understand and integrate with a variety of cloud-enabled developer tools across the spectrum of the software development lifecycle\n\r\nA successful candidate must have a strong passion for technology and a high quality bar for his work, be a quick learner and have good understanding of software engineering and computer science fundamentals. He will be working along side with senior AWS engineers, and learning opportunities will abound. Expect start-up culture of quick iterations and significant freedom.\r\n· Bachelor’s Degree in Computer Science or related field\r\n· Equivalent experience to a Bachelor's degree based on 3 years of work experience for every 1 year of education\r\n· Computer Science fundamentals in object-oriented design\r\n· Computer Science fundamentals in data structures\r\n· Computer Science fundamentals in algorithm design, problem solving, and complexity analysis\r\n· Proficiency in, at least, one OOP programming language such as C, C++, Java\n\r\n· Experience with building highly scalable services that must also ensure high availability.\r\n· Demonstrate that they can proactively and continually improve their level of knowledge about Amazon’s business and relevant technologies, and use this knowledge to deliver high quality, accurate software deliverables.\r\n· Clear, professional communication skills able to contribute to team discussions, knowing when to contribute, when to listen, and when to ask questions.\r\n· Experience developing in a Linux environment\r\n· Software Engineering fundamentals in modularity, performance and scalability\r\n· Proficiency in one modern dynamic programming language such as Ruby, Python, JavaScript\n \n\n\n", "title": "Software Development Engineer – Builder Tools", "company_url": "http://www.bestjobs.ro/firme/amazon-development-center-romania-srl/1339336/1", "career_level": "Middle", "company": "Amazon Development Center (Romania) SRL", "locations": "\nIași, Județul Iași, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-software-development-engineer-builder-tools/752289/1"}