{"body": "\n\n\n\nWe offer an exciting opportunity to join our sales team in the PLM (Product Lifecycle Management) environment. You will find us in a medium sized growing company where you can realize your own potential. Take your chance - you can start with us and give to our customers and prospects the impulse to improve the competitiveness. Your tasks:•    You will develop as PLM-Sales specialist. Here you will be accompanied by a mentor who will help to simplify the onboarding. In a few months of back office, you will learn the projects and sales-related works of CENIT as well as our products and solutions. Afterwards you will start using your experience in the field of sales.•    For our customers you will analyze their business processes and future challenges in order to extrapolate potential for improvements and concrete solutions. Besides the sustainability, the development of our sales activities stays at the forefront of your activity.•    You will provide to our clients consulting services with regard to our software portfolio and you will prepare for them a coherent overall package containing software products from the market leader Dassault Systèmes (CATIA, ENOVIA, SMARTEAM), our services (CAD training, design methodology, knowledge-based design, special industry solutions, custom software) as well as complementary third-party solutions.•    For all sales and marketing activities, you will be supported by an experienced Presales Consulting Team.Your profile:This position requires graduated technical studies in the field of engineering, computer science engineering, industrial engineering or similar. Basic knowledge of a CAD system (like CATIA V6 / V5 and/or Enovia), which ideally you have gotten to know through work experience, internship or a practical thesis in the daily implementation, is necessary.If you have a good amount of curiosity and an inquiring mind, if you enjoy traveling and if you are communicative and responsive to new challenges, we look forward to your application.Requirements:•    Background studies in technical engineer field.•    Passionate by new and modern engineering technology and by manufacturing processes. •    Experience in sales area, special consultancy and offering technical solutions.•    Negotiation skills, analytical thinking and spontaneous behavior. •    Advanced English skills.•    Willingness to travel; having a driving license, B category, would ease doing the trips. Interested?We offer attractive, long-term perspectives as well as professional training and support. The work style in our company is characterized by short information paths, a flat hierarchy and a simple, cooperative interaction with each other. We look forward to receiving your application including starting date and salary expectations.Company description:CENIT SRL is the Romanian subsidiary of the German organization CENIT AG, a financially sound, medium-sized IT company which employs approximately 700 people worldwide. As a consulting and software specialist for the optimization of business processes, CENIT is active in the fields of Product Lifecycle Management (PLM), Enterprise Information Management (EIM), Business Intelligence (BI) and Application Management Services (AMS) since 1988. We work for world renowned companies from the sectors automotive, aerospace, mechanical engineering, tool and mold construction, financial services, retail and consumer goods.  \n\n\n", "title": "Technical Sales Engineer", "company_url": "http://www.bestjobs.ro/firme/s-c-cenit-s-r-l/3150305/2", "career_level": "Entry, Middle", "company": "S.C. CENIT S.R.L.", "locations": "\nPiața Montreal 10, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-technical-sales-engineer/230323/2"}