{"body": "\n\n\n\nBuilt in Timișoara by people with a sense of purpose: cloud solutions for massive business communities & a business app store for payment transactions, invoices and other documents processing plus data-driven, value-added apps. Agile inspires us.As a Java Software Developer, will be responsible to:Participate in analyzing and estimating new products and projects;Develop applications based on user stories;Prepare demo sessions for the stakeholders;Work closely with QA to build qualitative web applications;Help in preparing documentation for the software developed.You will need to:Be proactive, take ownership, focus on problem solving more than problem finding and think about continuous improvement - always find new tools and methods for yourself and your colleagues;Be an excellent communicator - English is our group’s common language, so excellent spoken and written English is a must;Value team effort, be a team player and deliver autonomously with little supervision;Always be curious about new technologies and development methods and share them with your colleagues.What you bring:We love technology, so we have quite a big technological stack - knowledge of and/or experience with the following topics is relevant:At least 3 years of relevant work experience in software development with an emphasis on Java EE/Spring;Ruby, Ruby on Rails, Python, PHP or other OOP languages also relevant;Markup: XML, XSD, XSLT, HTML, CSSWeb UI: JSTL, Servlets, JavaScript;Development environment: Jenkins, IntelliJ or Eclipse, Maven, JUnit, Jboss;Hibernate, Liquibase, Play! Framework, DropwizardFamiliar with tools like Jenkins, Vagrant etc.;Web Services (SOAP, REST);Databases: SQL, NoSQL flavors;Version Control: Git, SVN, CVS;Test driven design, automated testing and continuous integration.Bottom line: Of course you get an excellent salary, benefits, great office in a perfect location, including working from home. But we’re about more than that:Challenges: we’re transforming the world of  business communications and transactions;Responsibility and autonomy: making a difference in decision-making means you take on responsibility, not just tasks;Common purpose: you grow by learning new skills and we benefit from your knowledge. We all work together towards one goal.Active involvement in a variety of local IT & Agile communities and local, national and international events;Active organizers of learning, social and fun events.You can send your application to hr-romania@unifiedpost.com. We’ll treat it with care. \n\n\n", "title": "Java Software Developer", "company_url": "http://www.bestjobs.ro/firme/unifiedpost-romania/12684175/1", "career_level": "Middle, Senior", "company": "UnifiedPost România", "locations": "\nCoriolan Brediceanu nr.10, Timișoara, Județul Timiș, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-java-software-developer/747048/1"}