{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. \n\r\nHoneywell HPS (Honeywell process solutions) is looking for an experienced Procurement Specialist to join the Romanian office in Bucharest!\n\n\n\r\nIf you have:\r\n-Bachelors Degree with a minimum of 2 to 4 years of experience in any industry with specialization in the Procurement / Supply Chain domain\r\n-Proven track of excellent relationship management skills since the job involves interacting with suppliers\r\n-Demonstrated hands on experience in dealing with multiple ERPs, as this role will involve extensive use of Oracle / SAP and other legacy systems. You should also have experience in dealing with web based tools and should be comfortable with working on various reporting tools which are web based\r\n-Knowledge of MRP Systems & procedures (is highly desirable)\r\n-Excellent PC skills and are well versed with Microsoft Products like Excel, Word and Access. ----The job may also require using various applications (Microsoft or others)\r\n-Excellent interpersonal and communication skills with all levels of employees and management\r\n-Exposure to Six Sigma & Project Management (is also desirable)\r\n-Strong inclination towards automation (will be an added advantage)\r\n-English and German fluency, both written and verbal\n\n\r\nThen, be our next German speaker procurement specialist!\n\n\r\nThe main accountability for this role involves supporting the tactical and strategic sourcing activities that are in compliance with Honeywell sub-business groups and Honeywell sourcing processes. \r\nThis position reports to the Site Leader in Bucharest.\n\r\nYour key responsibilities will be to:\r\n•\tSupport Commodity Managers / Global Commodity Team Leads on sourcing projects, PO (purchase order) Automation, Vendor Rationalization and new vendor set-ups / maintenance\r\n•\tWork with multiple organizational agencies to address & resolve supplier invoices on payment holds by prioritizing on aged holds and high value invoices\r\n•\tSmall buy negotiations and catalog maintenance\r\n•\tReceive supplier acknowledgements and ensure the PO due dates are accurately maintained in the ERP system. Run the Supplier Open PO report for key suppliers as required\r\n•\tPush-in and pull-out Purchase Order due dates, as needed, to prevent production disruptions, delays, downtime and excess inventory\r\n•\tResolve Supplier delivery problems (late and early receipts) in an pro-active and timely manner and escalate for assistance as required\r\n•\tAssist and support management of Inactive, Obsolete and Excess inventories\r\n•\tMaintain data integrity in SAP (Purchase Info records Vendor Master Data etc)\r\n•\tCommunicate technical specifications to suppliers and manage price and lead-time changes in system\r\n•\tWork closely with engineering on issuing Purchase orders\r\n•\tInvoice cleansing in System\r\n•\tManage RFQ’s (requests for quotations)\r\n•\tSupport supplier quality problem resolution\r\n•\tReturn defective material to suppliers and issue PO’s to replace non-confirming material.\n\n\r\nWant to learn more? Visit:\r\nOur career website: www.careersathoneywell.com\r\nChannel: http://www.youtube.com/watch?v=CcMf_TFS0kA\r\nhttp://www.youtube.com/watch?v=Tj8Jr2USl4M\n\r\nHoneywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status. - See more at: \r\nhttp://www.careersathoneywell.com/en/jobsearch/jobdescription.aspx?languageid=1&jobid=00281661#sthash.O3RzNOF7.dpuf\n \n\n\n", "title": "Procurement specialist German Speaker (00306388)", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Middle", "company": "Honeywell", "locations": "\nStrada George Constantinescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-procurement-specialist-german-speaker-00306388/750706/1"}