{"body": "\n\n\n\nHow about working on great technology and feeling comfortable and positive at the same time? Join a handful of passionate people who love working together for a complex but rewarding mission: Create great technology, made in Romania and used all around the world.As a Software QA Engineer, you will:•\tbe responsible for the quality of the software we provide to our customers•  \tdesign test case scenarios and test plans•\tdevelop and work with suites of automated tests (e.g. Selenium) and also execute manual tests (on Linux/Windows OS) •\treport defects well documented for the development team•\tverify, troubleshoot and reproduce issues•\thave to interact with the development team and the support team•\twork with defect tracking and test cases management tools•\tmanage test releases and test environmentsYou:•\tbelieve you are passionate about software and IT. Because we are•\tare already the proud owner of a decent IT knowledge base that you are interested to enhance and grow•\twould be willing to use this knowledge base in software testing - such as TCP/IP protocols, client server concepts, web technologies•\twould see no problem doing that on various operating systems  - Linux/Unix, Windows•\tconsider yourself meticulous and rigorous•\thave good communication skills•\twould search the cause of a software problem with the full curiosity and determination of an intellectual challengeIt would be even nicer if you:•\tsuccessfully survived to software testing exposure •\tHave previously used (not only by accident) at least one scripting language (Perl, Python, Ruby, shell scripting)•\tAlready know that Selenium means also something else than a chemical element•\tReally do read, understand and speak English•\tWere involved before in software engineering processes & best practices (unit testing, system & integration testing)What’s in it for you:•\tBe part of the evolution of one of the few “Made in Romania” software apps. The Axigen Mail Server is used by customers worldwide for the last 10 years•\tA pleasant and friendly work environment, with now no more than 25 people, in which expertise is shared openly and where everybody strives for knowledge and self-improvement•\tYou will use the latest technologies in development and automated testing•\tYou will came across a lot of coaching and learning opportunities•\tAttractive remuneration package, lunch discount tickets, Happy Friday Cookies•\tPrivate health insurance and performance bonuses•\tA flexible program ensuring a fair work/life balance•\tLimited transportation hassle: we’re 8 min walking from the subway station, and you won’t go mad if you try to park nearby.About AxigenFounded as GECAD Technologies in 2001, the company became Axigen Messaging in 2012. Separated from the GECAD Group by 2014, the company with 100% Romanian ownership focuses ever since on the development & distribution of innovative messaging solutions. Since its first release in 2005, Axigen was continuously improved and extended, with the next major version – Axigen X – being expected in 2016. The software is currently supported on both Windows and most Linux flavors (RPM distributions, Debian, FreeBSD, Solaris).Axigen’s customer base is extremely diverse, covering from telcos, ISPs, private companies, and banks to academic and government institutions worldwide. \n\n\n", "title": "Software QA Engineer", "company_url": "http://www.bestjobs.ro/firme/axigen-messaging/13615175/5", "career_level": "Entry", "company": "Axigen Messaging", "locations": "\nStr. Nicolae Caramfil, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-qa-engineer/201856/5"}