{"body": "\n\n\n\nVeeam Software helps organizations safeguard their investment in VMware virtual infrastructure by providing innovative systems management software designed to reduce costs, increase productivity and mitigate risk. Veeam is rapidly expanding its presence around the world. The company's EMEA headquarters is in Baar, Switzerland with regional offices located throughout EMEA, USA and APAC.\n\r\nVeeam Software is all about the people. The best people drive the best technologies to help IT organizations all over the world. Do you have a passion for new, cutting-edge technologies? We are always looking for talented, creative and motivated people to join our team. Take a look at the available positions below and apply today.\n\r\nResponsibilities\n\r\nLead role for all marketing activities and results in SEE\r\nDevelop and drive marketing strategy and tactics in SEE\r\nMarketing planning and budgeting\r\nPR activities\r\nEnsure effective planning and running of the joint activities with partners, providing partners with any required information or marketing tools\r\nCoordinating and managing trade shows and events\r\nCollecting reports, tracking results\r\nManage the remote team of marketing specialists\n\r\nQualifications\n\r\nHigher Education\r\nAt least  5 years’ experience of work in similar area market \r\nFluent English\r\nGood understanding of the marketing mix\r\nStrong proven team management experience in a similar fast-paced, highly-driven workplace\r\nBe a natural Marketing leader\r\nProven analytical skills at management level\r\nProject management skills\r\nTeam Player – must focus on winning as a team rather than individually\r\nFull Driving License and the ability to travel\r\nActive and reliable, self-starter\n\r\nWe offer\n\r\nModern, energetic working environment.\r\nOpportunities for professional growth and promotion\r\nSalary ranges depending on skills and expertise \n\n\n", "title": "MARKETING MANAGER SOUTHERN EASTERN EUROPE", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Middle, Senior", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-marketing-manager-southern-eastern-europe/208238/5"}