{"body": "\n\n\n\nCerinte\n\r\n• Licentiat in studii economice;\r\n• Minim 3 ani experienta intr-o pozitie similara;\r\n• Limba engleza - avansat;\r\n• Foarte buna cunoastere a utilizarii pachetului Microsoft Office;\r\n• Abilitati de comunicare si relationare;\r\n• Gandire analitica si economica.\n\n\r\nSarcini\n\r\n• Evidenta furnizorilor/clientilor, decontari, evidenta solduri, circularizari interne si externe utilizand fisiere excel de evidenta si de reconciliere;\r\n• Validarea facturilor emise de furnizori versus contracte de colaborare;\r\n• Efectueaza inregistrari contabile pentru urmatoarele tranzactii:\r\n-\tOperatiuni bancare conform extraselor de cont;\r\n-\tOpex&Capex conform documentelor justificative: facturilor furnizori, deconturilor de cheltuieli, rapoarte operationale ;\r\n-\tInregistrare venituri conform facturilor emise\r\n-\tTratament inchidere de luna: calcul accrual cheltuieli/venituri, verificari  specifice;\r\n• Efectuarea de reconcilieri contabile;\r\n• Intocmirea de diverse rapoarte financiare, utilizand date extrase din sistemul contabil si rapoarte operationale;\r\n• Intocmire declaratiilor fiscale si a raportarilor statistice.\n\r\nDescriere Companie\r\nCetelem IFN SA este lider pe piaţa creditelor de consum din România şi face parte din grupul financiar francez BNP Paribas Personal Finance. Cetelem, ca marcă comercială a grupului BNP Paribas Personal Finance, este considerat numarul 1 pe piaţa creditului de consum în Europa iarprezenţa în 30 de ţări ale lumii cu peste 29.000 de angajaţi certificăexperienţa şi forţa ce însoţesc activitatea sa. Din 1999 Cetelem (BNP Paribas Personal Finance) este membru al BNP Paribas şi se constituie într-o filială specializată în creditul de consum. Apariţia Cetelem pe piaţa românească a avut loc în mai 2005 prin preluarea societăţii Credisson International SRL.Postul presupune vanzarea produselor financiare si consilierea clientilor si a potentialilor clienti in vederea incheierii contractelor de credit de consum.\n\n  Interviu Online:1.  Care sunt asteptarile d-voastra salariale? \n\n\n", "title": "Economist Senior", "company_url": "http://www.bestjobs.ro/firme/cetelem-ifn-sa/9594431/5", "career_level": "Senior", "company": "CETELEM IFN SA", "locations": "\nStrada Clucerului nr.78-80 Sector 1 Bucuresti, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-economist-senior/207832/5"}