{"body": "\n\n\n\nEricsson Overview Ericsson is a world-leading provider of telecommunications equipment and services to mobile and fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, and more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business and society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people and society to help shape a more sustainable world.We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture and an innovative and engaging environment where employees enhance their potential everyday. Our employees live our vision, core values and guiding principles. They share a passion to win and a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning and growth opportunities that allow you to acquire the knowledge and skills necessary to reach your career goals.Job Summary This Job Role is responsible for the coordination, management and execution of proactive and reactive maintenance activities that require a higher level of support that the one offered by the 1st Level Operations. This shall ensure that the services provided to customers are continuously available and performing to Service Level Agreement (SLA) performance levels.Responsibilities & Tasks • 2nd Level Assurance Support Activities • 2nd Level Incident Management Position Qualifications• In depth knowledge of operation and troubleshooting of routers, switches, firewalls, proxy servers, VPN concentrators, traffic analyzers• In depth knowledge of operation and troubleshooting of switching and routing protocols• Experience with equipment manufactured by Cisco, Huawei, Redback, Juniper, Extreme, Nokia and others• Good communication skills. • Ability to work independently and in a team environment • Ability to work under strong pressure related to scale of business impact • Bachelor/Master of science in Electrical Engineering, Computer Information Systems, or equivalent with minimum of 3 to 5 years of work experience.• Cisco/Juniper certifications is a plus Required Skills• Excellent communication skills in both English and Romanian, ability to interact with customers and internal stakeholders, and provide technical solutions.• Solid understanding of service provider networks, internet network architecture and routing products.• Understanding of Routing Protocols like BGP, OSPF, ISIS. • Good experience with the following solutions under MPLS protocol (Layer 3 VPN and Layer 2 VPN/VPLS) is a must.• Cisco (CCNP , CCNP SP (old CCIP certification)) /Juniper (JNCIA , JNCIP-SP) certifications is a plus• Understanding of Broad-band Remote Access Protocols like PPP, DHCP, AAA, RADIUS and Mobile Networks like GGSN/SGSN/LTE, CPG is a plus.• Good knowledge of Ericsson SE and Huawei NE40 architecture and platform is a plus.• Should have excellent network and routing product debugging skills. • Should have ability to provide rapid root-cause analysis and solution for various customer IP related issues.• Scripting skills in Perl and/or Expect is a definitely plus. • Presentation & Communication Skills. Knowledge sharing. Working with People • Bachelor Degree in Computer Science or related discipline required. \n\n\n", "title": "2nd level Operations Core IP Engineer", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-2nd-level-operations-core-ip-engineer/747242/1"}