{"body": "\n\n\n\nName of the position: Financial SpecialistSuperior job: Finance Manager  Purpose of the rolePerform all accounting and related tasks at the Timișoara office in close cooperation with the  Finance Manager.This includes, but is not limited to:continuous management of financial systems, budgets and daily activitiesprepare, support, liaise internal and external audits, liaise with auditorsdeal with any financial irregularities as they arise, detect and prevent fraudperform accounting activities: vendor and sales invoices, banks, employee payments including salaries, fixed assets registration etc.report all financial related issues timely to the Finance Managerbe involved in the budgeting process, P&L analyses, monitor and analyze the actuals vs. the budget of all activitiesprepare financial management reports, including financial planning and forecasting, timely internal and external reporting, (e.g. Budgets, Reports for HQ, Invoices, Salaries, etc.)coordinate financial reporting with the respective consultant company prepare financial statements, including monthly and annual accountsperform month end closings, general ledger account analysis and reconciliationsmonitor and control the VAT refund by the respective consultant companyadvise on tax and treasury issues, make sure the Company has enough funds to be able to make timely payments to vendors and employeesprepare accurate cash flow forecastsrespond in a timely and accurate manner to ad-hoc requests related to accounting (e.g. reports, explanations) of HQcommunicate with local authorities and partners with respect to the finance organization (banks, external auditor, Government)be up to date related to local rules and laws related to the finance organizationnegotiate terms with finance related suppliersmanage, support and supervise junior colleaguestake part in process improvement projects and create efficiency in the daily workReportingThe accountant reports hierarchical to the MD. Functional reporting to FM. The functional reporting prevails in task assignment and overseeing. Results and ActivitiesReporting and communication: Timely preparation, communication to internal and external authorities and partnersManagement support: support management with the financial information and activities neededRelationship of the jobInternal: To the employees, management, finance colleagues of other entitiesExternal: To the service and product suppliers, e.g. accounting, taxation consultants, auditors and clientsExperience and QualificationsUniversity degree or equivalent in the field of finance and accountingMS Office (Word, Excel, Outlook)fluent Englishaccounting knowledgeOther Personal Characteristicsexcellent communication skillsflexibility in workinggood business sense \n\n\n", "title": "Financial Specialist", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nTimișoara, Județul Timiș, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-financial-specialist/747512/1"}