{"body": "\n\n\n\nUsed by half of the Fortune 100, Netop solutions include secure remote access, live chat and classroom management, helping companies to offer better customer service, to reduce support costs and meet the security and compliance standards. In Education domain, Netop is the world leader for classroom management software, helping teachers in more than 90 countries, in the whole process of teaching.\r\nWe are also one of the first companies in Romania that have started to use the Scrum Agile methodology.\n\r\nIf you share our passion for Agile and you want to work in a flexible and friendly environment, keep reading.\r\nYou will have an active role not only in designing and implementing our next successful products but also the chance to contribute in improving the tooling, infrastructure and processes so that they best fit an evolutionary path.\r\nIf you have a keen eye for details and never stop questioning yourself “why?” and “how can I make this better?” then you are the colleague we are looking for. Nevertheless a good sense of humor will help.\n\r\nAs a Developer you will:\r\n- Transform functional and technical stories into design and implementation modules for existing client and server applications\r\n- Design and implement new applications to increase the value provided by Netop products portfolio to its customers and partners\r\n- Review and repair legacy code with a code modularity mindset\r\n- Create unit-tests and functional test applications for greater code coverage \r\n- Conduct training for new programming staff if required by the company \n\r\nWhat you will need to succeed:\r\n- Relevant experience with C++ programming under Windows: Windows API/SDK, MFC, ATL/COM, WDK (as a plus);\r\n- Relevant experience with multithreading and design patterns;\r\n- Relevant development experience of at least 5 years\r\n- Non-technical skills:\r\nGood conceptual and analytical thinking, good capacity of synthesis\r\nInnovation and engagement\r\nGood time management\r\nGood overview of the activities\r\nGood written and verbal communication skills in English and Romanian\r\nAbility to cooperate and work productively in a team\r\nAbility to adapt and learn new things quickly\r\nProactive and positive attitude\r\nOrientation to action and self-improvement\r\nAbility to work independently and responsibly\n\r\nWe offer:\r\n- An attractive remuneration package\r\n- Medical subscription that can be extended to family\r\n- Meal tickets\r\n- Programs for personal development (trainings, certifications, attending to certain events etc.)\r\n- Special events for employees (teambuilding, theme parties, contests etc.)\r\n- An enthusiastic and successful team of professional\r\n- Relaxed working environment\n\r\nPlease submit your resume along with the cover letter, mentioning the technologies that you’re the most qualified for at ro-hr@netop.com.\n\r\nNetop – great achievements come in special places! \n\n\n", "title": "C++ Windows Developer", "company_url": "http://www.bestjobs.ro/firme/netop-tech/2488080/1", "career_level": "Senior", "company": "Netop Tech", "locations": "\nCalea Vitan 6-6A etaj 4 Phoenix Tower sector 3, București, Municipiul București, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-c-windows-developer/751495/1"}