{"body": "\n\n\n\nJOB DESCRIPTION: We are looking for an experienced, forward thinking Websphere Message Broker Developer with a passion for growth and innovation. As a Websphere Message Broker Developer you will provide design direction to messaging bus to ensure high-quality solutions and consistent deliverables to support the Customer’s architecture using web services deployed in Enterprise Service Business layer and providing analysis and implementation support for customized systems. Responsibilities include, but are not limited to, the following: - Participates in all design sessions and provides technical leadership (including technical decisions, technology recommendations, defining standards, leading POCs, and mentoring developers); - Work with project sponsors during the project planning phase to understand the requirements in order to define an solution design that meets the business and technical needs; - Define the strategy and overall vision for solutions. Provide complete solution designs that consider cost, performance, scalability, reusability, and extensibility; - Document application requirements, technical specifications, use-cases, workflow processes;- Occasionally conduct research and Proofs of Concept on new technologies and applications; - Mentor and develop skills of other members of the team. Collaborate with other development and integration team members to ensure Service-Oriented Architecture (SOA) Integration technologies are properly implemented and maintainedMANDATORY SKILLS: Confirmed experience in integrations for Message broker V7 or up, and MQ V7 ; Confirmed experience with XML, web services and messaging knowledge ; Confirmed experience with Websphere suite of Service-Oriented Architecture (SOA) integration middleware.BENEFITS:• Motivating salary• Good working environment• Medical insurance• Annual team building• Trainings and certifications \n\n\n", "title": "Message Broker Developer", "company_url": "http://www.bestjobs.ro/firme/incrys/701643/1", "career_level": "Middle", "company": "InCrys", "locations": "\nStrada Anastasie Panu nr. 50 et. 1 sector 3  Bucuresti, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-message-broker-developer/749026/1"}