{"body": "\n\n\n\nSpecialist Credit AnalystReview, analyze, and monitor specific company financial information and other external factors such as industry data, country economic and political risk to determine external customer credit worthiness. Manage and maintain internal and external customer relationships. Monitor the extension of credit to manage HP's portfolio risk.Scope/complexity of work:Perform common and complex credit tasks related to accounts & deals of diverse complexity and scope.Work on projects of different complexity.Independence:Exercise independent judgment within generally defined policies and practices to identify and select a solution.Have the ability to handle most unique situations.May seek advice in order to make decisions on very complex credit tasks.Leadership:May act as a team or project leader providing guidance to more junior level staff and facilitating team decision making process Knowledge requirements:Have strong knowledge acquired through previous experience, demonstrating developed subject matter knowledge as to analyze customer's financial condition.Have the ability to review contract terms & conditions.QualificationsEducation and Experience RequiredFirst level university degree with a focus on Finance and Accounting2 - 4 years of experience in financial analysis and the use of credit risk mitigation tools.Knowledge and Skills Strong written and verbal communication, negotiation, and conflict resolution skills.Fluency in English and Spanish or FrenchStrong understanding of credit and collection processes, financial concepts and risk mitigation tools.Attention to details. Good understanding of HP´s business units and the different products/services provided.Strong prioritization skills.Good relationship building skills.Strong influencing skills.Good knowledge of economic and political environment.Basic project management skills.Basic understanding of HP's order management process.Fluent in English, other common languages as needed based on portfolio.  \n\n\n", "title": "Credit Specialist", "company_url": "http://www.bestjobs.ro/firme/hpe/14233907/5", "career_level": "Middle", "company": "HPE", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-credit-specialist/206533/5"}