{"body": "\n\n\n\nEricsson Overview Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world. Job summary – Logistics / SiteWe are looking for an experienced team leader with a proven track record of managing a team and then growing it by designing and following a clear strategy. Experience of logistics is essential and if you have performed a role such as Logistics Manager in the transport industry then we’d be interested in meeting you. You will be able to clearly demonstrate your people management skills by giving clear examples. You must be comfortable managing specialists who might be more senior than yourself. You will have established and managed relationships with buyers and be financially aware. You will be able to network effectively in a large, matrix management environment. Hardware sourcing experience would be ideal but we will also consider people from other sourcing environments where they can also clearly demonstrate excellent team leading and people management skills. You would also need to ensure that all deliverables were delivered accurately and on-time.In this position, you would be responsible for the management of the strategic sourcing managers in your team. You would strengthen Ericsson’s competitive position by maximizing the sourcing value, proactively managing business risks & contributing to the creation of value for the customer. JOB RESPONSIBILITIES:Reports to Head of Network Sourcing Romania Responsible for building and leading supplier management functional area which includes supplier performance tracking, governance program and contracts lifecycle management for selected suppliers/contracts, issue and escalation management. Oversee the enforcement and monitoring of supplier contract compliance, including supplier code of conduct audits and adherence. Manage employees on team, develop employee competence, provide leadership. Drive and ensure consistency of Supplier Management processes across clusters within Sourcing department Ensure new global SRM (Supplier Relationship Model) is implemented Support and influence the Global Sourcing Process Board Identify and run improvement projects Implement Predictive Reporting metrics to be used by the business Balance the team’s mixture of Tactical and Strategic efforts appropriately Manage supplier development and recognition programs. Develop training materials and provide training when needed. Develop and maintain collaborative working relationship with key stakeholder such as Category Management, R&D etc. Generally stay up to date by engaging in continuing education in area of responsibility. Work in line with Ericsson’s corporate values of Professionalism, Perseverance and Respect. Develop group and individual goals in line with overall objectives, track progress. Work with teams to identify synergies and efficiencies, drive and implement changes where appropriate. Provide reports and presentations to multiple levels of management in organization. Provide direction and guidance in line with overall goals and objectives. Mentor, guide and actively develop people in order to tap into and allow talent to add value in the most effective way. Actively participate in, contribute to and support the team’s vision, mission, goals, directives and strategy. CORE/CRITICAL COMPETENCIES:Proven leadership behavior competencies in areas of People, Organization and Thought Leadership. Ability to lead, motivate and inspire teams. Knowledge of Network Sourcing business and ideally also Network Products. Experience with dispute resolution and settlement negotiations Understand and apply Ericsson’s overall strategy and goals. Pro-actively strive to improve leadership skills by regular self-assessment, attending training, seeking mentorship and generally being open to feedback. Knowledge and experience with best in class sourcing processes and supplier management. General competence in interpreting contract language and understand contract structures. Ability to assess risk and gaps. Ability to handle delicate situations and act with professionalism and diplomacy. Capable of making decisions, exercising good judgment and seeking appropriate levels of approval as required. Excellent communication skills. MINIMUM EDUCATION AND EXPERIENCE REQUIREMENTS:Sourcing and supplier management experience preferred. Experience in large corporate environment helpful. Graduate level or professional degree preferred or other acceptable combination of education and experience. Professional license or certification preferred. \n\n\n", "title": "Team Leader Strategic Sourcing Logistic/Site/EMS/T", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-team-leader-strategic-sourcing-logistic-site-ems-t/748210/1"}