{"body": "\n\n\n\nVeeam's Global Campaigns and Digital Marketing team is now hiring. We are utilizing innovative digital and offline marketing techniques for engagement creation, contextual marketing and lifecycle marketing to connect with our audience in 70+ countries. For this new role we are looking for an Online Advertisement Specialist who will run and scale the sponsored media activities on major IT websites and platforms.\n\r\nThis person will help to maintain relationships with key media publishers worldwide and ensure successful execution of marketing campaigns and targets. This person will work together with other teams on content planning, - creation and – promotion. This includes building web banners, landing pages or mini portals for campaign execution.\n\r\nResponsibilities\n\r\nCoordinate paid online media contracts execution\r\nWork with external vendors on promotions optimization\r\nWeb banner and landing page creation\r\nWork together with other teams on content creation, promotion and planning\r\nTargeted banner placements in relevant sources and categories\r\nKeep promotion materials (whitepapers, videos, banners) up to date\r\nUpload leads to CRM and track quality\r\nSubmit invoices to accounting system and control timely payment\r\nA/B testing\r\nAnalyze results, measure success, and drive optimization\n\r\nQualifications\n\r\nBachelor’s degree in marketing, economics or equivalent\r\nPassion for technology and IT industry\r\nUniversity graduate with relevant internships or junior with 1 to 2 years of experience\r\nExceptional English communication skills: must be able to articulate a clear, persuasive argument orally and in writing\r\nStrong analytical, planning and forecasting skills\r\nUnderstanding of online media buying & media planning platforms (e.g. Google) a plus\r\nMust be team player with ability to multi-task and thrive under pressure to meet deadlines in fast-paced environment \n\n\n", "title": "Online Media Specialist", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Entry", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-online-media-specialist/208235/5"}