{"body": "\n\n\n\nSociété Générale European Business Services délivre de la valeur ajoutée pour le Groupe Société Générale au niveau des services de finance,comptabilité, ressources humaines et IT pour toutes les entités de l'Europe.\n\r\nSAFE est en charge du management du risque opérationnel dans le cadre du groupeSociété Générale, étant aussi en charge du cadre de la surveillancepermanente. \n\r\nSAFE c’est une Direction responsable du domaine anti-fraude et de tous lessujets relatifs à la sécurité informatique. Parmi ses missions on peutmentionner celle qui concerne la configuration et le management des accès auxoutils informatiques utilisés dans le cadre de GBIS – la banqued’investissement du groupe Société Générale.\n\r\nVotre rôle :\r\nLe périmètre fonctionnel couvre le management des risques de la Sécurité Informatique.\r\nVotre mission principale va consister en :\r\n-      Participation à la configuration de l’outil qui gère les applications de business, cet outil étant configuré de manière en sorte que les collaborateurs reçoivent des accès informatiques conformes à leurs postes ;-      La gestion des demandes d’allocation des nouveaux accès aux outils informatiques de la part des utilisateurs finaux et la mise à jour des listes des applications utilisées par les collaborateurs ;-     La demande des validations nécessairies auprès des departments concerés dans le cas où celles-ci sont necessairies ;-     La mise à jour continue du système des allocation et de configuration des accès informatiques ;-      Participation regulière dans l’activité de reporting concernant des indicateurs spécifiques.\r\nProfile requis :\n\r\n- Etudes supérieures : Université, ASE, Polytechnique ;\r\n- Profile technique et aisance dans la manipulation des données techniques ;\r\n- Français au niveau avancé (parlé et écrit) ;\r\n- Administration Windows ;\r\n- Notions des services Active Directory, Exchange Server,Outlook ;\r\n- Connaissances des sujets IAM (Identity and Access Management) ;\r\n- Connaissances des notions de la sécurité infrormatique.\n\r\nProfile personnel : \n\r\n- Attitude proactive et réactive ;\r\n- Esprit d’équipe ;\r\n- Personne autonome ;\r\n- Bonne capacité d’analyse et de synthèse.\n\r\nNotre offre : \n\r\n- Conditions salariales motivantes\r\n- Contrat à durée indéterminée\r\n- Plan de carrière (professionnel et financier)\r\n- Formations spécifiques\r\n- Assurance médicale\r\n- Tickets restaurant\r\n- Environnement de travail professionnel et agréable\r\n- L’opportunité de rejoindre une équipe multiculturelle.\n \n\n\n", "title": "IAM Analyste - avec Français", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-iam-analyste-avec-fran-ais/752043/1"}