{"body": "\n\n\n\nAdecco Permannet Placement cauta pentru clientul sau, o companie multinationala din domeniul cosmeticelor, un Junior Marketing , pentru Bucuresti.  \n\r\nASSISTANT MARKETING\n\r\nObiectivul job-ului\n\r\nTraducerea si interpretarea textelor din limba franceza in limba romana si din limba romana in limba franceza, pentru asigurarea bunei desfasurari a activitatii in cadrul Departamentului Marketing/Companiei.\n\r\nProfilul job-ului\r\n•\tEfectueaza traduceri scrise si orale din limba franceza in limba romana si din limba romana in limba franceza in acord cu solicitarile primite din partea managementului companiei, cat si a directivelor primite din partea companiei;\r\n•\tRedacteaza si traduce materiale scrise, corespondenta, rapoarte;\r\n•\tTine evidenta traducerilor;\r\n•\tVerifica și corecteaza etichetele de produse ale companiei;\r\n•\tVerifica materialele pentru campaniile de marketing ale companiei;\r\n•\tAlte activitati de marketing.\n\r\nProfilul candidatului\r\n•\tFacultate de limbi straine (specializare limba franceza) sau profil economic (marketing) cu predare in limba franceza/Master limbi straine sau profil economic.\r\n•\tAtestat de traducator autorizat pentru limba franceza – de preferat\r\n•\tLimba franceza – nivel avansat\r\n•\tLimba engleza – nivel avansat\r\n•\tCreativitate\r\n•\tAtentie concentrata si distributiva\r\n•\tCapacitatea de a invata\r\n•\tCapacitate de lucru independent/echipa\r\n•\tMultitasking\r\n•\tInţelegerea textelor\r\n•\tOriginalitate\n\r\nBeneficii\r\n•\tSalariu atractiv + alte beneficii \r\n•\tMediu de lucru dinamic \n\n\r\nToti candidatii care corespund cerintelor de mai sus sunt invitati sa aplice online. Vor fi contactati doar candidatii care corespund profilului in maxim 2 saptamani.\n\r\nPentru mai multe oportunitati de angajare, va rugam vizitati website-ul  www.adecco.ro si inregistrati-va cv-ul in vaza de date pentru a fi elegibil pentru actuale sau viitoare posturi deschise. Toate aplicatiile sunt strict confidentiale.\n \n\n\n", "title": "Marketing Junior", "company_url": "http://www.bestjobs.ro/firme/adecco-romania/2426806/1", "career_level": "Entry, Middle", "company": "ADECCO ROMANIA", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-marketing-junior/752428/1"}