{"body": "\n\n\n\nDescriere job:Societate germana, recrutam asistenti medicali generalisti pentru camine de batrani din Germania.Caminele de batrani germane ofera contracte de munca pe perioada nedeterminata conform legislatiei germane.Daca aveati in plan sa emigrati in Germania, acum aveti cea mai buna ocazie.NU SOLICITAM CUNOSTIINTE DE LIMBA GERMANA, dar este de la sine inteles ca aceasta va trebui invatata in cel mai scurt timp.IN CAZUL IN CARE CUNOSTIINTELE DVS DE LIMBA GERMANA SUNT SUFICIENTE, OCUPAREA POSTULUI DORIT IN GERMANIA SE VA FACE MULT MAI REPEDE.Oferta:Descrierea locului de munca:Veti lucra incepand din prima zi ca asistent medical cu recunoasterea profesionala germana si atentie: nu ca ajutor de asistent sau infirmier cum propun toti ceilalti concurenti ai nostri.ACEST LUCRU NU IL OFERA LA ORA ACEASTA NICI O ALTA FIRMA IN ROMANIA.Salariul de inceput variaza intre 1500-2000 euro Netto.Sunt platite de catre angajator pensia in contul de pensii precum si asigurarea medicala.Programul de lucru implica in medie intre 38 si 40 de ore pe saptamina.Sistemul propus de noi este urmatorul:Societatea noastra prefinanteaza pe o perioada de trei luni cursurile dvs intensive de limba germana in Romania,precum si obtinerea dreptului dvs. de libera practica in Germania.Vi se garanteaza un post intr-un camin de batrani din Germania, in conditiile de mai sus.NU PERCEPEM COMISION!!Oferim numai contracte de munca pe perioada nedeterminata.Daca sunteti decisi sa schimbati ceva in acest sens, in viata dumneavoastra, va rugam sa ne trimiteti prinEmail(    office@makro-mikro.eu  ) urmatoarele documente: - un CV-DIPLOMA DVS DE ASISTENT MEDICAL SCANATA FATA/VERSO- datele dumneavoastra unde va putem contacta (numar de telefon sau adresa postala)Contact:in Germania:Firma: Makro-Mikro Consulting GmbH Adresa:Erna-Scheffler-Str. 1a51103 KölnTel. 0049-151-46758176in Romania:0747 035 577 sau 0747 127 000Email: office@makro-mikro.euhttps://www.facebook.com/MakroMikroConsulting/http://www.makro-mikro.eu/ \n\n\n", "title": "Asistent/a medical/a in Germania", "company_url": "http://www.bestjobs.ro/firme/makro-mikro-consulting-gmbh/13029520/1", "career_level": "Entry, Middle", "company": "Makro-Mikro Consulting GmbH", "locations": "\nAlba Iulia, Județul Alba, România;Bacău, Județul Bacău, România;Brăila, Județul Brăila, România;Brașov, Județul Brașov, România;București, Municipiul București, România;Buzău, Județul Buzău, România;Cluj-Napoca, Județul Cluj, România;Constanța, Județul Constanța, România;Craiova, Județul Dolj, România;Hunedoara, Județul Hunedoara, România;Iași, Județul Iași, România;Pitești, Județul Argeș, România;Satu Mare, Județul Suceava, România;Sibiu, Județul Sibiu, România;Suceava, Județul Suceava, România;Timișoara, Județul Timiș, România;Vaslui, Județul Vaslui, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-asistent-a-medical-a-in-germania/748927/1"}