{"body": "\n\n\n\nDo you have a demonstrated track record of outperforming sales targets in enterprise software sales? Are you persistent and aggressive in finding and closing on new deals? Do you love to work directly with clients? If you are able to combine a personable demeanor with a strong work ethic and an openness to being coached, and if you have a passion for customer success — then this is the role for you. Job DescriptionThe Portfolio Account Executive (PAE) is a critically important sales role at a dynamic and growing enterprise software company that is helping its customers transform the way they do business. As the German Portfolio Account Executive, you will connect our installed base of German Silver Accounts (representing our largest customer segment by revenue) to our innovative enterprise software solutions, enabling these customers to create transformative experiences for their end consumers.  Acting as the “owner” of 40 – 50 Silver Accounts in Germany, the PAE acts autonomously to achieve sales objectives within an entrepreneurial, meritocratic company environment that values and rewards performance and fosters meaningful professional growth. Aurea helps companies like Bank of America, Johnson & Johnson, Disney, British Airways, and IBM perform at higher levels by deploying best-in-class enterprise software solutions created from a growing stable of enterprise software products — growing through both core investment in innovation as well as through aggressive acquisition. Ignite delivers its work through a group of goal-oriented, self-starting individuals. The company's innovative, virtual, global work environment along with its aggressive growth through acquisition allow these associates to experience an extraordinary level of professional freedom, growth and development. Qualifications and Key Selection CriteriaSkills and experienceDemonstrated track record of outperforming sales targets in enterprise software sales as the 1 absolutely responsible sales person for building and closing the deal – so we’re searching for a sales account manager, not a business development or team manager 10 years of experience in sales, with recent experience in software sales, preferably in a fast-paced, dynamic, entrepreneurial environment where you are required to understand different software solutions and be able to do overview product presentations yourself without technical/Presales support Passion for working directly with clients — you’re the one who is responsible for winning or losing a deal Strong evidence of personal motivation and success, either in academic, athletic or other pursuits Ability to quickly form trust-based relationships and to expand upon these relationships Highly disciplined and able to work independently to achieve/exceed sales goals in a virtual company environment Experienced and knowledgeable in CRM and Customer Experience Experience working with integration technology Excellent English communication (written and oral) Bachelor’s degree from top university (technical degree a major plus)  Residence in Germany or Austria is a mustBehavioral characteristics  Impeccable customer focus and professionalism Highly motivated, high energy, “must-win” approach, combined with a passion for learning and professional growth Exceptional bandwidth and ability to strive in a dynamic, fast-paced environment Team player with strong skills in the areas of leadership, motivation, relationship building, and communications Coachable professional who values constructive feedback to attain alignment  The compensation plan for this role is $125,000 base + $125,000 commission. To qualify, please provide a resume/CV demonstrating the required experience and skills.  From there, to help us find the top 1% of talent, there will be an online skills examination and then a series of interviews, which help us truly evaluate your talent vs your peers. Are you up for the challenge? \n\n\n\n\n", "title": "Silver Portfolio Account Executive - $250, 000/year", "company_url": "http://www.bestjobs.ro/firme/crossover/13728342/5", "career_level": "Executive", "company": "Crossover", "languages": " Engleza, Germana", "url": "http://www.bestjobs.ro/locuri-de-munca-silver-portfolio-account-executive-250-000-year/198927/5"}