{"body": "\n\n\n\nWho we are:youngculture is part of NSM Engineering, a Swiss software engineering group of companies, which provides near-shore services for aviation, banking, telecommunications, eCommerce, and many other sectors. Its headquarters are in Zurich and it has its own near-shore development centers in Serbia (Belgrade, Nis) and Romania (Iasi).With the approach to deliver high quality software solutions for our international customers we are looking for motivated new colleagues, to join our growing Iasi software engineering team in the following position:Senior Magento Developer / Team LeadYou will contribute with your experience and skills as part of a distributed team (Romania – Switzerland) engaged in the development of an enterprise B2B ecommerce solution, the Magento EE multi-site store of our client, a market world leader from medical industry.You will be working in an agile SCRUM environment.Who we are looking for:The ideal candidate hired into this position should have the following key skills /experience:•\tBachelor or higher degree in computer science (or equivalent)•\t4-5+ years of professional experience in software development using Magento. Previous work in Scrum methodology and distributed development teams would be considered as assets•\tSound experience integrating Magento to other 3rd party software such as Solr, SAP PI/PO, CQ5, MySQL•\tFamiliarity with Magento 2.0 concepts would be considered a big plus•\tExcellent PHP skills•\tVery good understanding of Frontend technologies and frameworks - Less, JQuery, KnockoutJS, Responsive Web Design. Knowledge of RequireJS and/or AngularJS would be considered as assets•\tRelevant experience in CI/CD and related tools (SVN and Git, Atlassian Bamboo)•\tExperience with Atlassian tool suite: Jira, Confluence, Stash•\tModerate administration skills with Linux (RedHat)•\tAbility to interpret and communicate information to the client•\tProven experience in leading and growing development teams•\tDedication and ownership for delivery on time and quality•\tOpen and friendly personality, as well as drive, initiative, problem-solving mindset, excellent interpersonal and team-working skills•\tExcellent verbal and written communication skills in English•\tAvailability for short-term abroad business trips.What we offer:•\tChallenging projects in a highly professional, but also relaxed, collaborative and supportive environment•\tWorking in small and excellent skilled teams•\tOpportunity for long term professional growth within our development center•\tSalaries and conditions which correspond to the high demands•\tModern office space in the city center•\tTravel opportunities to EU countries.Working location:Iasi, RomaniaPlease send your resume to jobs.romania@youngculture.com. While we appreciate everyone’s interest in youngculture’s openings, notice that only selected candidates will be contacted.Your application will be treated strictly confidential. \n\n\n", "title": "Senior Magento Developer / Team Lead", "company_url": "http://www.bestjobs.ro/firme/youngculture/13491628/5", "career_level": "Senior", "company": "youngculture", "locations": "\nPalas, Iași, Județul Iași, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-magento-developer-team-lead/202328/5"}