{"body": "\n\n\n\nVeeam recognizes the new challenges companies across the globe face in enabling the Always-On Business, a business that must operate 24/7/365. To address this, Veeam has pioneered a new market of Availability for the Modern Data Center by helping organizations meet recovery time and point objectives of less than 15 minutes for all applications and data, through a fundamentally new kind of solution that delivers high-speed recovery, data loss avoidance, verified protection, leveraged data and complete visibility. Veeam Availability Suite, which includes Veeam Backup & Replication, leverages virtualization, storage, and cloud technologies that enable the modern data center to help organizations save time, mitigate risks, and dramatically reduce capital and operational costs. \r\nFounded in 2006, Veeam currently has 29,000 ProPartners and more than 135,000 customers worldwide. Veeam’s global headquarters are located in Baar, Switzerland, and the company has offices throughout the world.\r\nVeeam Software is all about the people. The best people drive the best technologies to help IT organizations all over the world. Do you have a passion for new, cutting-edge technologies? We are always looking for talented, creative and motivated people to join our team. Take a look at the available positions below and apply today. In order to be considered for this program, we need some details on the specific of the opportunity that you are requesting a fee for. Veeam sales will contact you after \n\r\nJOB SUMMARY\r\nThe Renewal Representative is responsible for handling renewal sales. \n\r\nDUTIES AND RESPONSIBILITIES\r\n\tMonitors the funnel of expiring agreements, contacts customers anywhere from 30 days to 6 months (depending on product) in advance of expiration, and provides a proposal/quote to the customer for the continuation of their support and products.\r\n\tMonitors proposals/quotes outstanding to customers to ensure that sales are closed.\r\n\tInteracts and collaborates externally with partners and end users and internally with the Veeam sales team.\r\n\tHandles customer inquiries by explaining the provisions and benefits of the proposed plans; up-sells and upgrades products.\r\n\tActively pursues the list of lapsed customers, end users and channel partners to sell reinstated products.\r\n\tTracks proposals/quotes outstanding, orders received, the rate of renewals, and the current forecast for reporting to management.\r\n\tGenerates quotes and assures that contracts contain appropriate terms and conditions for maintenance renewals selected by the customer.\r\n\tAssists in negotiation of contracts or maintenance agreements.\r\nPerforms other duties as assigned. \n\r\nDESIRED SKILLS AND EXPERIENCE\r\n\tExceptional verbal and written communications skills.\r\n\tAbility to work in a semi-autonomous and fast-paced environment; must be a high-energy, motivated self-starter. \r\n\tExperience compiling, querying, analyzing and reporting data.\r\n\tExceptional organizational skills with the proven ability to prioritize and complete multiple tasks to meet deadlines and quotas.\r\n\tAbility to adapt to changes in roles and responsibilities.\r\n\tBachelor’s Degree required (A combination of education and experience will be considered).\r\n\tPrevious sales experience representing a high technology product or service with demonstrated ability to meet or exceed a sales quota (preferable).\r\n\tLanguage requirements:\r\n-\tEnglish and Italian language\n\r\nBENEFITS\r\n•\tModern, energetic working environment\r\n•\tOpportunities for professional growth and promotion\r\n•\tCompetitive salary\n\r\nREPORTING AND ACCOUNTABILITY\r\nThis position reports to the Team Lead, Renewals.  \n\n\r\nVisit our career portal for other exciting job openings!\r\nhttp://careers.veeam.com/\r\nhttp://careers.veeam.com/about/core-values \n\n\n\n\n\n\t\t\t    $(document).ready(function() { \n\t\t\t    var allVideos = $('.job-video-container object, .job-video-container embed, .job-video-container iframe'); \n\t\t\t    var oldWidth = allVideos.width();\n\t\t\t    var oldHeight =  allVideos.height();\n\t\t\t    var aspectRatioOS = oldHeight/oldWidth; \n\t\t\t    allVideos.removeAttr('height').removeAttr('width');\n\t\t\t    function resizeVideoOSJS(){\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%;');\n\t\t\t\tvar widthInit = allVideos.width();\n\t\t\t\tvar heightInit = widthInit * aspectRatioOS;\n\t\t\t\tallVideos.attr('style', 'max-width: 600px; width: 100%; min-height: 220px; height: '+ heightInit +'px;');\n\t\t\t\t//.attr('width',  widthInit).attr('height', allVideos.height())    \n\t\t\t    }\n\t\t\t    resizeVideoOSJS();\n\t\t\t\t    window.onresize = resizeVideoOSJS; \n\t\t\t    });\n\t\t\t\n", "title": "Renewal Representative (English & Italian)", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Entry", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Italiana, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-renewal-representative-english-italian/207994/5"}