{"body": "\n\n\n\nOrange Romania’s IT Business and System Analysis Team is looking for a new colleague.You will grow in our team as part of the IT division which counts more than 100 software development professionals. Our Business/ System analysts constantly meet up to share their experiences from their projects. You will work to find implementation solutions for requirements from Marketing, Sales, Customer Service, Corporate departments. You will have the chance to collaborate with CRM, Billing, Data Warehouse, ERP and Online development teams.The colleagues with whom you will interact are architects, business analysts, project managers, software developers, Ops teams and product owners.Relevant Skills:• Experience of working in an IT team environment• Profound knowledge of methodologies and tools for analysis activities• Professional attitude, excellent communication skills• Excellent English: verbal and writing• Experience in working with business requirements and detailing them into System level Functional Specifications.• Analytical ability to ensure comprehensiveness and detail level articulation in analyzing and specifying of functional details.• Ability to communicate functional level details to solution developers – to support transition, translation and development.• Ability to quickly troubleshoot and establish functional issues in production, solution testing, etc.Responsibilities:- Analyzing requirements for different business divisions (Marketing, Sales, Financial, Supply Chain, Customer Service etc)- Creating functional specifications- Offering support to the development teams (CRM, Billing, Reporting, ERP, Online)- Participating in the testing phases to validate the deliveries before production- Mentoring for the new team membersKey Attributes:• Strong communication and analytic skills• High degree of accuracy and attention to detail• Able to quickly grasp new concepts• Understanding solution architecture and involvment in system design• Open minded, out of the box thinking and eager to discover Orange IT Environment• Team oriented willing to work in a fast paced, multinational environmentExperience and Education• Bachelor’s Degree from an accredited college or university with a concentration in Science or IT related discipline - (or equivalent diploma/work experience)• Proficient written and spoken English• experience as a Business Analyst• background in telecom industry is a plus• Agile Kanban experience is a plusThank you for applying! \n\n\n", "title": "IT Business/ System Analyst", "company_url": "http://www.bestjobs.ro/firme/orange-romania-sa/885505/1", "career_level": "Middle, Senior", "company": "Orange Romania SA", "locations": "\nBulevardul Lascar Catargiu Nr.51-53 sector 1, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-it-business-system-analyst/747973/1"}