{"body": "\n\n\n\nEricsson Overview: Ericsson is a world-leading provider of telecommunications equipment and services to mobile and fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, and more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business and society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people and society to help shape a more sustainable world. We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture and an innovative and engaging environment where employees enhance their potential every day. Our employees live our vision, core values and guiding principles. They share a passion to win and a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning and growth opportunities that allow you to acquire the knowledge and skills necessary to reach your career goals. Job Summary - Strategic Sourcing Manager role: The Strategic Sourcing Manager will be responsible for developing and managing one or more of Ericsson’s regional suppliers and is responsible for ensuring that sourcing and management activities are performed efficiently and effectively and in accordance with contract and alignment with the future direction of that particular category/supplier at Ericsson.We are now seeking a talented and proactive individual who is looking for a new challenge. The successful candidate will have to be result oriented with strong analytical abilities and excellent communication skills.The main areas of responsibility are: • Manage all sourcing aspects of the assigned suppliers/agreements related to Indirect Sourcing• Develop operations and negotiation strategy together with IT stakeholders• Be final escalation point for assigned suppliers• Track internal behavior and drive policy compliance. Reports will be produced for all organizational hierarchies as well as for all Ericsson’s regions.• Address drivers of spending, align spend to business needs and reduce unnecessary spend.• Be the main driver, together with Business Services Sourcing, for designated categories at Ericsson & coordinate all processes & operational improvements.Requested Competence:• Business acumen• Proven ability to drive results in multi-cultural & large corporate environment• Creative, open minded with a strong focus on stakeholder’s requirements• Strong analytical skills• Excellent project management skills• Adequate knowledge of the concept of contract management, laws related to contracts / agreements and applicable legal obligations and arbitration process•A proactive & consultative approach• Experience from a large International corporation is preferable• Team player and networking skills• A thorough and methodical approach to work• Highly developed skills in knowledge sharing by actively contributing knowledge, experiences and skills to create a learning culture• Furthermore, you are business minded and a good communicator with a strong drive. That you work unhindered in English in speech and writing is an absolute requirement, since most of all communication is in EnglishMinimum Qualifications & Experience Requirements: • At least 3 years of relevant experience (contract negotiations)• A first academic degree or equivalent qualification \n\n\n", "title": "Strategic Sourcing Manager - System SW", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle, Senior", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-strategic-sourcing-manager-system-sw/748209/1"}