{"body": "\n\n\n\nHow about working on great technology and feeling comfortable and positive at the same time? Join a handful of passionate people who love working together for a complex but rewarding mission: Create great technology, made in Romania and used all around the world.As a Technical Support Engineer, you will:•\thandle from the office incoming customer requests related to our products (Axigen Email Server and AddOns)•\tinvestigate and solve functional problems •\tunderstand and assimilate new products & technologies•\tconfigure and deploy Axigen Email Server and 3rd party products or AddOns•\tdevelop monitoring & configuration scripts•\tdeal with customer technical requests & requirements•\tpresent and sustain technical solutions to the customer•\tcollaborate with the software and testing teams to ensure efficient bug fixing You:•\tbelieve you are passionate about software and IT. Because we are•\tlike helping people solve their problems, whatever the channel: email or voice•\tfeel confident on your IT technologies exposure up to date,  including the understanding of various operating systems (Linux/Unix, Windows)•\tpossess a solid knowledge of networking, TCP/IP protocols and services•\tare a good communicator and have a “can do” problem solving attitude.•\thave a long friendship with at least one scripting language (Perl, Python, Ruby, shell scripting)•\treally do read, understand and speak English. You will need it.It would be even nicer if you:•\tgathered some experience with Email Servers and Email Protocols (SMTP/POP3/IMAP/etc)•\thave a good idea about web technologies•\tare not a complete stranger of Windows OS inner works •\tare yourself a heavy user of email and collaboration features (Calendar, Contacts, etc)What’s in it for you:•\tBe part of the evolution of one of the few “Made in Romania” software apps. The Axigen Mail Server is used by customers worldwide for the last 10 years•\tA pleasant and friendly work environment, with now no more than 25 people, in which expertise is shared openly and where everybody strives for knowledge and self-improvement•\tAttractive remuneration package, lunch discount tickets, Happy Friday Cookies•\tPrivate health insurance and performance bonuses•\tA flexible program ensuring a fair work/life balance. And yes, overtime is rewarded.•\tLimited transportation hassle: we’re 8 min walking from the subway station, and you won’t go mad if you try to park nearby.About AxigenFounded as GECAD Technologies in 2001, the company became Axigen Messaging in 2012. Separated from the GECAD Group by 2014, the company with 100% Romanian ownership focuses ever since on the development & distribution of innovative messaging solutions. Since its first release in 2005, Axigen was continuously improved and extended, with the next major version – Axigen X – being expected in 2016. The software is currently supported on both Windows and most Linux flavors (RPM distributions, Debian, FreeBSD, Solaris).Axigen’s customer base is extremely diverse, covering from telcos, ISPs, private companies, and banks to academic and government institutions worldwide. \n\n\n", "title": "Technical Support Engineer", "company_url": "http://www.bestjobs.ro/firme/axigen-messaging/13615175/5", "career_level": "Middle", "company": "Axigen Messaging", "locations": "\nStr. Nicolae Caramfil, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-technical-support-engineer/201858/5"}