{"body": "\n\n\n\nThe Website Platform team operates highly available, scalable, fast, and efficient websites including Amazon.com. If you are interested in running some of the world’s largest websites, then this could be the role for you.\n\r\nTo help drive operational costs to the floor we are actively recruiting Systems Engineers to operate our existing fleets, analyze and tune hardware/software configurations, automate existing manual processes and identify improvements to our existing tools. This exciting and high impact role will involve working with a wide range of other technical and business groups within Amazon.\r\nDo you:\r\nCalmly and quickly diagnose and fix critical failures in high pressure situations?\r\nBuild innovative, production-quality tools to solve real operational problems in Perl, Ruby, Python or Java?\r\nInvestigate complicated technical issues scientifically and thoroughly and fix them so they don't come back?\r\nUnderstand how a scalable, modern, cloud-hosted application stack works from top to bottom?\n\n\r\nBA degree in Computer Science or other related field\r\nSome experience with performance analysis, systems software, and systems architecture\r\nProficiency in shell, Perl or Python\r\nAbility to operate in high pressure environment troubleshoot complex issues quickly\r\nOperational knowledge & experience of Linux\r\nStrong communication, prioritization and analytical skills\r\nKnowledge of system performance methodologies\r\nAdvanced level of written and spoken English\n\n\n\n\r\nProficiency in Python, Perl or Java\r\nUnderstanding of TCP/IP networking\r\nStrong knowledge of troubleshooting systems and software in a Linux ecosystem\r\nDesire to build; sense of ownership, urgency, and drive.\r\nCandidates should have strong computer science credentials and should be passionate about Internet technology\n\n\n \n\n\n", "title": "Systems Engineer", "company_url": "http://www.bestjobs.ro/firme/amazon-development-center-romania-srl/1339336/1", "career_level": "Middle", "company": "Amazon Development Center (Romania) SRL", "locations": "\nIași, Județul Iași, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-systems-engineer/752288/1"}