{"body": "\n\n\n\nVeeam's Global Campaigns and Digital Marketing team is now hiring. We are utilizing innovative digital and offline marketing techniques for engagement creation, contextual marketing and lifecycle marketing to connect with our audience in 70+ countries.\n\r\nGoogle, Baidu and Social Media Advertisement Specialist will join the PPC team, which generates demand and awareness for Veeam products across the globe.\n\r\nResponsibilities\n\r\nCreation of high performance Google, Baidu and social media advertisement campaigns (demand generation, nurturing)\r\nMaintenance and optimization of existing campaigns\r\nDevelopment of ad assets (landing pages, banners and ad copies) in collaboration with in-house creative and localization team.\r\nA/B and multivariate testing of ad copies and landing pages\r\nBudget planning and optimization\r\nConstant reporting on campaign performance and results\n\r\nQualifications\n\r\nUnderstanding of SEM, SEO, Analytics and overall Digital Marketing best practices including methods and metrics for analysis\r\nDirect PPC experience with Google AdWords, Bing and retargeting is a must (you need to be certified for Google AdWords and Google Analytics at least)\r\nExperience with basic HTML, JavaScript, and CSS is a plus\r\nFluent English\r\nAnalytical skills, data-driven mindset and strong attention to details\r\nSelf-starter with good organizational and time-management skills; able to multi-task and prioritize as well as strong follow-through\r\nStrong interpersonal, writing, and verbal skills are required\r\nAbility to learn quickly\n\r\nAdditional skills\n\r\nAdditional language is a strong plus (Mandarin)\r\nAsia advertisement experience a plus but not a must\n\r\nWe offer\n\r\nEmployment in a growing dynamic company\r\nModern energetic multicultural environment\r\nInteresting people, an excellent team of professionals\r\nExtensive opportunities for professional growth and career\r\nFlexible work schedule\r\nAn extended medical insurance policy\r\nPartial compensation of costs on fitness \n\n\n", "title": "GOOGLE,  BAIDU AND SOCIAL MEDIA ADVERTISEMENT SPECI", "company_url": "http://www.bestjobs.ro/firme/veeam-software-srl/14236670/5", "career_level": "Entry, Middle", "company": "VEEAM SOFTWARE SRL", "locations": "\nAfi park 1, București, Municipiul București, România\n", "languages": " Engleza, Chineza", "url": "http://www.bestjobs.ro/locuri-de-munca-google-baidu-and-social-media-advertisement-speci/208225/5"}