{"body": "\n\n\n\nDespre Blue Point\n\r\nSuntem o companie care oferă servicii profesioniste de call center. Oferim soluții de business performante, creative și personalizate. Suntem o echipă pentru care inovația, entuziasmul, pasiunea pentru ceea ce facem și orientarea spre rezultate sunt valorile pe care le punem în fiecare proiect.\r\nTe invităm în echipa noastră, unde activitatea de telesales este întotdeauna o provocare.\n\r\nCe urmează să faci\n\r\nSă comunici la telefon, însă nu oricum, ci cu scopul de a promova, a convinge și a vinde produse și servicii;\r\nSă propui oferte adaptate pe nevoile clienților, pentru a le oferi acestora exact lucrurile de care au nevoie;\r\nSă oferi informații relevante și corecte despre produsele și serviciile promovate;\r\nSă gestionezi și să rezolvi solicitările primite de la clienți;\r\nSă te asiguri că ai clienți mulțumiți, să urmărești în tot ce faci atât calitatea, cât și realizarea target-ului stabilit.\n\r\nCe trebuie să știi\n\r\nSă îți placă să vorbești și să comunici cu lejeritate cu ceilalți;\r\nSă ai cunoștințe de Microsoft Office (Word, Excel, Outlook) și de navigare online;\r\nSă fii orientat către client, să fii sensibil la nevoile sale și atent la detalii;\r\nSă îți dorești să înveți neîncetat lucruri noi;\r\nSă ai spirit de echipă;\r\nSă ai abilitatea de a negocia și de a convinge;\r\nSă îți dorești să faci lucrurile să se întâmple;\r\nSă privești proiectele ca pe o provocare și o oportunitate de dezvoltare;\r\nDacă, în plus față de cele de mai sus, mai ai și experiență în vânzări (un avantaj, dar nu un criteriu obligatoriu), ești candidatul ideal și te așteptăm să ne cunoaștem.\n\r\nCe îți oferim\r\nTraining profesional specializat;\r\nAtmosferă prietenoasă, echipă ambițioasă și pozitivă;\r\nProgram de lucru flexibil;\r\nSalariu fix și bonus pentru performanță;\r\nClienți renumiți și proiecte frumoase;\r\nTeambuilding-uri periodice, concursuri motivaționale și activități împreună cu echipa. \n\n\n", "title": "Consultant vanzari prin telefon-Partener Vodafone", "company_url": "http://www.bestjobs.ro/firme/blue-point/2929019/2", "career_level": "Entry, Middle", "company": "Blue Point", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-consultant-vanzari-prin-telefon-partener-vodafone/230533/2"}