{"body": "\n\n\n\nEricsson Overview: Ericsson is a world-leading provider of telecommunications equipment & services to mobile & fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, & more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business & society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people & society to help shape a more sustainable world. We are truly a global company, working across borders in 175 countries, offering a diverse, performance-driven culture & an innovative & engaging environment where employees enhance their potential every day. Our employees live our vision, core values & guiding principles. They share a passion to win & a high responsiveness to customer needs that in turn makes us a desirable partner to our clients. To ensure professional growth, Ericsson offers a stimulating work experience, continuous learning & growth opportunities that allow you to acquire the knowledge & skills necessary to reach your career goals.  Job Summary:Through efficient sourcing of products, services & solutions, the Strategic Sourcing Manager shall strengthen Ericsson’s competitive position by maximizing supplier value, proactively managing business risks & contributing to the creation of value for the Customer. The Strategic Sourcing Manager is accountable for evaluating, qualifying & selecting suppliers for the external purchase & licensing of all products & services either to be delivered to Customers as part of or as an Ericsson delivery or for internal use within Ericsson.The Strategic Sourcing Manager is responsible for all commercial relationship with suppliers. Responsibilities & Tasks:Drive, prepare & execute the Rfx process; Evaluate & select suppliers; Drive preparation, execution & finalization of negotiations with suppliers. Award business to suppliers; Ensure implementation of supplier agreements; Develop the long term business for the specific product / service. Position Qualifications: Behavioral CompetencesDeciding & initiating action; Persuading & influencing; Analyzing; Delivery results & meeting customer expectations; Entrepreneurial & commercial thinking; Creating & innovating. Core Competences Change & Improvement Management Skills; Commercial Acumen Skills; Communication Skills; Facilitate diversity & awareness; Financial acumen & skills; Local laws & regulations knowledge; Negotiation & argumentation skills; Team working skills. Minimum Qualifications & Experience Requirements At least 1 year of relevant experience; A first academic degree or equivalent qualification. Preferred Qualifications & Experience RequirementsBusiness understanding; Leadership through cross functional networks; Local laws & Regulation knowledge; Negotiation & argumentation skills; Proven leadership behaviors; Sourcing practice, process & strategy knowledge. \n\n\n", "title": "Strategic Sourcing Manager HR", "company_url": "http://www.bestjobs.ro/firme/ericsson-telecommunications-romania-srl/12301736/1", "career_level": "Middle", "company": "ERICSSON TELECOMMUNICATIONS ROMANIA SRL", "locations": "\nWest Gate Park, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-strategic-sourcing-manager-hr/749359/1"}