{"body": "\n\n\n\nIDEAL CANDIDATE:\n\r\nBecause YOU're ambitious, communicative and eager to assert, WE will be here for you!\n\r\nOur goal is to be close to the clients, helping them solve the technical or commercial problems they are facing.\n\r\nDo you speak English?Available to work in the afternoon and night shift?\r\nThen join our team, we are glad to welcome you!\n\r\nOn this job you will:\n\r\nProvide client support via phone and e-mail, including procedural documentation. \r\nRespond within agreed time limits to call-outs. \r\nPrioritize and manage casesEstablish a good working relationship with customers and other professionals. \n\r\nWe offer:\n\r\nAn attractive salary package (salary, health insurance, performance bonuses, food coupons and other benefits), one month technical training and professional development opportunity.As an employee of CGS you may choose to have a flexible schedule, with the possibility to work full time or part time according to your availability. In CGS we appreciate performance, involvement, leadership skills, and being a pro-active team member. Join our team: if you think you fit the profile, then we are looking forward to meeting you!\n\r\nCGS is an American outsourcing company, owning one of the largest support centers on the Romanian market. CGS is listed in the first 15 best companies of its kind in the world; meanwhile, our client portfolio includes company in Forbes Top 500, as well as top European companies. We offer extensive training sessions and we stand for promoting people from within: more than 90% of out managers started in our company on entry-level positions.www.cgsinc.com\n \n\n\n", "title": "Customer Care with English- Brasov", "company_url": "http://www.bestjobs.ro/firme/sc-computer-generated-solutions-srl/3660667/2", "career_level": "Entry, Middle", "company": "SC Computer Generated Solutions SRL", "locations": "\nStrada turnului nr 5, Brașov, Județul Brașov, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-customer-care-with-english-brasov/230936/2"}