{"body": "\n\n\n\nAre you interested in working on a website which has 35 million unique visitors per day? Does the thought of working with Scalable Web Architecture intrigue you? We are now looking for Software Engineers whose hearts beat for clean code and who revel in precision and accuracy. We are expanding our current team because keeping our “baby“ up to date technologically is our primary goal. Moreover, new opportunities are constantly arising within the company, thus current programmers are shifting their responsibilities and new positions open up. This is where you come in!We are a Live video streaming company in the capital of Luxembourg and we are the #1 in the live streaming industry. Over the past 15 years our company has seen exponential growth with over 1000 employees across 3 continents with offices in Luxembourg, Los Angeles, Budapest and Hong Kong.TechnologiesWork with multiple technologies: PHP, NodeJS, NoSQL, Distibuted systemsHigh availability systemsHigh traffic systems (35 million daily visitors)2000 servers on 4 nodes worldwideTake part in the research of new technologies and solutionsCodingModular MVC system developmentOOP principles (Design patterns, SOLID, DRY, Yagni)Clean code, covered by unit, integration and UI tests. (incl. TDD)Long life-cycle application development (evolution of applications)Design, develop and test softwareParticipate in the development of technical specificationsMentor other developersDevelopment methodologyAgile development process in ScrumContinuous IntegrationSystem for daily based deployments, Git WorkflowContribute OpenSource projectsWhat we offerOutstanding salary packageRelocation packageAdditional benefits: meal voucher, private health insurance, Sympass cardConferences, certifications, technical workshops, trainings, and language coursesPossibility to evolve in the company (career development, opportunity to work on new projects)Newest hardware, multiple monitorsChill rooms, LAN parties and fun events (check pictures)Safe and multicultural capital in the heart of Europe (check video) ranked as #14 best place to live on the planet EarthMulti-cultural environment, 30 different nations, English being the official languageExpectations5+ years of software development experience3+ years experience that involved working with high-availability, high-performance, scalable systemsStrong knowledge of PHP and also OOP skills and knowledge of design patternsGood knowledge of Unit Testing and Test Driven DevelopmentClean Coding is your most important principleExtensive experience with Relational Databases and NoSQL technologiesFollow current technology improvements and recommend their usage in company products if applicableKnowledge of Agile methodologiesUpper intermediate English knowledge (B2) or higherAdvantagesExperience with Live Streaming and Stream Encoding technologiesFamiliarity with Extreme Programming (XP)Knowledge of other programming languagesContinuous integration \n\n\n", "title": "Software Developer – PHP (based in Luxembourg)", "company_url": "http://www.bestjobs.ro/firme/docler-holding/13900811/5", "career_level": "Middle, Senior", "company": "Docler Holding", "locations": "\nLuxemburg, Luxemburg, Luxemburg\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-software-developer-php-based-in-luxembourg/201418/5"}