{"body": "\n\n\n\nCăutam un coleg sau o colegă care să întregească echipa de aplicaţii mobile ca dezvoltator de aplicaţii native de Android. Căutăm o persoană motivată, entuziastă, nerăbdătoare să-şi aducă contribuţia la dezvoltarea unor aplicaţii cu peste 100 000 de utilizatori şi care îşi doreşte să înveţe constant. Persoana pe care o căutam noi este la curent cu tot ce se întâmplă în lumea aplicaţiilor mobile şi acceptă provocările asociate cu un domeniu în continuă schimbare. Participă la şedinţele cu clientul şi la definirea specificaţiilor, astfel poate optimiza aplicaţiile pe care le dezvoltă chiar de la faza de schiţare a acestora. Responsabilităţi:·      Dezvoltă aplicaţii native de Android conform specificaţiilor agreate;·      Optimizează şi modifică aplicaţiile de Android existente;·      Contribuie activ la designul, specificaţiile, optimizarea şi testarea aplicaţiilor de Android la care lucrează. Cerinţe:·      Experienţă de peste 2 ani în dezvoltarea aplicaţiilor native de Android;·      Cunoştinţe baze de date: MySQL, SQLite;·      Cunoştinţe servicii web: SOAP, XML, JSON. Reprezintă un avantaj:·      Cunoştinţe tehnologii Java: J2SE, J2EE;·      Cunoştinţe IDE: NetBeans, Eclipse;·      Cunoştinţe framework-uri Java: Hibernate, Spring, Struts, JSF;·      Cunoştinţe de Java EE : EJB, JMS, JMX, JDBC;·      Cunoştinţe HTML;·      Absolvent al unei facultăţi de profil;·      Prezentarea unui portofoliu de aplicaţii dezvoltate. Oferta: ·      Contract pe perioadă nedeterminată (cu perioadă de probă);·      Salariu atractiv, conform experienţei şi calificărilor;·      Oportunităţi de dezvoltare profesională;·      Instruire în domeniile tehnice;·      Instruire pe proiect;·      Posibilitatea de a învăţa în cadrul echipei;·      Facilităţi sociale: asigurare medicală privată şi abonament activităţi sportive;·      Program de lucru flexibil;·      Acces rapid la sediul firmei (zona Pipera). \n\n\n", "title": "Programator Android", "company_url": "http://www.bestjobs.ro/firme/radcom-srl/4883/1", "career_level": "Middle", "company": "RADCOM SRL", "locations": "\nStr.George Constantinescu nr.2C MULTIGALAXY II sect 2, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-programator-android/747438/1"}