{"body": "\n\n\n\nSCOP: Identificarea şi satisfacerea necesităţilor clienţilor de tip Corporate din portofoliu; vânzarea de servicii fixe si mobile furnizate de catre companie, cu scopul de a atinge obiectivele de vanzari ale companiei; gestionarea şi monitorizarea portofoliului de client  Corporate alocati, cu scopul de a mentine si creste veniturile generate de acestia; asigurarea consultanţei pentru clienţii din portofoliu.\n\r\n RESPONSABILITĂŢI PRINCIPALE:\n\r\n- Dezvoltă relaţii de afaceri puternice cu clienţii din portofoliu care să contribuie la furnizarea unor informaţii importante pentru planificarea strategiilor privind serviciile şi pachetele de servicii şi pentru fundamentarea tarifelor acestora;\n\r\n- Este responsabil cu realizeazarea planului de vânzări si venituri ale serviciilor de fix si mobil pentru portofoliul de clienti alocat;\n\r\n- Prezintă şi promovează produsele şi serviciile fixe si mobile furnizate de companie clienţilor din portofoliu;\n\r\n- Oferă asistenţă şi asigură consultanţa clienţilor din portofoliu pre/post vanzare;\n\r\n - Realizeaza prognoza rezultatelor de venituri si vanzari;\n\r\n- Prospectează permanent piaţa pentru identificarea de noi clienţi şi pentru cresterea cotei de piaţă a serviciilor şi produselor companiei;\n\r\n- Monitorizează competiţia şi evoluţia pieţei în domeniul comunicaţiilor pentru a identifica şi comunica intern aspectele care necesită îmbunătăţi;\n\r\n- Inregistreaza si actualizeaza informatiile privind oportunitatile de vanzare in CRM Siebel; Întocmeşte şi actualizează fişele de clienţi, conform modelelor prestabilite;\n\r\n CERINTELE POSTULUI\n\r\n - Studii medii; studiile in domeniul comercial/tehnic constituie un avantaj.\n\r\n- Experienţă de minim 1 an în domeniul vanzarilor corporate sau domeniul IT/telecom constituie un avantaj.\n\r\n- Buna cunostere a tehnicilor de vânzare;\n\r\n- Foarte bune abilităţi de comunicare, prezentare şi ascultare activă;\n\r\n- Orientare catre client;\n\r\n - Orientare catre rezultate si solutii;\n\r\n- Bune cunoştinţe de limba engleză;\n\r\n- Bune cunoştinţe de operare PC (MS Office)\n\r\n- Disponibilitate de a călători;\n\r\n- Permis de conducere categoria B (fără incidente). \n\n\n", "title": "Corporate Sales Represenative", "company_url": "http://www.bestjobs.ro/firme/telekom-romania-mobile-communications-s-a/2066958/1", "career_level": "Middle, Senior", "company": "Telekom Romania Mobile Communications S.A.", "locations": "\nBucurești, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-corporate-sales-represenative/730905/1"}