{"body": "\n\n\n\nIDEAL CANDIDATE :\n\r\n• Webhelp Romania is a growing company searching for new enthusiastic and communicative colleagues, that like working in teams.\n\r\n• Knowing that you will be in a perpetual contact with our clients, you will learn how to answer to our needs and to rapidly adapt to changes while having a positive attitude.\n\r\n• We are going to work together in order to help you master the art of communication and that of client relations in order to deliver services of the highest quality.\n\r\n• Integrating our teams in order to enrich you personnel experience and learn to master the communication tools and great number of activities.\n\r\nRESPONSABILITIES :\n\r\n• Publishing the special offers in the field of tourism.\n\r\n• Targeting as best as possible the needs of our clients.\n\r\n• Collecting information in collaboration with our commercials.\n\r\n• Writing original offers and ensure the good publication of the deals.\n\r\nBENEFITS :\n\r\n• In order to help you during your professional career, Webhelp Romania is proposing advanced trainings (paid) that prepare you for the missions that you are going to have inside the company.\n\r\n• With well placed sites (in the city center), we propose to you flexible working hours adapted to your needs.\n\r\n• All the promotions are done inside the company and we do everything in our power to offer you a professional career inside our company.\n\r\n• Attractive revenue (salary, individual and monthly bonuses, subsidies, etc.)\n\r\nCompany description\n\r\nSince 2000, and today N°3 in Europe, Webhelp Group is the fastest growing international operator in Customer Relationship Management. On a daily basis, our 30 000 employees deliver exceptional customer experience in 81 production sites across 21 countries : France, Belgium, Romania, Portugal, Morocco, Algeria, UK, South Africa, Madagascar, India, Netherlands, Italy, Switzerland, Austria, Deutschland, Poland, Czech Republic and Surinam.\n\r\nhttp://job.webhelp.ro/ \n\n\n", "title": "DIGITAL WRITER WITH POLISH", "company_url": "http://www.bestjobs.ro/firme/webhelp/2942498/2", "career_level": "Entry, Middle", "company": "WEBHELP", "locations": "\nStr. Sfintii Voievozi 65, București, Municipiul București, România\n", "languages": " Poloneza", "url": "http://www.bestjobs.ro/locuri-de-munca-digital-writer-with-polish/231102/2"}