{"body": "\n\n\n\nIntelSol (www.intelsol.ro) este o companie privata romaneasca specializata in servicii de telecomunicatii si IT cu clienti atat in Romania cat si in strainatate\n\r\nPentru aceasta pozitie, NU ESTE OBLIGATORIE EXPERIENTA ANTERIOARA - dar ESTE OBLIGATORIE, O MARE DORINTA DE A PERFORMA!\n\r\nAcum, avem nevoie sa ne largim echipa cu o persoana care sa ocupe pozitia de Analist online / IT Researcher.\n\r\nActivitati:\n\r\n- cautari/prospectare piata (research) cu ajutorul motoarelor de cautare Internet si a site-urilor de socializare (in special LinkedIn);\r\n- organizarea informatiilor obtinute conform criteriilor agreate si prezentarea acestora ca rapoarte scrise;\r\n- mentinerea informatiilor actualizate din baza de date alocata;\r\n- postarea de pozitii noi pe site-ul propriu;\r\n- crearea si mentinerea grupurilor/paginilor pentru subiectele de interes (LinkedIn, Facebook, etc);\r\n- participarea la interviuri cu candidati specialisti IT & Telecom;\r\n- completarea rapoartelor de interviu.\n\r\nCerinte:\n\r\n- facultate in curs sau terminata de curand;\r\n- cunostinte bune de limba Engleza;\r\n- cunostinte bune de lucru in mediu Windows, pachetul Office (Word, Excel, Power Point si Outlook);\r\n- o buna organizare personala (timp, mediu de lucru PC);\r\n- capacitate de concentrare;\r\n- creativitate;\r\n- de preferat: familiar cu LinkedIn (www.linkedin.com);\r\n- de preferat: familiar cu moduri de cautare booleene.\n\r\nOferta:\n\r\n- salariu motivant;\r\n- se asigura training la locul de munca;\r\n- in timp, potential de a incepe o cariera in marketing, vanzari sau in resurse umane (recrutare);\r\n- sediu nou in locatie centrala (zona Hala Traian, Sector 2);\r\n- lucru 100% la birou. \n\n\n", "title": "Analist online / IT Researcher", "company_url": "http://www.bestjobs.ro/firme/intelsol/809955/1", "career_level": "Entry, Middle", "company": "IntelSol", "locations": "\nAustrului 44, București, Municipiul București, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-analist-online-it-researcher/752236/1"}