{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a long term basis, offering at the same time a wide variety of features such as expertise, challenging development opportunities in an international environment and the joy of a strong spirit.MissionYou will join a team responsible for supporting a the type of business very complex and dynamic. Financial products and solutions embed advanced mathematics and finance concepts, but they also need to be out on the market as fast as possible to beat the competition:Responsibilities:Develop new features front to back as part of an Agile/Scrum team; Ensure the delivery of high quality solutions to agreed specifications and within agreed time scales; Assure the corrective maintenance; Drive innovation by coming up with new ideas for our products and processes; Point out issues with the existing architectures and codes on different projects, followed by active involvement in order to clean it up; Maintain a close relationship with the French team and ensure that the final result responds to its needs. Write technical specifications for an effective implementation; Acting as an adviser and mentor for other less experienced team members, if necessary. Desired Skills and ExperienceTechnical profileExcellent understanding of C#.NET GUI development, multi-threading, Oracle (SQL) ; Experience with Unit Testing & Continuos Integration frameworks approach is appreciated; Bachelor’s degree in Computer Science or equivalent. We will also value :A responsible attitude and ambition in achieving your mission; A good combination of rigor, creativity and communication skills; Good command of English, both written and spoken with the ability to participate in English-only meetings. — French knowledge is an advantage; Enthusiasm, self-confidence, innovative problem-solving skills, curious, autonomous and really keen to develop his tech skills.Benefits:Competitive remuneration and benefits package, based on qualifications and experience; Possibilities of promotion and development of a career plan; A modern working environment: open, informal, fun and start-up atmosphere; Meal tickets; Private health insurance; Yearly bonus per company policy; Permanent employment contract.Company Société Générale European Business Services is a player in the shared service center market and delivers high added value services in various fields of activity for worldwide entities of the Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20 countries mostly across Europe for all major business lines of the Société Générale Group.The Shared Service Center for IT (SSC-IT) of SG EBS is a new organization that started early in 2015 to provide Société Générale Group IT Services. The mission of SSC IT is to contribute to SG Group transformation by proposing advanced high quality IT services along with innovative operating models.SSC-IT has today over 100 employees, and ambitions to grow beyond 300 in the next before end of 2017. \n\n\n", "title": "C# Developer with Windows Forms", "company_url": "", "career_level": "Middle, Senior", "company": "", "locations": "\nBucurești, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-c-developer-with-windows-forms/750160/1"}