{"body": "\n\n\n\nSUMMARY OF THE POSITION: \r\nParticipate for the Applicative Solutions group in the administration of Microsoft SQL databases required by projects or support / maintenance activities.\n\r\nResponsibilities:\n\r\n•Advise users in defining their needs (processes and systems);\r\n•Approve data models and tables produced by other technical resources;\r\n•Advise developers on techniques used to achieve better performance and work together with them in SQL query rewrite as needed;\r\n•Migrate BD components in development environments, integrated testing, pre-production and production;\r\n•Special Back-up/Restore requested by the development team in the development and pre-production environments;\r\n•Optimize application performance  by adding required indexes, doing re-indexation of BD, identifying non performing SQL procedure and recommending optimizations, etc.;\r\n•Manage access rights to the DB;\r\n•Participate in the evaluation, design and / or acquisition as well as the implementation of new applications or major improvements to existing business applications.\n\r\nQualifications & Experience:\n\r\n•Bachelor Degree in computer science and more than 3 years of experience;\r\n•Experience in technical support to development teams (required)\r\n•Thorough knowledge of T-SQL (required)\r\n•Excellent ability in performance tuning (SQL best practices, data modeling and indexing) (required)\r\n•Experience with Informatica ETL tool (Asset)\r\n•Good knowledge of data modeling (Asset)\n\r\nCapabilities:\r\n•Proficiency in English (French writing and speaking is an advantage); \r\n•Attention to detail and thoroughness;\r\n•Customer service oriented;\r\n•Ability to work well in a team environment.\n\r\nWe offer: \r\n•A friendly and professional working environment;\r\n•Opportunities to learn and grow in a multi-national company. \n\n\n\n\n", "title": "MS SQL DataBase Administrator", "company_url": "http://www.bestjobs.ro/firme/snc-lavalin-romania/12574356/1", "career_level": "Middle", "company": "SNC Lavalin Romania", "locations": "\nDimitrie Pompeiu 5-7, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-ms-sql-database-administrator/751514/1"}