{"body": "\n\n\n\nSociété Générale European Business Services is lookingfor high standard professionals ready to commit on a long term basis, offeringat the same time a wide variety of features such as expertise, challengingdevelopment opportunities in an international environment and the joy of astrong spirit. \r\nResponsabilities:\r\n- Managing the chart of account referential in the respect for the accounting standards of Société Générale Group (creations and modifications of accounts and / or attributes);-      Participating to accounting projects to implement  accounts and attributes;\r\n- Giving expertise to users of the accounting platform on the charts of accounts;-      Proposing tool changes in order to optimize workload; \r\n- Maintaining procedures up to date;\r\n- Issuing monthly Reports on Chart of accounts;\r\n- Launching quality campaign in order to rationalize Chart of accounts. \n\r\nStudies and experience:\n\r\n- Required level of studies: Master in Accounting/Finance/Economics/Business Management \r\n- Good knowledge of Accounting and its processes, \r\n- 2-5 years of previous Accounting experience; \r\n- Previous experience on chart of account management would be considered a plus;\r\n- Very good French knowledge ;\n\r\nProfile:\n\r\n- Rigor and  precision;\r\n- Cooperation and team spirit;\r\n- Communication skills;\r\n- Capacity to participate to projects. \n\r\nPlease note that only the selected candidates will be contacted for an interview and all the CVs will be kept in our database for future suitable professional opportunities.\n\r\n Société Générale European Business Services is a player in the shared service center market and delivers high added value services in various fields of activity for worldwide entities of the Group (finance/ accounting, procurement, humanresources and IT).  The company is currently serving over 20 countries mostly across Europe for all major business lines of the Société Générale Group.The Finance Shared Service Center of Société Générale European Business Services, launched in 2011, now counts more than 250 staff delivering services for more than 300 client entities.The team’s activity consists in delivering two important kinds of processes: accounting – namely Group reporting in IFRS, statutory and regulatory reporting on top of the permanent supervision activities and related set of control; and Account Payable and Travel & Expenses, with teams specialize in optimizing all procure to pay activities.\n\n\n \n\n\n", "title": "Charts of Accounts Referential with French", "company_url": "", "career_level": "Middle", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Engleza, Franceza", "url": "http://www.bestjobs.ro/locuri-de-munca-charts-of-accounts-referential-with-french/749954/1"}