{"body": "\n\n\n\nWhy join us? Because you, as a Store Manager, can be the best you can be, everyday.In JYSK, we believe that good sales & service builds on strong personal values. Therefore, our Store Managers always strive to be great tradesmen and good colleagues. Through your team, you always look for ways to improve store turnover, daily operations and staff performance and development. What can you expect to be doing, day to day?•Having the full responsibility of your store, you will maximize sales & service.•Going in front and getting the best out of your team, you will learn new things about leadership, retail and yourself.•Dealing with operational issues like planning, prioritizing and follow up on staff performance.•Ensuring that you and your team stick to the JYSK concept to ensure a consistent flow of goods and competent, helpful and available staff.•Being a consistent role model for our values: tradesman, colleague and corporate spirit.•Assisting your team in all kind of other tasks like goods receiving, organizing stock room, filling shelves and ordering articles.How can you make a difference, every day?•You like rolling up your sleeves to get things done•You are passionate about optimizing sales through great customer service•You create results through overview, pro-activeness and decisiveness.•You spot and use the full potential of your team, and communicate easily with your your colleagues as well as your customers.•You are efficient in planning, prioritizing and following up on budgets, goals and costs•You see things in a broad perspective, but still have an eye for detail.•You nave worked in retail with comparable management experienceCurious?Would you like to join a company that constantly trains and develops its employees at all levels, and offers attractive bonuses for good performance?A company that puts honor in developing its own managers?Then send you CV.Only the selected candidates will be contacted. \n\n\n", "title": "STORE MANAGER JYSK in Medias", "company_url": "http://www.bestjobs.ro/firme/jysk-romania-srl/10588081/5", "career_level": "Middle, Senior", "company": "JYSK Romania SRL", "locations": "\nMediaș, Județul Sibiu, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-store-manager-jysk-in-medias/199353/5"}