{"body": "\n\n\n\nWe are hiring because of growing and expanding our team in a Corporate Travel & Expense industry, top products worldwide and a big number of clients / platform users. Our client is part of an international, challenging and friendly environment.\r\nYou will have the opportunity to use the latest .NET and modern web technologies to design and build new components and features for our large scale web applications, create automated tests and make sure the software lives up to our high quality standards in a growing platform. \r\nAgile is the Methodology that we like! You can be part of an experienced and dynamic Scrum team and will be involved in all the phases of a software development product life cycle, from requirements analysis and design through implementation, testing and deployment.\r\nYou have a solid Computer Science background, relevant industry experience and a passion for clean code? Come and meet us!\n\r\nAbout our activity and responsibilities:\r\n•\tDesign and implement software solutions for our web applications;\r\n•\tPerform code reviews;\r\n•\tWrite unit tests (both for back-end and front-end);\r\n•\tUnit Testing, Test-Driven Development, Integration Testing;\r\n•\tConsider performance tuning, improvements and focus on quality standards\n\r\nCutting edge technologies:\r\n•\tDesign, develop, and implement software solutions based on Microsoft and open source technologies: C#, .NET Framework, ASP.NET WebAPI, MVC, WebForms, HTML, CSS, JavaScript, NHIbernate, Oracle, Windsor Castle dependency injection, xUnit, RhinoMocks.\n\r\nTechnical skills:\r\n•\tExperience in .Net or C# development is essential\r\n•\tWeb application development using ASP.NET WebAPI, MVC, WebForms\r\n•\tGood command of SQL databases (preferably Oracle)\r\n•\tGood to have: Single Page Application development using JavaScript, Backbone, Marionette, Handlebars, Bootstrap, responsive design, Node.js, Npm, Bower\n\r\nNice to have: \r\n•\tExperience designing and implementing REST APIs\r\n•\tExperience in programming / writing of unit test, TDD using xUnit, RhinoMocks or other frameworks, \r\n•\tDependency Injection containers knowledge (Windsor Castle or others);\r\n•\tExperience with NoSQL databases (CouchBase, Redis and/or MongoDB)\r\n•\tExperience in solving performance issues (profiling, query optimization, caching)\r\n•\tKnowledge about Dependency Injection containers and techniques, Unit testing and mocking frameworks (xUnit, RhinoMocks).\n\r\nOur team profile:\r\n•\tAbility to openly present own ideas \r\n•\tIndependent and highly motivated with a strong customer focus \r\n•\tAble to work both independently and as part of a team \r\n•\tFluency in English; French would be a big plus \r\n•\tWilling and able to be part of international projects and initiatives \r\n•\tAction and results orientated, ability to manage multiple priorities.\n \n\n\n", "title": "Senior .Net Developer", "company_url": "http://www.bestjobs.ro/firme/stefanini/3482/1", "career_level": "Middle, Senior", "company": "Stefanini", "locations": "\nDimitrie Pompei nr 6A, București, Municipiul București, România\n", "languages": " Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-net-developer/751163/1"}