{"body": "\n\n\n\nSociété Générale European Business Services is looking for high standard professionals ready to commit on a longterm basis, offering at the same time a wide variety of features such asexpertise, challenging development opportunities in an international environmentand the joy of a strong spirit.\r\nResponsibilities:•\tCoordoneaza echipele de proiect si ofera suport si consultanta pentru a duce la bun sfarsit obiectivele proiectelor in termenele agreate•\tPromoveaza si implementeaza metodologia Managementul Proiectelor in cadrul SG EBS si aplicatiile informatice asociate acesteia.•\tPlanifică în mod detaliat implementarea fiecarui proiect, controlează si monitorizeaza fiecare proiect;•\tManagerul de Proiect va valida final Planul de Proiect si alocarea nominala a resurselor din toate compartimentele organizationale implicate in proiect.•\tConduce Echipa de Proiect pentru a obtine descrierea obiectivelor si a nevoilor beneficiarului proiectului si a partilor afectate de Proiect (echipa de proiect) în scopul elaborarii documentului final de Specificatii de Business (”Business & User Requirements). •\tPe baza Specificatiilor de business (Business & User Requirements) si a feedback-ului obtinut din partea Echipei de Proiect, Managerul de Proiect elaboreaza Specificatiile Functionale.•\tManagerul de Proiect va valida final Specificatiile Functionale in vederea asigurarii corelarii acestui document cu Specificatiile de business (Business & User Requirements). •\tManagerul de Proiect va valida final Specificatiile Tehnice (”Technical Requirements”) inainte de demararea dezvoltarilor IT in vederea asigurarii corelarii acestui document cu Specificatiile de business (”Business & User Requirements”) si Specificatiile functionale (”Functional Requirements”). •\tCoordoneaza si/ sau efectueaza testele functionale pentru noile dezvoltari informatice in colaborare cu utilizatorii respectivi•\tRealizeaza impreuna cu compartimentele organizationale implicate ghidurile de utilizare aferente noilor dezvoltari informatice si ofera suport in vederea intelegerii si promovarii noilor functionalitati catre beneficiarii finali.•\tDa acordul din punct de vedere functional, pentru punerea in productie a aplicatiilor informatice pentru proiectele gestionate \r\nRequirements:• 5 - 7 ani experienta in Project Management •\tStudii financiar-bancare – Academia de Studii Economice •\tCunostinte de IT: liceu cu profil informatic sau facultatea de Cibernetica - ASE•\tBuna intelegere a metodologiei proiectelor de IT – intelegerea business-ului si a specificatiilor functionale, testare, change management, training pentru utilizatori•\tEngleza nivel avansat si Franceza nivel mediu•\tExcelente abilitati de comunicare si persuasiune •\tPersoana analitica, autonoma, orientata spre rezultate•\tExpunere la mediu si cultura organizationala internationala •\t1 - 2 luni training in Paris; disponibilitate de a calatori ori de cate ori este nevoie la Paris si in alte locatii din Europa\n\r\nPlease note that only the selected candidates will be contacted for an interview and all the CVs will be kept in our database for future suitable professional opportunities.\n\r\nSociété Générale European BusinessServices is a player in the shared service center market and delivers highadded value services in various fields of activity for worldwide entities ofthe Group (finance/ accounting, procurement, human resources and IT). The company is currently serving over 20countries mostly across Europe for all major business lines of the Société Générale Group.\r\nThe Finance Shared Service Center of SociétéGénérale European Business Services, launched in 2011, now counts more than 250staff delivering services for more than 300 client entities.\r\nThe team’s activity consists indelivering two important kinds of processes: accounting – namely Groupreporting in IFRS, statutory and regulatory reporting on top of the permanentsupervision activities and related set of control; and Account Payable and Travel& Expenses, with teams specialize in optimizing all procure to pay activities. \n\n\n", "title": "Senior Project Manager", "company_url": "", "career_level": "Senior", "company": "", "locations": "\nStrada preciziei, București, Municipiul București, România\n", "languages": " Franceza, Engleza", "url": "http://www.bestjobs.ro/locuri-de-munca-senior-project-manager/749719/1"}