{"body": "\n\n\n\nHoneywell International is a $37 billion diversified technology and manufacturing global leader, with more than 120,000 employees in 100 countries around the world and has a demonstrated heritage of both innovation and achievement. For our strategic business group TS (Transportation Systems), we are searching for a Finance Analyst to join the Romanian office in Bucharest!If you have:Bachelor degree in Finance Minimum 2 to 3 years financial experience with a large multinational company preferred and previous experience in financial planning in Analysis as a plus Strong finance background Strong Microsoft Excel & PowerPoint skills Ample knowledge of ERP Tools (e.g. SAP, Hyperion) Technical expertise in Finance Planning and Analysis: Income Statement, Balance Sheet and Cash Flow, Consolidation Excellent level of numeracy with high standard of personal integrity and decisiveness Strong problem solving and influencing skills Results driven approach Excellent written and communication skills Pro-active approach and the capability of working on own initiative The ability to synthesize information and proved senior leadership with necessary information to make a strategic decision then join us because you are the financial analyst we are searching for!The Financial Analyst supports the global consolidation of TS forecasting process: Annual Operating Plan, 8+4, 5+7. Offers support for monthly closing reporting for TS globally. As your main responsibilities, you will be:Responsible for standard cost accounting, checking, analysing and controlling production costs (actual vs standard); Monitoring variation between actual costs and budget/ forecast; making proposals for improvement of cost control to stay in the budget; Responsible with managing the fixed assets module in SAP; Completing the financial part of PAR (Capital investments process approval) and controlling the investment spending to avoid exceeding the budgets approved; Ensuring support to the Finance Manager in monthly reporting to headquarters; Ensuring support to Chief Accountant for the statutory audit; Responsible for Account Reconciliation for the specific accounts that enter in your responsibility; Actively contributing in the continuous improvement of the plant; constantly identifying opportunities to eliminate waste and proposing solutions to improve your activity as well as for the plant; Proposing Kaizen ideas/month in accordance with plant objectives; Participating and managing department and plant initiatives that will help improving costs;  Responsible for assuring all the internal control standards set by the company; Want to learn more? Visit:Our career website: www.careersathoneywell.com Channel: http://www.youtube.com/watch?v=CcMf_TFS0kA http://www.youtube.com/watch?v=Tj8Jr2USl4M Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status. - See more at: http://www.careersathoneywell.com/en/jobsearch/jobdescription.aspx?languageid=1&jobid=00281661#sthash.O3RzNOF7.dpuf \n\n\n", "title": "Finance Analyst", "company_url": "http://www.bestjobs.ro/firme/honeywell/13325158/1", "career_level": "Middle", "company": "Honeywell", "locations": "\nGeorge constantinescu, București, Municipiul București, România\n", "url": "http://www.bestjobs.ro/locuri-de-munca-finance-analyst/750007/1"}