{"body": "\n\n\n\nPentru ca TU esti ambitios, comunicativ si dornic de afirmare, NOI iti suntem alaturi! \n\r\nScopul nostru este de a consilia clientul, ajutandu-l sa rezolve problemele de ordin tehnic sau comercial cu care se confrunta. Daca stii sa utilizezi un calculator si esti la inceput de drum in cariera, noi suntem aici pentru a te ajuta sa te dezvolti!\n\r\nIata ce va trebui sa faci: \n\r\nPreiei apeluri de la clienti si identifici corect situatiile cu care se confrunta. \r\nRezolvi problemele sau directionezi clientii catre departamentul potrivit.  \r\nInregistrezi corect si complet informatiile obtinute in urma apelurilor.\n\n\r\nIata ce iti oferim: \n\r\nUn pachet salarial atractiv (salariu, asigurare de sanatate, bonusuri de performanta, tichete de masa si alte beneficii). Ca anagajat la CGS poti alege un program de lucru flexibil, cu posibilitatea de a lucra full- time sau part- time. \n\r\nIti oferim traininguri extensive si sustinem promovarea in interiorul companiei: peste 90% dintre managerii nostri s-au alaturat CGS pe pozitii de incepatori.In CGS apreciem performanta, implicarea, abilitatile de management si pro-activitatea.  Alatura-te echipei noastre! \n\r\nCorespunzi acestui profil? Daca da, te asteptam in echipa!\n\n\n\r\nCGS este o companie americana de outsourcing, care detine unul dintre cele mai mari centre de suport de pe piata din Romania. CGS se afla in primele 15 cele mai bune companii din lume din domeniul sau de activitate. In acelasi timp, portofoliul nostru de clienti include companii din Top Forbes 500, precum si firme europene de top.www.cgsinc.com/ro-ro\n \n\n\n", "title": "Consultant Relatii Clienti - Brasov", "company_url": "http://www.bestjobs.ro/firme/sc-computer-generated-solutions-srl/3660667/2", "career_level": "Entry, Middle", "company": "SC Computer Generated Solutions SRL", "locations": "\nStrada turnului nr 5, Brașov, Județul Brașov, România\n", "languages": " Romana", "url": "http://www.bestjobs.ro/locuri-de-munca-consultant-relatii-clienti-brasov/230940/2"}